[Killed] ObjectLiteral
main/pages/CourseOverTime/CourseOverTimeIndexPage.js:13:13
 
   const objectToAxiosParams = (query) => ({
     url: "/api/public/courseovertime/search",
-    params: {
-      startQtr: query.startQuarter,
-      endQtr: query.endQuarter,
-      subjectArea: query.subject,
-      courseNumber: query.courseNumber + query.courseSuf,
-    },
+    params: {},
   });
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "courseNumber": "130A",
-   "endQtr": "20222",

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeIndexPage.js:21:34
     },
   });
 
-  const onSuccess = (courses) => {
-    const sortedCourses = courses.sort((a, b) =>
-      b.courseInfo.quarter.localeCompare(a.courseInfo.quarter),
-    );
-    setCourseJSON(sortedCourses);
-  };
+  const onSuccess = (courses) => {};
 
   const mutation = useBackendMutation(
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeIndexPage.js:22:40
   });
 
   const onSuccess = (courses) => {
-    const sortedCourses = courses.sort((a, b) =>
-      b.courseInfo.quarter.localeCompare(a.courseInfo.quarter),
+    const sortedCourses = courses.sort(() => undefined,
     );
     setCourseJSON(sortedCourses);
killedBy: CourseOverTimeIndexPage tests sorts courses in descending order by quarter
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "M22"
Received string:    "➕  W22ECE       1A COMP ENGR SEMINAROpen84/100PHELP 1260M W    3:30 PM - 4:45 PMHESPANHA J P12583"

[Killed] MethodExpression
main/pages/CourseOverTime/CourseOverTimeIndexPage.js:22:27
   });
 
   const onSuccess = (courses) => {
-    const sortedCourses = courses.sort((a, b) =>
-      b.courseInfo.quarter.localeCompare(a.courseInfo.quarter),
-    );
+    const sortedCourses = courses;
     setCourseJSON(sortedCourses);
   };
killedBy: CourseOverTimeIndexPage tests sorts courses in descending order by quarter
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "M22"
Received string:    "➕  W22ECE       1A COMP ENGR SEMINAROpen84/100PHELP 1260M W    3:30 PM - 4:45 PMHESPANHA J P12583"
