[Killed] StringLiteral
main/components/Nav/AppNavbar.js:40:29
             style={{
               backgroundColor: "#34859B",
               padding: "5px 15px",
-              borderRadius: "8px",
+              borderRadius: "",
             }}
           >
killedBy: AppNavbar tests renders the Course History/Course Over Time menu correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background-color: rgb(52, 133, 155); padding: 5px 15px; border-radius: 8px;") // element.getAttribute("style") === "background-color: rgb(52, 133, 155); padding: 5px 15px; border-radius: 8px;"

Expected the element to have attribute:
  style="background-color: rgb(52, 133, 155); padding: 5px 15px; border-radius: 8px;"
Received:
  style="background-c

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:75:16
                   Personal Schedules
                 </Nav.Link>
               )}
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link
-                  href="/courses/list"
-                  data-testid="appnavbar-courses-list"
-                >
-                  Courses
-                </Nav.Link>
-              )}
+              {false}
             </Nav>
 
killedBy: AppNavbar tests renders Personal Schedules and Courses links correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Courses. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
    >
