[Killed] ArrowFunction
main/components/GradeHistory/GradeHistoryTable.js:8:17
   const columns = [
     {
       Header: "Quarter",
-      accessor: (row) => fromFormat(row.yyyyq),
+      accessor: () => undefined,
       id: "quarter",
     },
killedBy: GradeHistoryTable tests displays history of 3 different quarters correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  FALL 2009
Received:

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryTable.js:9:11
     {
       Header: "Quarter",
       accessor: (row) => fromFormat(row.yyyyq),
-      id: "quarter",
+      id: "",
     },
     {
killedBy: GradeHistoryTable tests displays history of 3 different quarters correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="GradeHistoryTable-cell-row-0-col-quarter"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryTable.js:24:15
       accessor: "grade",
     },
     {
-      Header: "Count",
+      Header: "",
       accessor: "count",
     },
killedBy: GradeHistoryTable tests displays history of 3 different quarters correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Count. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
