[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:192:45
     },
   ];
 
-  const handlePageSizeChange = (newSize) => {
-    setPageSize(newSize);
-    setSelectedPage(1);
-  };
+  const handlePageSizeChange = (newSize) => {};
 
   return (
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:209:19
         ))}
       </Accordion>
 
-      <div style={{ marginTop: "1rem" }} />
+      <div style={{}} />
 
       <JobsSearchForm
killedBy: AdminJobsPage tests AdminJobsPage renders spacing divs with correct margin styles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:217:35
         updatePageSize={handlePageSizeChange}
       />
 
-      <div style={{ marginBottom: "1rem" }} />
+      <div style={{ marginBottom: "" }} />
       <OurPagination
         updateActivePage={setSelectedPage}
killedBy: AdminJobsPage tests AdminJobsPage renders spacing divs with correct margin styles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/pages/Admin/AdminJobsPage.js:220:21
       <div style={{ marginBottom: "1rem" }} />
       <OurPagination
         updateActivePage={setSelectedPage}
-        totalPages={page?.totalPages || 0}
+        totalPages={true}
         currentPage={selectedPage}
       />
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OurPagination-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
