[Killed] ArithmeticOperator
main/components/Quarters/SingleQuarterDropdown.js:23:21
   label = "Quarter",
 }) {
   const localSearchQuarter = localStorage.getItem(controlId);
-  const lastIndex = quarters.length - 1;
+  const lastIndex = quarters.length + 1;
   const defaultQuarter = quarters[lastIndex].yyyyq;
 
killedBy: PersonalScheduleForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'yyyyq')

[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.js:31:5
   }
 
   const [quarterState, setQuarterState] = useState(
-    quarter.yyyq || localSearchQuarter || defaultQuarter,
+    false,
   );
 
killedBy: SingleQuarterSelector tests when localstorage has a value, it is passed to useState
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "20202"
Received: false

Number of calls: 1

<html>

[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.js:31:5
   }
 
   const [quarterState, setQuarterState] = useState(
-    quarter.yyyq || localSearchQuarter || defaultQuarter,
+    false || defaultQuarter,
   );
 
killedBy: SingleQuarterSelector tests when localstorage has a value, it is passed to useState
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "20202"
Received: "20224"

Number of calls: 1

<html>
