[Killed] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:20:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/users", selectedPage, pageSize, sortDirection],
-    {
-      // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
-      method: "GET",
-      url: "/api/admin/users",
-      params: {
-        page: selectedPage - 1,
-        pageSize,
-        sortDirection,
-      },
-    },
+    {},
     { content: [], totalPages: 0 },
   );
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
