[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:58:29
             ALL
           </option>
         )}
-        {options.map((c) => {
-          const slug = `${c.buildingCode}-${c.roomNumber}`.replace(/ /g, "-");
-          const key = `${controlId}-option-${slug}`;
-          return (
-            <option key={key} data-testid={key} value={c.roomNumber}>
-              {c.buildingCode} {c.roomNumber}
-            </option>
-          );
-        })}
+        {options.map((c) => {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleClassroomDropdown renders a single classroom option
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cd1-option-ILP-1101"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] StringLiteral
main/components/Classrooms/SingleClassroomDropdown.js:59:24
           </option>
         )}
         {options.map((c) => {
-          const slug = `${c.buildingCode}-${c.roomNumber}`.replace(/ /g, "-");
+          const slug = ``.replace(/ /g, "-");
           const key = `${controlId}-option-${slug}`;
           return (
killedBy: SingleClassroomDropdown renders a single classroom option
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cd1-option-ILP-1101"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] StringLiteral
main/components/Classrooms/SingleClassroomDropdown.js:59:74
           </option>
         )}
         {options.map((c) => {
-          const slug = `${c.buildingCode}-${c.roomNumber}`.replace(/ /g, "-");
+          const slug = `${c.buildingCode}-${c.roomNumber}`.replace(/ /g, "");
           const key = `${controlId}-option-${slug}`;
           return (
killedBy: SingleClassroomDropdown replaces spaces with hyphens in the generated test-id slug
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cdSlug-option-ENG-LAB-101-A"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] StringLiteral
main/components/Classrooms/SingleClassroomDropdown.js:60:23
         )}
         {options.map((c) => {
           const slug = `${c.buildingCode}-${c.roomNumber}`.replace(/ /g, "-");
-          const key = `${controlId}-option-${slug}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={c.roomNumber}>
killedBy: SingleClassroomDropdown renders a single classroom option
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cd1-option-ILP-1101"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
