[Killed] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:11:6
   const pageSize = 10;
 
   const { data: usersPage = {} } = useBackend(
-    ["/api/admin/users", page, pageSize],
+    ["", page, pageSize],
     {
       method: "GET",
killedBy: AdminUsersPage tests renders without crashing and fetches from correct endpoint
statusReason: expected "useBackend" to be called with arguments: [ Array(2) ]

Received:

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] StringLiteral
main/pages/Admin/AdminUsersPage.jsx:15:48
     {
       method: "GET",
       url: "/api/admin/users",
-      params: { page, pageSize, sortDirection: "ASC" },
+      params: { page, pageSize, sortDirection: "" },
     },
   );
killedBy: AdminUsersPage tests renders without crashing and fetches from correct endpoint
statusReason: expected "useBackend" to be called with arguments: [ Array(2) ]

Received:

  1st useBackend call:

@@ -7,10 +7,10 @@
    {

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:19:22
     },
   );
 
-  const totalPages = usersPage.totalPages || 1;
+  const totalPages = false;
   const users = usersPage.content || [];
 
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  disabled=""
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Next page"
/>

[Killed] LogicalOperator
main/pages/Admin/AdminUsersPage.jsx:19:22
     },
   );
 
-  const totalPages = usersPage.totalPages || 1;
+  const totalPages = usersPage.totalPages && 1;
   const users = usersPage.content || [];
 
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  disabled=""
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Next page"
/>

[Killed] LogicalOperator
main/pages/Admin/AdminUsersPage.jsx:20:17
   );
 
   const totalPages = usersPage.totalPages || 1;
-  const users = usersPage.content || [];
+  const users = usersPage.content && [];
 
   const getPageNumbers = () => {
killedBy: AdminUsersPage tests renders without crashing and fetches from correct endpoint
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:20:17
   );
 
   const totalPages = usersPage.totalPages || 1;
-  const users = usersPage.content || [];
+  const users = false;
 
   const getPageNumbers = () => {
killedBy: AdminUsersPage tests renders without crashing and fetches from correct endpoint
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Admin/AdminUsersPage.jsx:22:32
   const totalPages = usersPage.totalPages || 1;
   const users = usersPage.content || [];
 
-  const getPageNumbers = () => {
-    const pages = new Set([0, totalPages - 1]);
-    for (
-      let i = Math.max(0, page - 2);
-      i <= Math.min(totalPages - 1, page + 2);
-      i++
-    ) {
-      pages.add(i);
-    }
-    return [...pages].sort((a, b) => a - b);
-  };
+  const getPageNumbers = () => {};
 
   const pageNumbers = getPageNumbers();
killedBy: AdminUsersPage tests renders without crashing and fetches from correct endpoint
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:23:31
   const users = usersPage.content || [];
 
   const getPageNumbers = () => {
-    const pages = new Set([0, totalPages - 1]);
+    const pages = new Set([0, totalPages + 1]);
     for (
       let i = Math.max(0, page - 2);
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  style="width: 36px; text-align: center; color: rgb(108, 117, 125); font-size: 13px;"
>
  …
</span> instead

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:25:27
   const getPageNumbers = () => {
     const pages = new Set([0, totalPages - 1]);
     for (
-      let i = Math.max(0, page - 2);
+      let i = Math.max(0, page + 2);
       i <= Math.min(totalPages - 1, page + 2);
       i++
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: Unable to find an accessible element with the role "button" and name "2"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] MethodExpression
main/pages/Admin/AdminUsersPage.jsx:25:15
   const getPageNumbers = () => {
     const pages = new Set([0, totalPages - 1]);
     for (
-      let i = Math.max(0, page - 2);
+      let i = Math.min(0, page - 2);
       i <= Math.min(totalPages - 1, page + 2);
       i++
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.jsx:26:7
     const pages = new Set([0, totalPages - 1]);
     for (
       let i = Math.max(0, page - 2);
-      i <= Math.min(totalPages - 1, page + 2);
+      i < Math.min(totalPages - 1, page + 2);
       i++
     ) {
killedBy: AdminUsersPage tests shows correct nearby pages around current page
statusReason: Unable to find an accessible element with the role "button" and name "3"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] MethodExpression
main/pages/Admin/AdminUsersPage.jsx:26:12
     const pages = new Set([0, totalPages - 1]);
     for (
       let i = Math.max(0, page - 2);
-      i <= Math.min(totalPages - 1, page + 2);
+      i <= Math.max(totalPages - 1, page + 2);
       i++
     ) {
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
>
  4
</button> instead

[Killed] UpdateOperator
main/pages/Admin/AdminUsersPage.jsx:27:7
     for (
       let i = Math.max(0, page - 2);
       i <= Math.min(totalPages - 1, page + 2);
-      i++
+      i--
     ) {
       pages.add(i);
killedBy: AdminUsersPage tests renders without crashing and fetches from correct endpoint
statusReason: Set maximum size exceeded

[Killed] BlockStatement
main/pages/Admin/AdminUsersPage.jsx:28:7
       let i = Math.max(0, page - 2);
       i <= Math.min(totalPages - 1, page + 2);
       i++
-    ) {
-      pages.add(i);
-    }
+    ) {}
     return [...pages].sort((a, b) => a - b);
   };
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: Unable to find an accessible element with the role "button" and name "2"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:31:38
     ) {
       pages.add(i);
     }
-    return [...pages].sort((a, b) => a - b);
+    return [...pages].sort((a, b) => a + b);
   };
 
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: expected [ 1, 10, 2, 3 ] to deeply equal [ 1, 2, 3, 10 ]

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:31:28
     ) {
       pages.add(i);
     }
-    return [...pages].sort((a, b) => a - b);
+    return [...pages].sort(() => undefined);
   };
 
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: expected [ 1, 10, 2, 3 ] to deeply equal [ 1, 2, 3, 10 ]

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:36:28
 
   const pageNumbers = getPageNumbers();
 
-  const renderPageButton = (p) => (
-    <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
-      {p + 1}
-    </button>
-  );
+  const renderPageButton = () => undefined;
 
   // Stryker disable all
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: Unable to find role="button" and name "1"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.jsx:37:29
   const pageNumbers = getPageNumbers();
 
   const renderPageButton = (p) => (
-    <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
+    <button style={btnStyle(p !== page)} onClick={() => setPage(p)}>
       {p + 1}
     </button>
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:37:51
   const pageNumbers = getPageNumbers();
 
   const renderPageButton = (p) => (
-    <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
+    <button style={btnStyle(p === page)} onClick={() => undefined}>
       {p + 1}
     </button>
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:38:8
 
   const renderPageButton = (p) => (
     <button style={btnStyle(p === page)} onClick={() => setPage(p)}>
-      {p + 1}
+      {p - 1}
     </button>
   );
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] BooleanLiteral
main/pages/Admin/AdminUsersPage.jsx:85:27
       <div style={containerStyle}>
         {/* Previous */}
         <button
-          style={btnStyle(false)}
+          style={btnStyle(true)}
           onClick={() => setPage((p) => Math.max(p - 1, 0))}
           disabled={page === 0}
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 400;
+ font-weight: 500;

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:86:20
         {/* Previous */}
         <button
           style={btnStyle(false)}
-          onClick={() => setPage((p) => Math.max(p - 1, 0))}
+          onClick={() => undefined}
           disabled={page === 0}
           title="Previous page"
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] MethodExpression
main/pages/Admin/AdminUsersPage.jsx:86:41
         {/* Previous */}
         <button
           style={btnStyle(false)}
-          onClick={() => setPage((p) => Math.max(p - 1, 0))}
+          onClick={() => setPage((p) => Math.min(p - 1, 0))}
           disabled={page === 0}
           title="Previous page"
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:87:21
         <button
           style={btnStyle(false)}
           onClick={() => setPage((p) => Math.max(p - 1, 0))}
-          disabled={page === 0}
+          disabled={true}
           title="Previous page"
         >
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  disabled=""
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Previous page"
/>

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:87:21
         <button
           style={btnStyle(false)}
           onClick={() => setPage((p) => Math.max(p - 1, 0))}
-          disabled={page === 0}
+          disabled={false}
           title="Previous page"
         >
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Previous page"
/>

[Killed] MethodExpression
main/pages/Admin/AdminUsersPage.jsx:94:10
         </button>
 
         {renderPageButton(pageNumbers[0])}
-        {pageNumbers.slice(1).map((p, i) => {
+        {pageNumbers.map((p, i) => {
           const prev = pageNumbers[i];
           return (
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: Found multiple elements with the role "button" and name "1"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  style="width: 36px; height: 36px; border: 0.5px solid var(--bs-primary, #0d6efd); border-radius: 4px; background: rgb(13, 110, 253); color: white; font-weight: 500; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content

[Killed] BlockStatement
main/pages/Admin/AdminUsersPage.jsx:94:45
         </button>
 
         {renderPageButton(pageNumbers[0])}
-        {pageNumbers.slice(1).map((p, i) => {
-          const prev = pageNumbers[i];
-          return (
-            <React.Fragment key={p}>
-              {p - prev > 1 && <span style={ellipsisStyle}>…</span>}
-              {renderPageButton(p)}
-            </React.Fragment>
-          );
-        })}
+        {pageNumbers.slice(1).map((p, i) => {})}
 
         {/* Next */}
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: Unable to find an accessible element with the role "button" and name "2"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.jsx:98:16
           const prev = pageNumbers[i];
           return (
             <React.Fragment key={p}>
-              {p - prev > 1 && <span style={ellipsisStyle}>…</span>}
+              {p - prev >= 1 && <span style={ellipsisStyle}>…</span>}
               {renderPageButton(p)}
             </React.Fragment>
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: Found multiple elements with the text: …

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  style="width: 36px; text-align: center; color: rgb(108, 117, 125); font-size: 13px;"
>

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:98:16
           const prev = pageNumbers[i];
           return (
             <React.Fragment key={p}>
-              {p - prev > 1 && <span style={ellipsisStyle}>…</span>}
+              {p + prev > 1 && <span style={ellipsisStyle}>…</span>}
               {renderPageButton(p)}
             </React.Fragment>
killedBy: AdminUsersPage tests page buttons are sorted and ellipsis appears for gaps
statusReason: Found multiple elements with the text: …

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  style="width: 36px; text-align: center; color: rgb(108, 117, 125); font-size: 13px;"
>

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.jsx:107:20
         {/* Next */}
         <button
           style={btnStyle(false)}
-          onClick={() => setPage(page + 1)}
+          onClick={() => undefined}
           disabled={page >= totalPages - 1}
           title="Next page"
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:107:34
         {/* Next */}
         <button
           style={btnStyle(false)}
-          onClick={() => setPage(page + 1)}
+          onClick={() => setPage(page - 1)}
           disabled={page >= totalPages - 1}
           title="Next page"
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- font-weight: 500;
+ font-weight: 400;

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.jsx:108:21
         <button
           style={btnStyle(false)}
           onClick={() => setPage(page + 1)}
-          disabled={page >= totalPages - 1}
+          disabled={true}
           title="Next page"
         >
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  disabled=""
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Next page"
/>

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:108:29
         <button
           style={btnStyle(false)}
           onClick={() => setPage(page + 1)}
-          disabled={page >= totalPages - 1}
+          disabled={page >= totalPages + 1}
           title="Next page"
         >
killedBy: AdminUsersPage tests pagination navigates pages correctly and shows different rows per page
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  style="width: 36px; height: 36px; border: 1px solid rgb(222, 226, 230); border-radius: 4px; background: white; color: rgb(33, 37, 41); font-weight: 400; font-size: 13px; cursor: pointer; display: inline-flex; align-items: center; justify-content: center;"
  title="Next page"
/>
