[Killed] StringLiteral
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:83:29
             {event.title} - {event.area}
           </Popover.Header>
           <Popover.Body>
-            <p data-testid={`${testId}-description`}>
+            <p data-testid={``}>
               {event.name}
               <br />
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: Error: Unable to find an element by: [data-testid="PersonalSectionsEvent-description"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] EqualityOperator
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:103:12
               {event.title}
             </Card.Text>
           )}
-          {style.height >= 40 && ( // Stryker disable all : no need to test text formatting
+          {style.height < 40 && ( // Stryker disable all : no need to test text formatting
             <Card.Text
               data-testid={`${testId}-time`}
killedBy: PersonalSectionsEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: /2:00\s*-\s*3:15/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"

[Killed] EqualityOperator
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewEvent.js:103:12
               {event.title}
             </Card.Text>
           )}
-          {style.height >= 40 && ( // Stryker disable all : no need to test text formatting
+          {style.height > 40 && ( // Stryker disable all : no need to test text formatting
             <Card.Text
               data-testid={`${testId}-time`}
killedBy: PersonalSectionsEvents tests renders event with height from 12:00 to 12:40 with font size 14px
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsEvent-time"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="PersonalSectionsEvent-06619"
