[Killed] ArrayDeclaration
main/pages/Admin/AdminLoadSubjectsPage.jsx:13:5
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/UCSBSubjects/all"],
+    [],
     { method: "GET", url: "/api/UCSBSubjects/all" },
     [],
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/UCSBSubjects/all' ], …(2) ]

Received:

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
main/pages/Admin/AdminLoadSubjectsPage.jsx:14:15
     status: _status,
   } = useBackend(
     ["/api/UCSBSubjects/all"],
-    { method: "GET", url: "/api/UCSBSubjects/all" },
+    { method: "", url: "/api/UCSBSubjects/all" },
     [],
   );
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/UCSBSubjects/all' ], …(2) ]

Received:

  1st useBackend call:

  [
    [

[Killed] ArrowFunction
main/pages/Admin/AdminLoadSubjectsPage.jsx:18:31
     [],
   );
 
-  const objectToAxiosParams = () => ({
-    url: "/api/UCSBSubjects/load",
-    method: "POST",
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (subjects) => {
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Admin/AdminLoadSubjectsPage.jsx:18:38
     [],
   );
 
-  const objectToAxiosParams = () => ({
-    url: "/api/UCSBSubjects/load",
-    method: "POST",
-  });
+  const objectToAxiosParams = () => ({});
 
   const onSuccess = (subjects) => {
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/AdminLoadSubjectsPage.jsx:23:35
     method: "POST",
   });
 
-  const onSuccess = (subjects) => {
-    toast(`Number of Subjects Loaded : ${subjects.length}`);
-  };
+  const onSuccess = (subjects) => {};
 
   const mutation = useBackendMutation(
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: expected "vi.fn()" to be called with arguments: [ 'Number of Subjects Loaded : 3' ]

Number of calls: 0

[Killed] StringLiteral
main/pages/Admin/AdminLoadSubjectsPage.jsx:24:11
   });
 
   const onSuccess = (subjects) => {
-    toast(`Number of Subjects Loaded : ${subjects.length}`);
+    toast(``);
   };
 
killedBy: AdminLoadSubjectsPage tests what happens when you click load, admin - originally nothing in table, load 3 subjects
statusReason: expected "vi.fn()" to be called with arguments: [ 'Number of Subjects Loaded : 3' ]

Received:

  1st vi.fn() call:

  [
-   "Number of Subjects Loaded : 3",
