[Killed] StringLiteral
main/pages/Admin/AdminRateLimitingPage.jsx:16:5
     "10",
   );
   const [sortField, setSortField] = useLocalStorage(
-    "RateLimitedIPsSearch.SortField",
+    "",
     "requestCount",
   );
killedBy: AdminRateLimitingPage tests When localstorage has values, they are used
statusReason: expected { page: +0, pageSize: '50', …(2) } to deeply equal { page: +0, pageSize: '50', …(2) }

[Killed] StringLiteral
main/pages/Admin/AdminRateLimitingPage.jsx:17:5
   );
   const [sortField, setSortField] = useLocalStorage(
     "RateLimitedIPsSearch.SortField",
-    "requestCount",
+    "",
   );
   const [sortDirection, setSortDirection] = useLocalStorage(
killedBy: AdminRateLimitingPage tests When localstorage is empty, fallback values are used
statusReason: expected { page: +0, pageSize: '10', …(2) } to deeply equal { page: +0, pageSize: '10', …(2) }

[Killed] StringLiteral
main/pages/Admin/AdminRateLimitingPage.jsx:20:5
     "requestCount",
   );
   const [sortDirection, setSortDirection] = useLocalStorage(
-    "RateLimitedIPsSearch.SortDirection",
+    "",
     "DESC",
   );
killedBy: AdminRateLimitingPage tests When localstorage has values, they are used
statusReason: expected { page: +0, pageSize: '50', …(2) } to deeply equal { page: +0, pageSize: '50', …(2) }
