[Killed] MethodExpression
main/components/PersonalSchedulesWeeklyView/PersonalSchedulesWeeklyViewPanel.js:70:16
                   {day}
                 </Card.Title>
               </Card.Body>
-              {Events.filter(
-                // Stryker disable next-line all : no need to test startTime edge case
-                (event) => event.day.includes(day) && event.startTime !== "",
-              ).map((event) => (
+              {Events.map((event) => (
                 <PersonalSectionsEvents
                   key={event.id}
killedBy: PersonalSchedulesWeeklyViewPanel tests renders events on correct days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 7
