[Killed] BlockStatement
main/components/Utils/OurPagination.js:13:26
   testId = "OurPagination",
   currentPage = 1,
 }) => {
-  const nextPage = () => {
-    const newPage = Math.min(currentPage + 1, totalPages);
-    updateActivePage(newPage);
-  };
+  const nextPage = () => {};
   const prevPage = () => {
     const newPage = Math.max(currentPage - 1, 1);
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 6

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.js:14:30
   currentPage = 1,
 }) => {
   const nextPage = () => {
-    const newPage = Math.min(currentPage + 1, totalPages);
+    const newPage = Math.min(currentPage - 1, totalPages);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 5

[Killed] MethodExpression
main/components/Utils/OurPagination.js:14:21
   currentPage = 1,
 }) => {
   const nextPage = () => {
-    const newPage = Math.min(currentPage + 1, totalPages);
+    const newPage = Math.max(currentPage + 1, totalPages);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 6

[Killed] BlockStatement
main/components/Utils/OurPagination.js:17:26
     const newPage = Math.min(currentPage + 1, totalPages);
     updateActivePage(newPage);
   };
-  const prevPage = () => {
-    const newPage = Math.max(currentPage - 1, 1);
-    updateActivePage(newPage);
-  };
+  const prevPage = () => {};
   const thisPage = (page) => {
     updateActivePage(page);
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 9

[Killed] MethodExpression
main/components/Utils/OurPagination.js:18:21
     updateActivePage(newPage);
   };
   const prevPage = () => {
-    const newPage = Math.max(currentPage - 1, 1);
+    const newPage = Math.min(currentPage - 1, 1);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 6

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.js:18:30
     updateActivePage(newPage);
   };
   const prevPage = () => {
-    const newPage = Math.max(currentPage - 1, 1);
+    const newPage = Math.max(currentPage + 1, 1);
     updateActivePage(newPage);
   };
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 9

[Killed] ArrowFunction
main/components/Utils/OurPagination.js:25:22
     updateActivePage(page);
   };
 
-  const pageButton = (number) => (
-    <Pagination.Item
-      key={number}
-      active={number === currentPage}
-      onClick={() => thisPage(number)}
-      data-testid={`${testId}-${number}`}
-    >
-      {number}
-    </Pagination.Item>
-  );
+  const pageButton = () => undefined;
 
   const generateSimplePaginationItems = () => {
killedBy: OurPagination tests renders the correct text for totalPages 5 maxPages 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 2

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:28:15
   const pageButton = (number) => (
     <Pagination.Item
       key={number}
-      active={number === currentPage}
+      active={false}
       onClick={() => thisPage(number)}
       data-testid={`${testId}-${number}`}
killedBy: OurPagination tests renders the correct text for totalPages 5 maxPages 2
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:28:15
   const pageButton = (number) => (
     <Pagination.Item
       key={number}
-      active={number === currentPage}
+      active={true}
       onClick={() => thisPage(number)}
       data-testid={`${testId}-${number}`}
killedBy: OurPagination tests renders the correct text for totalPages 5 maxPages 2
statusReason: Error: expect(element).not.toHaveClass("active")

Expected the element not to have class:
  active
Received:
  page-item active

[Killed] ArrowFunction
main/components/Utils/OurPagination.js:29:16
     <Pagination.Item
       key={number}
       active={number === currentPage}
-      onClick={() => thisPage(number)}
+      onClick={() => undefined}
       data-testid={`${testId}-${number}`}
     >
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:47:26
   const generatePaginationItemsWithEllipsis = () => {
     const paginationItems = emptyArray();
 
-    const leftEllipsis = currentPage > 3;
+    const leftEllipsis = currentPage >= 3;
     const rightEllipsis = currentPage < totalPages - 2;
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 9

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:47:26
   const generatePaginationItemsWithEllipsis = () => {
     const paginationItems = emptyArray();
 
-    const leftEllipsis = currentPage > 3;
+    const leftEllipsis = currentPage <= 3;
     const rightEllipsis = currentPage < totalPages - 2;
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 7

[Killed] EqualityOperator
main/components/Utils/OurPagination.js:48:27
     const paginationItems = emptyArray();
 
     const leftEllipsis = currentPage > 3;
-    const rightEllipsis = currentPage < totalPages - 2;
+    const rightEllipsis = currentPage <= totalPages - 2;
 
     paginationItems.push(pageButton(1));
killedBy: OurPagination tests renders the correct text for totalPages 5 maxPages 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 8

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:48:27
     const paginationItems = emptyArray();
 
     const leftEllipsis = currentPage > 3;
-    const rightEllipsis = currentPage < totalPages - 2;
+    const rightEllipsis = true;
 
     paginationItems.push(pageButton(1));
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 7

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:51:9
     const rightEllipsis = currentPage < totalPages - 2;
 
     paginationItems.push(pageButton(1));
-    if (leftEllipsis) {
+    if (false) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 8

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.js:60:26
       );
     }
     // Show a range of pages around the active page
-    let start = Math.max(currentPage - 1, 2);
+    let start = Math.max(currentPage + 1, 2);
     let end = Math.min(currentPage + 1, totalPages - 1);
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 6

[Killed] MethodExpression
main/components/Utils/OurPagination.js:60:17
       );
     }
     // Show a range of pages around the active page
-    let start = Math.max(currentPage - 1, 2);
+    let start = Math.min(currentPage - 1, 2);
     let end = Math.min(currentPage + 1, totalPages - 1);
 
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 8

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.js:61:41
     }
     // Show a range of pages around the active page
     let start = Math.max(currentPage - 1, 2);
-    let end = Math.min(currentPage + 1, totalPages - 1);
+    let end = Math.min(currentPage + 1, totalPages + 1);
 
     for (let number = start; number <= end; number++) {
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 8

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.js:61:24
     }
     // Show a range of pages around the active page
     let start = Math.max(currentPage - 1, 2);
-    let end = Math.min(currentPage + 1, totalPages - 1);
+    let end = Math.min(currentPage - 1, totalPages - 1);
 
     for (let number = start; number <= end; number++) {
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] BlockStatement
main/components/Utils/OurPagination.js:63:55
     let start = Math.max(currentPage - 1, 2);
     let end = Math.min(currentPage + 1, totalPages - 1);
 
-    for (let number = start; number <= end; number++) {
-      paginationItems.push(pageButton(number));
-    }
+    for (let number = start; number <= end; number++) {}
 
     if (rightEllipsis) {
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:67:9
       paginationItems.push(pageButton(number));
     }
 
-    if (rightEllipsis) {
+    if (false) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders the correct text for totalPages 12 maxPages 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ConditionalExpression
main/components/Utils/OurPagination.js:81:5
   };
 
   const generatePaginationItems = () =>
-    totalPages <= maxPages
+    false
       ? generateSimplePaginationItems()
       : generatePaginationItemsWithEllipsis();
killedBy: OurPagination tests renders the correct text for totalPages 5 maxPages 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 6
