[Killed] BlockStatement
main/pages/Admin/AdminJobLogPage.jsx:7:31
 import { useBackend } from "main/utils/useBackend";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-const AdminJobLogPage = () => {
-  const { id } = useParams();
-  const navigate = useNavigate();
-
-  const { data: jobLogs } = useBackend([`/api/jobs/logs/${id}`], {
-    method: "GET",
-    url: `/api/jobs/logs/${id}`,
-  });
-
-  const handleBack = () => {
-    navigate("/admin/jobs");
-  };
-
-  return (
-    <BasicLayout>
-      <Button onClick={handleBack}>Back to Job List</Button>
-      <h3>Job Logs for Job {id}</h3>
-      {jobLogs ? <pre>{jobLogs}</pre> : <p>Loading...</p>}
-    </BasicLayout>
-  );
-};
+const AdminJobLogPage = () => {};
 
 export default AdminJobLogPage;
killedBy: AdminJobLogPage tests renders the AdminJobLogPage with back button and header
statusReason: Unable to find an element with the text: Back to Job List. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/pages/Admin/AdminJobLogPage.jsx:11:41
   const { id } = useParams();
   const navigate = useNavigate();
 
-  const { data: jobLogs } = useBackend([`/api/jobs/logs/${id}`], {
+  const { data: jobLogs } = useBackend([``], {
     method: "GET",
     url: `/api/jobs/logs/${id}`,
killedBy: AdminJobLogPage tests ensures correct URL and method are used
statusReason: expected [ '' ] to deeply equal [ '/api/jobs/logs/1' ]

[Killed] ObjectLiteral
main/pages/Admin/AdminJobLogPage.jsx:11:66
   const { id } = useParams();
   const navigate = useNavigate();
 
-  const { data: jobLogs } = useBackend([`/api/jobs/logs/${id}`], {
-    method: "GET",
-    url: `/api/jobs/logs/${id}`,
-  });
+  const { data: jobLogs } = useBackend([`/api/jobs/logs/${id}`], {});
 
   const handleBack = () => {
killedBy: AdminJobLogPage tests ensures correct URL and method are used
statusReason: expected {} to deeply equal { method: 'GET', …(1) }

[Killed] BlockStatement
main/pages/Admin/AdminJobLogPage.jsx:16:28
     url: `/api/jobs/logs/${id}`,
   });
 
-  const handleBack = () => {
-    navigate("/admin/jobs");
-  };
+  const handleBack = () => {};
 
   return (
killedBy: AdminJobLogPage tests clicking 'Back to Job List' navigates back to /admin/jobs
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/jobs' ]

Number of calls: 0
