[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:167:6
   ];
 
   const { data: page, refetch } = useBackend(
-    ["/api/jobs"],
+    [""],
     {
       method: "GET",
killedBy: AdminJobsPage tests useBackend is called with correct arguments
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/jobs' ], …(3) ]

Received:

  1st useBackend call:

@@ -1,16 +1,16 @@
  [
