[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:99:52
   }
 };
 
-export const formatSession = (quarter, session) => {
-  const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse || !session || session.trim() === "") {
-    return "";
-  }
-  return session.length > 5 ? session[5].trim() : "";
-};
+export const formatSession = (quarter, session) => {};
 
 export const getQuarter = (row) =>
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:101:38
 
 export const formatSession = (quarter, session) => {
   const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse || !session || session.trim() === "") {
+  if (!isSummerCourse || !session || session.trim() !== "") {
     return "";
   }
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] LogicalOperator
src/main/utils/sectionUtils.jsx:101:7
 
 export const formatSession = (quarter, session) => {
   const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse || !session || session.trim() === "") {
+  if (!isSummerCourse && !session || session.trim() === "") {
     return "";
   }
killedBy: ConvertedSectionTable tests renders blank session for non-summer or missing session
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:104:10
   if (!isSummerCourse || !session || session.trim() === "") {
     return "";
   }
-  return session.length > 5 ? session[5].trim() : "";
+  return true ? session[5].trim() : "";
 };
 
killedBy: ConvertedSectionTable tests renders blank session for non-summer or missing session
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:104:10
   if (!isSummerCourse || !session || session.trim() === "") {
     return "";
   }
-  return session.length > 5 ? session[5].trim() : "";
+  return session.length <= 5 ? session[5].trim() : "";
 };
 
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:
