[Killed] ObjectLiteral
main/components/Nav/AppNavbar.jsx:22:28
 import headerImg from "../../../assets/header-logo-240.png";
 
 // Icon shown alongside each SystemMessage, matched to its React Bootstrap Alert variant.
-const systemMessageIcons = {
-  danger: faExclamationCircle,
-  warning: faExclamationTriangle,
-  success: faCheckCircle,
-  info: faInfoCircle,
-};
+const systemMessageIcons = {};
 
 export default function AppNavbar({
killedBy: AppNavbar tests renders a banner with the right variant, icon, and message for each system message
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:189:16
               <Nav.Link href="/downloads" data-testid="appnavbar-downloads">
                 Downloads
               </Nav.Link>
-              {currentUser && currentUser.loggedIn ? (
+              {false ? (
                 <>
                   <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Unable to find an element with the text: Welcome, pconrad.cis@gmail.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNav

[Killed] OptionalChaining
main/components/Nav/AppNavbar.jsx:203:8
           </Navbar.Collapse>
         </Container>
       </Navbar>
-      {systemInfo?.systemMessages?.map((systemMessage, index) => (
+      {systemInfo.systemMessages?.map((systemMessage, index) => (
         <Alert
           key={index}
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Cannot read properties of undefined (reading 'systemMessages')

[Killed] OptionalChaining
main/components/Nav/AppNavbar.jsx:203:8
           </Navbar.Collapse>
         </Container>
       </Navbar>
-      {systemInfo?.systemMessages?.map((systemMessage, index) => (
+      {systemInfo?.systemMessages.map((systemMessage, index) => (
         <Alert
           key={index}
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
main/components/Nav/AppNavbar.jsx:208:24
           key={index}
           variant={systemMessage.variant}
           className="mb-0 rounded-0 text-center"
-          data-testid={`AppNavbar-systemMessage-${index}`}
+          data-testid={``}
         >
           <FontAwesomeIcon
killedBy: AppNavbar tests renders a banner with the right variant, icon, and message for each system message
statusReason: Unable to find an element by: [data-testid="AppNavbar-systemMessage-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
