[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:14:20
   // for the first and last values in the dropdown lists, with the actual
   // *currently selectted* start and end quarters for the search!
 
-  const firstQtr = systemInfo?.startQtrYYYYQ || "20211";
+  const firstQtr = true;
   const lastQtr = systemInfo?.endQtrYYYYQ || "20214";
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: param should be a string

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:14:20
   // for the first and last values in the dropdown lists, with the actual
   // *currently selectted* start and end quarters for the search!
 
-  const firstQtr = systemInfo?.startQtrYYYYQ || "20211";
+  const firstQtr = systemInfo?.startQtrYYYYQ && "20211";
   const lastQtr = systemInfo?.endQtrYYYYQ || "20214";
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: Value "20201" not found in options

Ignored nodes: comments, script, style
<select
  class="form-control"
  data-testid="CourseOverTimeDescriptionSearch.StartQuarter"
  id="CourseOverTimeDescriptionSearch.StartQuarter"
>

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:15:19
   // *currently selectted* start and end quarters for the search!
 
   const firstQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const lastQtr = systemInfo?.endQtrYYYYQ || "20214";
+  const lastQtr = systemInfo?.endQtrYYYYQ && "20214";
 
   const quarters = quarterRange(firstQtr, lastQtr);
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests Fallbacks render correctly
statusReason: param should be a string

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:15:19
   // *currently selectted* start and end quarters for the search!
 
   const firstQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const lastQtr = systemInfo?.endQtrYYYYQ || "20214";
+  const lastQtr = true;
 
   const quarters = quarterRange(firstQtr, lastQtr);
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: param should be a string

[Killed] EqualityOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:30:5
     "CourseOverTimeDescriptionSearch.SearchTerms",
   );
   const localStorageLectureOnly =
-    localStorage.getItem("CourseOverTimeDescriptionSearch.LectureOnly") ===
-    "true";
+    localStorage.getItem("CourseOverTimeDescriptionSearch.LectureOnly") !== "true";
 
   const [startQuarter, setStartQuarter] = useState(
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:30:5
     "CourseOverTimeDescriptionSearch.SearchTerms",
   );
   const localStorageLectureOnly =
-    localStorage.getItem("CourseOverTimeDescriptionSearch.LectureOnly") ===
-    "true";
+    true;
 
   const [startQuarter, setStartQuarter] = useState(
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:34:5
     "true";
 
   const [startQuarter, setStartQuarter] = useState(
-    localStartQuarter || firstQtr,
+    localStartQuarter && firstQtr,
   );
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when systemInfo data is undefined, fallback quarters are used
statusReason: expected '20214' to be '20211' // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:42:5
 
   const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
   const [lectureOnly, setLectureOnly] = useState(
-    localStorageLectureOnly || false,
+    false,
   );
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I click submit with local storage values, they are retained
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:42:32
 
   const [searchTerms, setSearchTerms] = useState(localSearchTerms || "");
   const [lectureOnly, setLectureOnly] = useState(
-    localStorageLectureOnly || false,
+    localStorageLectureOnly || true,
   );
 
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:45:49
     localStorageLectureOnly || false,
   );
 
-  const handleStartQuarterChange = (quarter) => {
-    setStartQuarter(quarter);
-    localStorage.setItem(
-      "CourseOverTimeDescriptionSearch.StartQuarter",
-      quarter,
-    );
-  };
+  const handleStartQuarterChange = (quarter) => {};
 
   const handleEndQuarterChange = (quarter) => {
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:48:7
   const handleStartQuarterChange = (quarter) => {
     setStartQuarter(quarter);
     localStorage.setItem(
-      "CourseOverTimeDescriptionSearch.StartQuarter",
+      "",
       quarter,
     );
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: expected "vi.fn()" to not be called with arguments: [ '', '20201' ]

Received:

  1st vi.fn() call:

  [
-   "",

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:53:47
     );
   };
 
-  const handleEndQuarterChange = (quarter) => {
-    setEndQuarter(quarter);
-    localStorage.setItem("CourseOverTimeDescriptionSearch.EndQuarter", quarter);
-  };
+  const handleEndQuarterChange = (quarter) => {};
 
   const handleSubmit = (event) => {
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:58:35
     localStorage.setItem("CourseOverTimeDescriptionSearch.EndQuarter", quarter);
   };
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    localStorage.setItem(
-      "CourseOverTimeDescriptionSearch.SearchTerms",
-      searchTerms,
-    );
-    fetchJSON(event, { startQuarter, endQuarter, searchTerms, lectureOnly });
-  };
+  const handleSubmit = (event) => {};
 
   const handleSearchTermsOnChange = (event) => {
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:71:48
     setSearchTerms(event.target.value);
   };
 
-  const handleLectureOnlyOnChange = (event) => {
-    setLectureOnly(event.target.checked);
-    localStorage.setItem(
-      "CourseOverTimeDescriptionSearch.LectureOnly",
-      event.target.checked.toString(),
-    );
-  };
+  const handleLectureOnlyOnChange = (event) => {};
 
   const testid = "CourseOverTimeDescriptionSearchForm";
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:100:22
               quarter={endQuarter}
               setQuarter={handleEndQuarterChange}
               controlId={"CourseOverTimeDescriptionSearch.EndQuarter"}
-              label={"End Quarter"}
+              label={""}
             />
           </Col>
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select an end quarter, the state for end quarter changes
statusReason: Unable to find a label with the text of: End Quarter

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:113:26
         </Form.Group>
         <Form.Group controlId="CourseOverTimeDescriptionSearch.LectureOnly">
           <FormCheck
-            data-testid={`${testid}-checkbox`}
+            data-testid={``}
             label="Lectures Only"
             onChange={handleLectureOnlyOnChange}
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: Unable to find an element by: [data-testid="CourseOverTimeDescriptionSearchForm-checkbox"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeDescriptionSearchForm.jsx:120:24
           ></FormCheck>
         </Form.Group>
         <Row
-          data-testid={`${testid}-bottom-row`}
+          data-testid={``}
           style={{ paddingTop: 10, paddingBottom: 10 }}
         >
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests Button padding is correct
statusReason: Unable to find an element by: [data-testid="CourseOverTimeDescriptionSearchForm-bottom-row"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
