[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:12:39
 ];
 // Stryker restore all
 
-export const getEnrollmentSeriesKey = (dataPoint) =>
-  `${dataPoint.enrollCd}-${dataPoint.section}`;
+export const getEnrollmentSeriesKey = () => undefined;
 
 export const getEnrollmentSeriesLabel = (dataPoint) =>
killedBy: EnrollmentHistoryGraph tests formats data point series details
statusReason: expected undefined to be '07609-0100' // Object.is equality

[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:15:41
 export const getEnrollmentSeriesKey = (dataPoint) =>
   `${dataPoint.enrollCd}-${dataPoint.section}`;
 
-export const getEnrollmentSeriesLabel = (dataPoint) =>
-  `${dataPoint.enrollCd} - Section ${dataPoint.section}`;
+export const getEnrollmentSeriesLabel = () => undefined;
 
 export const formatDateCreated = (dateCreated) => dateCreated.slice(0, 10);
killedBy: CourseDetailsIndexPage tests passes returned enrollment history data to the graph
statusReason: Unable to find an element with the text: 06619 - Section 0100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <span
    aria-hidden="true"
    id="recharts_measurement_span"
    style="position: absolute; top: -20000px; left: 0px; pa

[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:18:34
 export const getEnrollmentSeriesLabel = (dataPoint) =>
   `${dataPoint.enrollCd} - Section ${dataPoint.section}`;
 
-export const formatDateCreated = (dateCreated) => dateCreated.slice(0, 10);
+export const formatDateCreated = () => undefined;
 
 export const formatEnrollmentTooltip = (value, name) => [
killedBy: EnrollmentHistoryGraph tests formats chart labels and tooltip values
statusReason: expected undefined to be '2026-04-06' // Object.is equality

[Killed] MethodExpression
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:18:51
 export const getEnrollmentSeriesLabel = (dataPoint) =>
   `${dataPoint.enrollCd} - Section ${dataPoint.section}`;
 
-export const formatDateCreated = (dateCreated) => dateCreated.slice(0, 10);
+export const formatDateCreated = (dateCreated) => dateCreated;
 
 export const formatEnrollmentTooltip = (value, name) => [
killedBy: EnrollmentHistoryGraph tests formats chart labels and tooltip values
statusReason: expected '2026-04-06T08:15:00.000000' to be '2026-04-06' // Object.is equality

[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:20:40
 
 export const formatDateCreated = (dateCreated) => dateCreated.slice(0, 10);
 
-export const formatEnrollmentTooltip = (value, name) => [
-  `Enrollment: ${value}`,
-  name,
-];
+export const formatEnrollmentTooltip = () => undefined;
 
 export const createEnrollmentHistoryChartData = (data = []) => {
killedBy: EnrollmentHistoryGraph tests formats chart labels and tooltip values
statusReason: expected undefined to deeply equal [ 'Enrollment: 32', …(1) ]

[Killed] ArrayDeclaration
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:20:57
 
 export const formatDateCreated = (dateCreated) => dateCreated.slice(0, 10);
 
-export const formatEnrollmentTooltip = (value, name) => [
-  `Enrollment: ${value}`,
-  name,
-];
+export const formatEnrollmentTooltip = (value, name) => [];
 
 export const createEnrollmentHistoryChartData = (data = []) => {
killedBy: EnrollmentHistoryGraph tests formats chart labels and tooltip values
statusReason: expected [] to deeply equal [ 'Enrollment: 32', …(1) ]

[Killed] StringLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:21:3
 export const formatDateCreated = (dateCreated) => dateCreated.slice(0, 10);
 
 export const formatEnrollmentTooltip = (value, name) => [
-  `Enrollment: ${value}`,
+  ``,
   name,
 ];
killedBy: EnrollmentHistoryGraph tests formats chart labels and tooltip values
statusReason: expected [ '', '07609 - Section 0100' ] to deeply equal [ 'Enrollment: 32', …(1) ]

[Killed] ArrayDeclaration
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:25:57
   name,
 ];
 
-export const createEnrollmentHistoryChartData = (data = []) => {
+export const createEnrollmentHistoryChartData = (data = ["Stryker was here"]) => {
   const sortedData = [...data].sort((a, b) =>
     a.dateCreated.localeCompare(b.dateCreated),
killedBy: EnrollmentHistoryGraph tests creates empty chart data when called with no argument
statusReason: expected { chartData: [ { …(2) } ], …(1) } to deeply equal { chartData: [], series: [] }

[Killed] MethodExpression
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:26:22
 ];
 
 export const createEnrollmentHistoryChartData = (data = []) => {
-  const sortedData = [...data].sort((a, b) =>
-    a.dateCreated.localeCompare(b.dateCreated),
-  );
+  const sortedData = [...data];
   const seriesByKey = new Map();
   const chartDataByDate = new Map();
killedBy: EnrollmentHistoryGraph tests sorts chart data chronologically by date created
statusReason: expected [ '2026-05-03', '2026-05-01', …(1) ] to deeply equal [ '2026-05-01', '2026-05-02', …(1) ]

[Killed] ArrowFunction
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:26:37
 ];
 
 export const createEnrollmentHistoryChartData = (data = []) => {
-  const sortedData = [...data].sort((a, b) =>
-    a.dateCreated.localeCompare(b.dateCreated),
+  const sortedData = [...data].sort(() => undefined,
   );
   const seriesByKey = new Map();
killedBy: EnrollmentHistoryGraph tests sorts chart data chronologically by date created
statusReason: expected [ '2026-05-03', '2026-05-01', …(1) ] to deeply equal [ '2026-05-01', '2026-05-02', …(1) ]

[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:32:37
   const seriesByKey = new Map();
   const chartDataByDate = new Map();
 
-  sortedData.forEach((dataPoint) => {
-    const seriesKey = getEnrollmentSeriesKey(dataPoint);
-
-    if (!seriesByKey.has(seriesKey)) {
-      seriesByKey.set(seriesKey, {
-        dataKey: `series${seriesByKey.size}`,
-        name: getEnrollmentSeriesLabel(dataPoint),
-      });
-    }
-
-    if (!chartDataByDate.has(dataPoint.dateCreated)) {
-      chartDataByDate.set(dataPoint.dateCreated, {
-        dateCreated: dataPoint.dateCreated,
-      });
-    }
-
-    const chartRow = chartDataByDate.get(dataPoint.dateCreated);
-    chartRow[seriesByKey.get(seriesKey).dataKey] = dataPoint.enrollment;
-  });
+  sortedData.forEach((dataPoint) => {});
 
   return {
killedBy: CourseDetailsIndexPage tests passes returned enrollment history data to the graph
statusReason: Unable to find an element with the text: 06619 - Section 0100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <span
    aria-hidden="true"
    id="recharts_measurement_span"
    style="position: absolute; top: -20000px; left: 0px; pa

[Killed] ConditionalExpression
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:35:9
   sortedData.forEach((dataPoint) => {
     const seriesKey = getEnrollmentSeriesKey(dataPoint);
 
-    if (!seriesByKey.has(seriesKey)) {
+    if (false) {
       seriesByKey.set(seriesKey, {
         dataKey: `series${seriesByKey.size}`,
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:35:38
   sortedData.forEach((dataPoint) => {
     const seriesKey = getEnrollmentSeriesKey(dataPoint);
 
-    if (!seriesByKey.has(seriesKey)) {
-      seriesByKey.set(seriesKey, {
-        dataKey: `series${seriesByKey.size}`,
-        name: getEnrollmentSeriesLabel(dataPoint),
-      });
-    }
+    if (!seriesByKey.has(seriesKey)) {}
 
     if (!chartDataByDate.has(dataPoint.dateCreated)) {
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:36:34
     const seriesKey = getEnrollmentSeriesKey(dataPoint);
 
     if (!seriesByKey.has(seriesKey)) {
-      seriesByKey.set(seriesKey, {
-        dataKey: `series${seriesByKey.size}`,
-        name: getEnrollmentSeriesLabel(dataPoint),
-      });
+      seriesByKey.set(seriesKey, {});
     }
 
killedBy: CourseDetailsIndexPage tests passes returned enrollment history data to the graph
statusReason: Unable to find an element with the text: 06619 - Section 0100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <span
    aria-hidden="true"
    id="recharts_measurement_span"
    style="position: absolute; top: -20000px; left: 0px; pa

[Killed] StringLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:37:18
 
     if (!seriesByKey.has(seriesKey)) {
       seriesByKey.set(seriesKey, {
-        dataKey: `series${seriesByKey.size}`,
+        dataKey: ``,
         name: getEnrollmentSeriesLabel(dataPoint),
       });
killedBy: EnrollmentHistoryGraph tests creates chart data for multiple sections over time
statusReason: expected [ { dataKey: '', …(1) }, …(2) ] to deeply equal [ { dataKey: 'series0', …(1) }, …(2) ]

[Killed] ConditionalExpression
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:42:9
       });
     }
 
-    if (!chartDataByDate.has(dataPoint.dateCreated)) {
+    if (true) {
       chartDataByDate.set(dataPoint.dateCreated, {
         dateCreated: dataPoint.dateCreated,
killedBy: EnrollmentHistoryGraph tests creates chart data for multiple sections over time
statusReason: expected [ { …(2) }, { …(2) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] BooleanLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:42:9
       });
     }
 
-    if (!chartDataByDate.has(dataPoint.dateCreated)) {
+    if (chartDataByDate.has(dataPoint.dateCreated)) {
       chartDataByDate.set(dataPoint.dateCreated, {
         dateCreated: dataPoint.dateCreated,
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:43:50
     }
 
     if (!chartDataByDate.has(dataPoint.dateCreated)) {
-      chartDataByDate.set(dataPoint.dateCreated, {
-        dateCreated: dataPoint.dateCreated,
-      });
+      chartDataByDate.set(dataPoint.dateCreated, {});
     }
 
killedBy: EnrollmentHistoryGraph tests creates chart data for multiple sections over time
statusReason: expected [ …(2) ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ObjectLiteral
main/components/EnrollmentHistory/EnrollmentHistoryHelper.jsx:52:10
     chartRow[seriesByKey.get(seriesKey).dataKey] = dataPoint.enrollment;
   });
 
-  return {
-    chartData: Array.from(chartDataByDate.values()),
-    series: Array.from(seriesByKey.values()),
-  };
+  return {};
 };
 
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: Course Details for CHEM 184 W22. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
