[Killed] LogicalOperator
main/components/GEAreas/GEAreaSearchForm.jsx:15:20
   const { data: systemInfo } = useSystemInfo();
 
   // Stryker disable OptionalChaining
-  const startQtr = systemInfo?.startQtrYYYYQ || "20221";
+  const startQtr = systemInfo?.startQtrYYYYQ && "20221";
   const endQtr = systemInfo?.endQtrYYYYQ || "20222";
   // Stryker enable OptionalChaining
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: expected '' to be '20213' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:16:18
 
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20221";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20222";
+  const endQtr = false;
   // Stryker enable OptionalChaining
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: param should be a string

[Killed] StringLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:22:19
   const quarters = quarterRange(startQtr, endQtr);
 
   const quarterKey = "GEAreaSearch.Quarter";
-  const areaKey = "GEAreaSearch.Area";
+  const areaKey = "";
 
   const localQuarter = localStorage.getItem(quarterKey);
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Found a label with the text of: General Education Area, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrayDeclaration
main/components/GEAreas/GEAreaSearchForm.jsx:32:5
     _error,
     _status,
   } = useBackend(
-    ["/api/public/generalEducationInfo"],
+    [],
     { method: "GET", url: "/api/public/generalEducationInfo" },
     [
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

@@ -1,15 +1,13 @@
  [

[Killed] StringLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:32:6
     _error,
     _status,
   } = useBackend(
-    ["/api/public/generalEducationInfo"],
+    [""],
     { method: "GET", url: "/api/public/generalEducationInfo" },
     [
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

@@ -1,15 +1,15 @@
  [

[Killed] StringLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:36:26
     { method: "GET", url: "/api/public/generalEducationInfo" },
     [
       {
-        requirementCode: "A1",
+        requirementCode: "",
         requirementTranslation: "English Reading & Composition",
         collegeCode: "ENGR",
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

@@ -5,16 +5,16 @@
    {

[Killed] BooleanLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:42:19
         objCode: "BS",
         courseCount: 1,
         units: 4,
-        inactive: false,
+        inactive: true,
       },
     ],
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

@@ -5,14 +5,14 @@
    {

[Killed] LogicalOperator
main/components/GEAreas/GEAreaSearchForm.jsx:49:5
 
   const areaCodes = deduplicateAreaCodes(areas);
   const [quarter, setQuarter] = useState(
-    localQuarter || quarters[0]?.yyyyq || startQtr,
+    (localQuarter || quarters[0]?.yyyyq) && startQtr,
   );
   const [area, setArea] = useState(localArea || "");
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: expected '20211' to be '20213' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:51:36
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[0]?.yyyyq || startQtr,
   );
-  const [area, setArea] = useState(localArea || "");
+  const [area, setArea] = useState(false);
   const effectiveArea = area || areaCodes[0] || "";
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/GEAreas/GEAreaSearchForm.jsx:52:25
     localQuarter || quarters[0]?.yyyyq || startQtr,
   );
   const [area, setArea] = useState(localArea || "");
-  const effectiveArea = area || areaCodes[0] || "";
+  const effectiveArea = (area || areaCodes[0]) && "";
 
   const handleSubmit = (event) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaSearchForm.jsx:52:25
     localQuarter || quarters[0]?.yyyyq || startQtr,
   );
   const [area, setArea] = useState(localArea || "");
-  const effectiveArea = area || areaCodes[0] || "";
+  const effectiveArea = false;
 
   const handleSubmit = (event) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Unable to find an element with the text: Searching for B in M21. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/GEAreas/GEAreaSearchForm.jsx:54:35
   const [area, setArea] = useState(localArea || "");
   const effectiveArea = area || areaCodes[0] || "";
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    localStorage.setItem(quarterKey, quarter);
-    localStorage.setItem(areaKey, effectiveArea);
-    fetchJSON(event, { quarter, area: effectiveArea });
-  };
+  const handleSubmit = (event) => {};
 
   return (
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ArrowFunction
main/components/GEAreas/GEAreaSearchForm.jsx:77:27
               <Form.Control
                 as="select"
                 value={effectiveArea}
-                onChange={(e) => setArea(e.target.value)}
+                onChange={() => undefined}
               >
                 {areaCodes.map((code) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,
