[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.jsx:32:7
 
   const localSearchQuarter = localStorage.getItem(controlId);
 
-  if (!localSearchQuarter) {
+  if (true) {
     localStorage.setItem(controlId, quarters[lastInd].yyyyq);
   }
killedBy: CourseOverTimeDescriptionSearchForm tests CourseOverTimeDescriptionSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: expected '20222' to be '20201' // Object.is equality
