[Killed] LogicalOperator
main/pages/CSV/CSVDownloadsPage.jsx:44:5
 
   const [quarter, setQuarter] = useState(quarters[0].yyyyq);
   const [subjectArea, setSubjectArea] = useState(
-    subjects[0]?.subjectCode || "ANTH",
+    subjects[0]?.subjectCode && "ANTH",
   );
   const [level, setLevel] = useState("U");
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes default parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20221&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] ConditionalExpression
main/pages/CSV/CSVDownloadsPage.jsx:44:5
 
   const [quarter, setQuarter] = useState(quarters[0].yyyyq);
   const [subjectArea, setSubjectArea] = useState(
-    subjects[0]?.subjectCode || "ANTH",
+    true,
   );
   const [level, setLevel] = useState("U");
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes default parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20221&subjectArea=ANTH&level=U&omitSections=true&withTimeLocations=true",

[Killed] BooleanLiteral
main/pages/CSV/CSVDownloadsPage.jsx:47:52
     subjects[0]?.subjectCode || "ANTH",
   );
   const [level, setLevel] = useState("U");
-  const [omitSections, setOmitSections] = useState(true);
+  const [omitSections, setOmitSections] = useState(false);
   const [withTimeLocations, setWithTimeLocations] = useState(true);
 
killedBy: CSVDownloadsPage tests uses dropdowns for quarters, subject area, and course level
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  id="CSVDownloads.OmitSections"
  type="checkbox"
/>

[Killed] BooleanLiteral
main/pages/CSV/CSVDownloadsPage.jsx:48:62
   );
   const [level, setLevel] = useState("U");
   const [omitSections, setOmitSections] = useState(true);
-  const [withTimeLocations, setWithTimeLocations] = useState(true);
+  const [withTimeLocations, setWithTimeLocations] = useState(false);
 
   const byQuarterUrl = `/api/courses/csv/quarter?yyyyq=${encodeURIComponent(quarter)}`;
killedBy: CSVDownloadsPage tests uses dropdowns for quarters, subject area, and course level
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  id="CSVDownloads.WithTimeLocations"
  type="checkbox"
/>

[Killed] BlockStatement
main/pages/CSV/CSVDownloadsPage.jsx:58:32
     `&omitSections=${omitSections}` +
     `&withTimeLocations=${withTimeLocations}`;
 
-  const downloadCsv = (url) => {
-    browserLocation.assign(url);
-  };
+  const downloadCsv = (url) => {};
 
   const handleQuarterSubmit = (e) => {
killedBy: CSVDownloadsPage tests submitting by-quarter form downloads selected quarter
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
main/pages/CSV/CSVDownloadsPage.jsx:143:31
                     type="checkbox"
                     label="Omit sections"
                     checked={omitSections}
-                    onChange={(e) => setOmitSections(e.target.checked)}
+                    onChange={() => undefined}
                   />
                 </Form.Group>
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all endpoint parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=G&omitSections=false&withTimeLocations=false",

[Killed] ArrowFunction
main/pages/CSV/CSVDownloadsPage.jsx:155:31
                     type="checkbox"
                     label="Only include courses with times or locations"
                     checked={withTimeLocations}
-                    onChange={(e) => setWithTimeLocations(e.target.checked)}
+                    onChange={() => undefined}
                   />
                 </Form.Group>
killedBy: CSVDownloadsPage tests submitting by-quarter-and-subject form includes all endpoint parameters
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "/api/courses/csv/byQuarterAndSubjectArea?yyyyq=20242&subjectArea=CMPSC&level=G&omitSections=false&withTimeLocations=false",
