[Killed] ArrayDeclaration
main/pages/CourseDetails/CourseDetailsIndexPage.jsx:12:38
 import FinalExamCard from "main/components/Finals/FinalExamCard";
 import EnrollmentHistoryGraph from "main/components/EnrollmentHistory/EnrollmentHistoryGraph";
 
-const selectedEnrollmentLineColors = ["#0d6efd"];
+const selectedEnrollmentLineColors = [];
 
 export default function CourseDetailsIndexPage() {
killedBy: CourseDetailsIndexPage tests renders the selected enrollment history line in blue
statusReason: expect(element).toHaveAttribute("stroke", "#0d6efd") // element.getAttribute("stroke") === "#0d6efd"

Expected the element to have attribute:
  stroke="#0d6efd"
Received:
  stroke="#3182bd"
