[Killed] ObjectLiteral
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:15:43
   // Stryker disable next-line all : Can't test state because hook is internal
   const [hasSearched, setHasSearched] = useState(false);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/buildingsearch",
-    params: {
-      startQtr: query.Quarter,
-      endQtr: query.Quarter,
-      buildingCode: query.buildingCode,
-    },
-  });
+  const objectToAxiosParams = (query) => ({});
 
   const onSuccess = (buildings) => {
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: expected undefined to deeply equal { startQtr: '20222', …(2) }

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:24:36
     },
   });
 
-  const onSuccess = (buildings) => {
-    setCourseJSON(buildings);
-    setHasSearched(true);
-  };
+  const onSuccess = (buildings) => {};
 
   const mutation = useBackendMutation(
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:26:20
 
   const onSuccess = (buildings) => {
     setCourseJSON(buildings);
-    setHasSearched(true);
+    setHasSearched(false);
   };
 
killedBy: CourseOverTimeBuildingsIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:36:57
     [],
   );
 
-  async function fetchCourseOverTimeJSON(_event, query) {
-    // Stryker disable all
-    /* istanbul ignore next */
-    setSelectedClassroom(query.classroom || "ALL");
-    // Stryker restore all
-    mutation.mutate(query);
-  }
+  async function fetchCourseOverTimeJSON(_event, query) {}
 
   const filteredSections =
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: expected 0 to be greater than or equal to 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:45:5
   }
 
   const filteredSections =
-    !selectedClassroom || selectedClassroom === "ALL"
+    false
       ? courseJSON
       : courseJSON.filter(
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:45:5
   }
 
   const filteredSections =
-    !selectedClassroom || selectedClassroom === "ALL"
+    !selectedClassroom && selectedClassroom === "ALL"
       ? courseJSON
       : courseJSON.filter(
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:47:9
   const filteredSections =
     !selectedClassroom || selectedClassroom === "ALL"
       ? courseJSON
-      : courseJSON.filter(
-          (cs) =>
-            cs.section &&
-            cs.section.timeLocations &&
-            cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
-            ),
-        );
+      : courseJSON;
 
   return (
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:48:11
     !selectedClassroom || selectedClassroom === "ALL"
       ? courseJSON
       : courseJSON.filter(
-          (cs) =>
-            cs.section &&
-            cs.section.timeLocations &&
-            cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
-            ),
+          () => undefined,
         );
 
killedBy: CourseOverTimeBuildingsIndexPage tests filters sections by classroom when classroom is selected
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:49:13
       ? courseJSON
       : courseJSON.filter(
           (cs) =>
-            cs.section &&
-            cs.section.timeLocations &&
-            cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
-            ),
+            cs.section && cs.section.timeLocations || cs.section.timeLocations.some(loc => loc.room === selectedClassroom),
         );
 
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:49:13
       ? courseJSON
       : courseJSON.filter(
           (cs) =>
-            cs.section &&
-            cs.section.timeLocations &&
+            cs.section || cs.section.timeLocations &&
             cs.section.timeLocations.some(
               (loc) => loc.room === selectedClassroom,
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] MethodExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:51:13
           (cs) =>
             cs.section &&
             cs.section.timeLocations &&
-            cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
-            ),
+            cs.section.timeLocations.every(loc => loc.room === selectedClassroom),
         );
 
killedBy: CourseOverTimeBuildingsIndexPage tests filters sections with multiple timeLocations correctly
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:52:15
             cs.section &&
             cs.section.timeLocations &&
             cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
+              () => undefined,
             ),
         );
killedBy: CourseOverTimeBuildingsIndexPage tests filters sections by classroom when classroom is selected
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:52:24
             cs.section &&
             cs.section.timeLocations &&
             cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
+              (loc) => true,
             ),
         );
killedBy: CourseOverTimeBuildingsIndexPage tests filters out sections not in selected classroom
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="ConvertedSectionTable-cell-row-0-col-courseId"
>
  CHEM    184  -1
</td> instead

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:63:10
         <CourseOverTimeBuildingsSearchForm
           fetchJSON={fetchCourseOverTimeJSON}
         />
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {true}
         {!mutation.isLoading &&
           hasSearched &&
killedBy: CourseOverTimeBuildingsIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:63:10
         <CourseOverTimeBuildingsSearchForm
           fetchJSON={fetchCourseOverTimeJSON}
         />
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {mutation.isLoading || <div className="text-center">Loading courses...</div>}
         {!mutation.isLoading &&
           hasSearched &&
killedBy: CourseOverTimeBuildingsIndexPage tests does not display 'No courses found' message before search is performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center"
>
  Loading courses...
</div> instead

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:66:10
         {mutation.isLoading && (
           <div className="text-center">Loading courses...</div>
         )}
-        {!mutation.isLoading &&
-          hasSearched &&
-          filteredSections.length === 0 && (
+        {!mutation.isLoading && hasSearched || filteredSections.length === 0 && (
             <div className="text-center mt-3">
               <p>No courses were found with the specified criteria.</p>
killedBy: CourseOverTimeBuildingsIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:66:10
         {mutation.isLoading && (
           <div className="text-center">Loading courses...</div>
         )}
-        {!mutation.isLoading &&
-          hasSearched &&
+        {!mutation.isLoading || hasSearched &&
           filteredSections.length === 0 && (
             <div className="text-center mt-3">
killedBy: CourseOverTimeBuildingsIndexPage tests does not display 'No courses found' message before search is performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No courses were found with the specified criteria.
</p> instead

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:68:11
         )}
         {!mutation.isLoading &&
           hasSearched &&
-          filteredSections.length === 0 && (
+          true && (
             <div className="text-center mt-3">
               <p>No courses were found with the specified criteria.</p>
killedBy: CourseOverTimeBuildingsIndexPage tests displays course table when search returns results
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No courses were found with the specified criteria.
</p> instead

[Killed] EqualityOperator
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:68:11
         )}
         {!mutation.isLoading &&
           hasSearched &&
-          filteredSections.length === 0 && (
+          filteredSections.length !== 0 && (
             <div className="text-center mt-3">
               <p>No courses were found with the specified criteria.</p>
killedBy: CourseOverTimeBuildingsIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:73:10
               <p>No courses were found with the specified criteria.</p>
             </div>
           )}
-        {!mutation.isLoading && filteredSections.length > 0 && (
-          <ConvertedSectionTable sections={filteredSections} />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:73:10
               <p>No courses were found with the specified criteria.</p>
             </div>
           )}
-        {!mutation.isLoading && filteredSections.length > 0 && (
+        {true && (
           <ConvertedSectionTable sections={filteredSections} />
         )}
killedBy: CourseOverTimeBuildingsIndexPage tests displays loading message while search is in progress
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ConvertedSectionTable-header-courseId-sort-header"
  style="cursor: pointer;"
>
  CourseId
  <span
