[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:13:31
   // Stryker disable next-line all : Can't test state because hook is internal
   const [hasSearched, setHasSearched] = useState(false);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/search",
-    params: {
-      startQtr: query.startQuarter,
-      endQtr: query.endQuarter,
-      subjectArea: query.subject,
-      courseNumber: query.courseNumber + query.courseSuf,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected undefined to deeply equal { startQtr: '20222', …(3) }

[Killed] ObjectLiteral
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:13:43
   // Stryker disable next-line all : Can't test state because hook is internal
   const [hasSearched, setHasSearched] = useState(false);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/search",
-    params: {
-      startQtr: query.startQuarter,
-      endQtr: query.endQuarter,
-      subjectArea: query.subject,
-      courseNumber: query.courseNumber + query.courseSuf,
-    },
-  });
+  const objectToAxiosParams = (query) => ({});
 
   const onSuccess = (courses) => {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected undefined to deeply equal { startQtr: '20222', …(3) }

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:23:34
     },
   });
 
-  const onSuccess = (courses) => {
-    setCourseJSON(courses);
-    setHasSearched(true);
-  };
+  const onSuccess = (courses) => {};
 
   const mutation = useBackendMutation(
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:25:20
 
   const onSuccess = (courses) => {
     setCourseJSON(courses);
-    setHasSearched(true);
+    setHasSearched(false);
   };
 
killedBy: CourseOverTimeIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:44:10
       <div className="pt-2">
         <h5>UCSB Course History Search</h5>
         <CourseOverTimeSearchForm fetchJSON={fetchCourseOverTimeJSON} />
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {mutation.isLoading || <div className="text-center">Loading courses...</div>}
         {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
           <div className="text-center mt-3">
killedBy: CourseOverTimeIndexPage tests does not display 'No courses found' message before search is performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center"
>
  Loading courses...
</div> instead

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:44:10
       <div className="pt-2">
         <h5>UCSB Course History Search</h5>
         <CourseOverTimeSearchForm fetchJSON={fetchCourseOverTimeJSON} />
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {true}
         {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
           <div className="text-center mt-3">
killedBy: CourseOverTimeIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:47:48
         {mutation.isLoading && (
           <div className="text-center">Loading courses...</div>
         )}
-        {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
+        {!mutation.isLoading && hasSearched && true && (
           <div className="text-center mt-3">
             <p>No courses were found with the specified criteria.</p>
killedBy: CourseOverTimeIndexPage tests displays course table when search returns results
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No courses were found with the specified criteria.
</p> instead

[Killed] EqualityOperator
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:47:48
         {mutation.isLoading && (
           <div className="text-center">Loading courses...</div>
         )}
-        {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
+        {!mutation.isLoading && hasSearched && courseJSON.length !== 0 && (
           <div className="text-center mt-3">
             <p>No courses were found with the specified criteria.</p>
killedBy: CourseOverTimeIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:52:10
             <p>No courses were found with the specified criteria.</p>
           </div>
         )}
-        {!mutation.isLoading && courseJSON.length > 0 && (
-          <ConvertedSectionTable sections={courseJSON} showSession />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:52:10
             <p>No courses were found with the specified criteria.</p>
           </div>
         )}
-        {!mutation.isLoading && courseJSON.length > 0 && (
+        {true && (
           <ConvertedSectionTable sections={courseJSON} showSession />
         )}
killedBy: CourseOverTimeIndexPage tests displays loading message while search is in progress
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ConvertedSectionTable-header-courseId-sort-header"
  style="cursor: pointer;"
>
  CourseId
  <span
