[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.jsx:13:31
   // Stryker disable next-line all : Can't test state because hook is internal
   const [hasSearched, setHasSearched] = useState(false);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/instructorsearch",
-    params: {
-      startQtr: query.startQuarter,
-      endQtr: query.endQuarter,
-      instructor: query.instructor,
-      lectureOnly: query.checkbox,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected undefined to deeply equal { startQtr: '20222', …(3) }

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.jsx:46:10
         <CourseOverTimeInstructorSearchForm
           fetchJSON={fetchCourseOverTimeJSON}
         />
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {false}
         {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
           <div className="text-center mt-3">
killedBy: CourseOverTimeInstructorIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.jsx:49:10
         {mutation.isLoading && (
           <div className="text-center">Loading courses...</div>
         )}
-        {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
-          <div className="text-center mt-3">
-            <p>No courses were found with the specified criteria.</p>
-          </div>
-        )}
+        {true}
         {!mutation.isLoading && courseJSON.length > 0 && (
           <ConvertedSectionTable sections={courseJSON} />
killedBy: CourseOverTimeInstructorIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.jsx:49:10
         {mutation.isLoading && (
           <div className="text-center">Loading courses...</div>
         )}
-        {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
+        {true && (
           <div className="text-center mt-3">
             <p>No courses were found with the specified criteria.</p>
killedBy: CourseOverTimeInstructorIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.jsx:54:10
             <p>No courses were found with the specified criteria.</p>
           </div>
         )}
-        {!mutation.isLoading && courseJSON.length > 0 && (
+        {!mutation.isLoading || courseJSON.length > 0 && (
           <ConvertedSectionTable sections={courseJSON} />
         )}
killedBy: CourseOverTimeInstructorIndexPage tests does not display ConvertedSectionTable when search returns empty results
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ConvertedSectionTable-header-courseId-sort-header"
  style="cursor: pointer;"
>
  CourseId
  <span

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeInstructorIndexPage.jsx:54:10
             <p>No courses were found with the specified criteria.</p>
           </div>
         )}
-        {!mutation.isLoading && courseJSON.length > 0 && (
-          <ConvertedSectionTable sections={courseJSON} />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: COMP ENGR SEMINAR. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
