[Killed] EqualityOperator
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:59:48
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && sectionJSON.length === 0 && (
+        {!mutation.isLoading && hasSearched && sectionJSON.length !== 0 && (
           <div className="text-center mt-3">
             <p>No courses were found with the specified criteria.</p>
killedBy: SectionSearchesIndexPageLoggedIn tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:59:10
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && sectionJSON.length === 0 && (
+        {mutation.isLoading && hasSearched && sectionJSON.length === 0 && (
           <div className="text-center mt-3">
             <p>No courses were found with the specified criteria.</p>
killedBy: SectionSearchesIndexPageLoggedIn tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:66:33
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && sectionJSON.length > 0 && (
+        {!mutation.isLoading && sectionJSON.length <= 0 && (
           <SectionsTable sections={sectionJSON} schedules={schedules} />
         )}
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/SectionSearches/SectionSearchesIndexPageLoggedIn.jsx:66:10
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && sectionJSON.length > 0 && (
-          <SectionsTable sections={sectionJSON} schedules={schedules} />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
