[Killed] ConditionalExpression
main/pages/SectionSearches/SectionSearchesIndexPageNotLoggedIn.jsx:56:10
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && sectionJSON.length > 0 && (
-          <SectionsTable sections={sectionJSON} schedules={[]} />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: SectionSearchesIndexPageNotLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/SectionSearches/SectionSearchesIndexPageNotLoggedIn.jsx:56:10
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && sectionJSON.length > 0 && (
-          <SectionsTable sections={sectionJSON} schedules={[]} />
-        )}
+        {!mutation.isLoading && sectionJSON.length > 0 || <SectionsTable sections={sectionJSON} schedules={[]} />}
       </div>
     </BasicLayout>
killedBy: SectionSearchesIndexPageNotLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
