[Killed] BooleanLiteral
main/components/Common/ConvertedSectionTable.jsx:16:17
 function ConvertedSectionTable({
   sections,
   testid = "ConvertedSectionTable",
-  showSession = false,
+  showSession = true,
 }) {
   const columns = [
killedBy: ConvertedSectionTable tests renders with expected headers
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="ConvertedSectionTable-header-session-sort-header"
  style="cursor: pointer;"
>
  Session
  <span

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:22:13
     {
       header: "Quarter",
       accessorKey: "quarter",
-      cell: ({ row }) => yyyyqToQyy(row.original.courseInfo.quarter),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  W22
Received:

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:24:5
       accessorKey: "quarter",
       cell: ({ row }) => yyyyqToQyy(row.original.courseInfo.quarter),
     },
-    {
-      header: "CourseId",
-      accessorKey: "courseId",
-      cell: ({ row }) => row.original.courseInfo.courseId,
-    },
+    {},
     {
       header: "Title",
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:27:13
     {
       header: "CourseId",
       accessorKey: "courseId",
-      cell: ({ row }) => row.original.courseInfo.courseId,
+      cell: () => undefined,
     },
     {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:32:13
     {
       header: "Title",
       accessorKey: "title",
-      cell: ({ row }) => row.original.courseInfo.title,
+      cell: () => undefined,
     },
     {
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: COMP ENGR SEMINAR. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:34:5
       accessorKey: "title",
       cell: ({ row }) => row.original.courseInfo.title,
     },
-    {
-      header: "EnrollCd",
-      accessorKey: "enrollCode",
-      cell: ({ row }) => row.original.section.enrollCode,
-    },
+    {},
     {
       header: "Status",
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:35:15
       cell: ({ row }) => row.original.courseInfo.title,
     },
     {
-      header: "EnrollCd",
+      header: "",
       accessorKey: "enrollCode",
       cell: ({ row }) => row.original.section.enrollCode,
killedBy: ConvertedSectionTable tests renders with expected headers
statusReason: Unable to find an element with the text: EnrollCd. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ConvertedSectionTable"

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:37:13
     {
       header: "EnrollCd",
       accessorKey: "enrollCode",
-      cell: ({ row }) => row.original.section.enrollCode,
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  12583
Received:

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:42:13
     {
       header: "Status",
       accessorKey: "status",
-      cell: ({ row }) => formatStatus(row.original.section),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:47:13
     {
       header: "Enrolled",
       accessorKey: "enrolled",
-      cell: ({ row }) =>
-        convertToFraction(
-          row.original.section.enrolledTotal,
-          row.original.section.maxEnroll,
-        ),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  84/100
Received:

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:53:5
           row.original.section.maxEnroll,
         ),
     },
-    {
-      header: "Days",
-      accessorKey: "days",
-      cell: ({ row }) => formatDays(row.original.section.timeLocations),
-    },
+    {},
     {
       header: "Time",
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: COMP ENGR SEMINAR. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:56:13
     {
       header: "Days",
       accessorKey: "days",
-      cell: ({ row }) => formatDays(row.original.section.timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  M
Received:

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:60:20
     },
     {
       header: "Time",
-      accessorKey: "time",
+      accessorKey: "",
       cell: ({ row }) => formatTime(row.original.section.timeLocations),
     },
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: COMP ENGR SEMINAR. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:61:13
     {
       header: "Time",
       accessorKey: "time",
-      cell: ({ row }) => formatTime(row.original.section.timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3:00 PM - 3:50 PM
Received:

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:66:13
     {
       header: "Location",
       accessorKey: "location",
-      cell: ({ row }) => formatLocation(row.original.section.timeLocations),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  BUCHN 1930
Received:

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:68:5
       accessorKey: "location",
       cell: ({ row }) => formatLocation(row.original.section.timeLocations),
     },
-    {
-      header: "Instructors",
-      accessorKey: "instructors",
-      cell: ({ row }) => formatInstructors(row.original.section.instructors),
-    },
+    {},
     {
       header: "Section",
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:71:13
     {
       header: "Instructors",
       accessorKey: "instructors",
-      cell: ({ row }) => formatInstructors(row.original.section.instructors),
+      cell: () => undefined,
     },
     {
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  WANG L C
Received:

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:76:13
     {
       header: "Section",
       accessorKey: "section",
-      cell: ({ row }) => row.original.section.section,
+      cell: () => undefined,
     },
   ];
killedBy: ConvertedSectionTable tests renders with expected fields
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  0100
Received:

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:80:20
     },
   ];
 
-  if (showSession) {
-    columns.push({
-      header: "Session",
-      accessorKey: "session",
-      cell: ({ row }) =>
-        formatSession(
-          row.original.courseInfo?.quarter,
-          row.original.section?.session,
-        ),
-    });
-  }
+  if (showSession) {}
 
   return <OurTable data={sections} columns={columns} testid={testid} />;
killedBy: CourseOverTimeIndexPage tests displays course table when search returns results
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-header-session"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:80:7
     },
   ];
 
-  if (showSession) {
+  if (false) {
     columns.push({
       header: "Session",
killedBy: CourseOverTimeIndexPage tests displays course table when search returns results
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-header-session"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:81:18
   ];
 
   if (showSession) {
-    columns.push({
-      header: "Session",
-      accessorKey: "session",
-      cell: ({ row }) =>
-        formatSession(
-          row.original.courseInfo?.quarter,
-          row.original.section?.session,
-        ),
-    });
+    columns.push({});
   }
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:84:13
     columns.push({
       header: "Session",
       accessorKey: "session",
-      cell: ({ row }) =>
-        formatSession(
-          row.original.courseInfo?.quarter,
-          row.original.section?.session,
-        ),
+      cell: () => undefined,
     });
   }
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] OptionalChaining
main/components/Common/ConvertedSectionTable.jsx:86:11
       accessorKey: "session",
       cell: ({ row }) =>
         formatSession(
-          row.original.courseInfo?.quarter,
+          row.original.courseInfo.quarter,
           row.original.section?.session,
         ),
killedBy: ConvertedSectionTable tests renders blank session when courseInfo is missing or null
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] OptionalChaining
main/components/Common/ConvertedSectionTable.jsx:87:11
       cell: ({ row }) =>
         formatSession(
           row.original.courseInfo?.quarter,
-          row.original.section?.session,
+          row.original.section.session,
         ),
     });
killedBy: ConvertedSectionTable tests renders blank session when section is missing or null
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown
