[Killed] BlockStatement
main/components/GEAreas/GEAreaCoursesTable.jsx:5:46
 import OurTable from "main/components/OurTable";
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 
-const getGeneralEducationAreas = (course) => {
-  const areas = course.generalEducation;
-  if (!areas || !Array.isArray(areas)) {
-    return "";
-  }
-
-  return areas
-    .map((area) => {
-      if (!area) {
-        return "";
-      }
-      if (typeof area === "string") {
-        return area.trim();
-      }
-      return area.geCode ? area.geCode.trim() : area.toString();
-    })
-    .filter(Boolean)
-    .join(", ");
-};
+const getGeneralEducationAreas = (course) => {};
 
 export default function GEAreaCoursesTable({ courses }) {
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A1
Received:

[Killed] BooleanLiteral
main/components/GEAreas/GEAreaCoursesTable.jsx:7:17
 
 const getGeneralEducationAreas = (course) => {
   const areas = course.generalEducation;
-  if (!areas || !Array.isArray(areas)) {
+  if (!areas || Array.isArray(areas)) {
     return "";
   }
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A1
Received:

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaCoursesTable.jsx:7:7
 
 const getGeneralEducationAreas = (course) => {
   const areas = course.generalEducation;
-  if (!areas || !Array.isArray(areas)) {
+  if (false) {
     return "";
   }
killedBy: GEAreaCoursesTable tests renders array-like non-array generalEducation objects as blank
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^$/
Received:
  SHOULD NOT SHOW

[Killed] StringLiteral
main/components/GEAreas/GEAreaCoursesTable.jsx:8:12
 const getGeneralEducationAreas = (course) => {
   const areas = course.generalEducation;
   if (!areas || !Array.isArray(areas)) {
-    return "";
+    return "Stryker was here!";
   }
 
killedBy: GEAreaCoursesTable tests renders array-like non-array generalEducation objects as blank
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^$/
Received:
  Stryker was here!

[Killed] MethodExpression
main/components/GEAreas/GEAreaCoursesTable.jsx:11:10
     return "";
   }
 
-  return areas
-    .map((area) => {
-      if (!area) {
-        return "";
-      }
-      if (typeof area === "string") {
-        return area.trim();
-      }
-      return area.geCode ? area.geCode.trim() : area.toString();
-    })
-    .filter(Boolean)
+  return areas.map(area => {
+  if (!area) {
+    return "";
+  }
+  if (typeof area === "string") {
+    return area.trim();
+  }
+  return area.geCode ? area.geCode.trim() : area.toString();
+})
     .join(", ");
 };
killedBy: GEAreaCoursesTable tests renders the expected table headers and course cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^C1$/
Received:
  C1,

[Killed] BlockStatement
main/components/GEAreas/GEAreaCoursesTable.jsx:12:20
   }
 
   return areas
-    .map((area) => {
-      if (!area) {
-        return "";
-      }
-      if (typeof area === "string") {
-        return area.trim();
-      }
-      return area.geCode ? area.geCode.trim() : area.toString();
-    })
+    .map((area) => {})
     .filter(Boolean)
     .join(", ");
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A1
Received:

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaCoursesTable.jsx:13:11
 
   return areas
     .map((area) => {
-      if (!area) {
+      if (false) {
         return "";
       }
killedBy: GEAreaCoursesTable tests renders the expected table headers and course cells
statusReason: Cannot read properties of null (reading 'geCode')

[Killed] BooleanLiteral
main/components/GEAreas/GEAreaCoursesTable.jsx:13:11
 
   return areas
     .map((area) => {
-      if (!area) {
+      if (area) {
         return "";
       }
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A1
Received:

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaCoursesTable.jsx:16:11
       if (!area) {
         return "";
       }
-      if (typeof area === "string") {
+      if (false) {
         return area.trim();
       }
killedBy: GEAreaCoursesTable tests renders empty and trimmed GE area values correctly
statusReason: expected ' A1 , C1' to be 'A1, C1' // Object.is equality

[Killed] ConditionalExpression
main/components/GEAreas/GEAreaCoursesTable.jsx:16:11
       if (!area) {
         return "";
       }
-      if (typeof area === "string") {
+      if (true) {
         return area.trim();
       }
killedBy: GEAreaCoursesTable tests renders the expected table headers and course cells
statusReason: area.trim is not a function

[Killed] MethodExpression
main/components/GEAreas/GEAreaCoursesTable.jsx:17:16
         return "";
       }
       if (typeof area === "string") {
-        return area.trim();
+        return area;
       }
       return area.geCode ? area.geCode.trim() : area.toString();
killedBy: GEAreaCoursesTable tests renders empty and trimmed GE area values correctly
statusReason: expected ' A1 , C1' to be 'A1, C1' // Object.is equality

[Killed] MethodExpression
main/components/GEAreas/GEAreaCoursesTable.jsx:19:28
       if (typeof area === "string") {
         return area.trim();
       }
-      return area.geCode ? area.geCode.trim() : area.toString();
+      return area.geCode ? area.geCode : area.toString();
     })
     .filter(Boolean)
killedBy: GEAreaCoursesTable tests renders empty and trimmed GE area values correctly
statusReason: expected 'A1,  C1 ' to be 'A1, C1' // Object.is equality

[Killed] ObjectLiteral
main/components/GEAreas/GEAreaCoursesTable.jsx:27:5
 
 export default function GEAreaCoursesTable({ courses }) {
   const columns = [
-    {
-      Header: "Quarter",
-      cell: ({ cell }) => yyyyqToQyy(cell.row.original.quarter),
-      id: "quarter",
-    },
+    {},
     {
       Header: "Course Id",
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/GEAreas/GEAreaCoursesTable.jsx:29:13
   const columns = [
     {
       Header: "Quarter",
-      cell: ({ cell }) => yyyyqToQyy(cell.row.original.quarter),
+      cell: () => undefined,
       id: "quarter",
     },
killedBy: GEAreaCoursesTable tests renders the expected table headers and course cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  S23
Received:

[Killed] ObjectLiteral
main/components/GEAreas/GEAreaCoursesTable.jsx:32:5
       cell: ({ cell }) => yyyyqToQyy(cell.row.original.quarter),
       id: "quarter",
     },
-    {
-      Header: "Course Id",
-      accessor: "courseId",
-    },
+    {},
     {
       Header: "Title",
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/GEAreas/GEAreaCoursesTable.jsx:34:17
     },
     {
       Header: "Course Id",
-      accessor: "courseId",
+      accessor: "",
     },
     {
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: Unable to find an element by: [data-testid="GEAreaCoursesTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/GEAreas/GEAreaCoursesTable.jsx:42:17
     },
     {
       Header: "Description",
-      accessor: "description",
+      accessor: "",
     },
     {
killedBy: GEAreaCoursesTable tests renders the expected table headers and course cells
statusReason: Unable to find an element by: [data-testid="GEAreaCoursesTable-header-description"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="GEAreaCoursesTable"

[Killed] StringLiteral
main/components/GEAreas/GEAreaCoursesTable.jsx:45:15
       accessor: "description",
     },
     {
-      Header: "General Education Areas",
+      Header: "",
       cell: ({ row }) => getGeneralEducationAreas(row.original),
       id: "generalEducationAreas",
killedBy: GEAreaCoursesTable tests renders the expected table headers and course cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  General Education Areas
Received:

[Killed] ArrowFunction
main/components/GEAreas/GEAreaCoursesTable.jsx:46:13
     },
     {
       Header: "General Education Areas",
-      cell: ({ row }) => getGeneralEducationAreas(row.original),
+      cell: () => undefined,
       id: "generalEducationAreas",
     },
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A1
Received:
