[Killed] BlockStatement
main/components/GEAreas/geAreaSearchFormUtils.js:1:48
-export const deduplicateAreaCodes = (areas) => {
-  if (!areas) {
-    return [];
-  }
-
-  const normalizedAreaCodes = areas
-    .map((r) => r?.requirementCode)
-    .filter((code) => typeof code === "string" && code.trim() !== "")
-    .map((code) => code.trim());
-
-  return Array.from(new Set(normalizedAreaCodes));
-};
+export const deduplicateAreaCodes = (areas) => {};
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend renders correctly with local storage values
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
main/components/GEAreas/geAreaSearchFormUtils.js:2:15
 export const deduplicateAreaCodes = (areas) => {
-  if (!areas) {
-    return [];
-  }
+  if (!areas) {}
 
   const normalizedAreaCodes = areas
killedBy: geAreaSearchFormUtils tests deduplicateAreaCodes returns empty array for nullish input
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
main/components/GEAreas/geAreaSearchFormUtils.js:2:7
 export const deduplicateAreaCodes = (areas) => {
-  if (!areas) {
+  if (false) {
     return [];
   }
killedBy: geAreaSearchFormUtils tests deduplicateAreaCodes returns empty array for nullish input
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
main/components/GEAreas/geAreaSearchFormUtils.js:6:31
     return [];
   }
 
-  const normalizedAreaCodes = areas
-    .map((r) => r?.requirementCode)
-    .filter((code) => typeof code === "string" && code.trim() !== "")
+  const normalizedAreaCodes = areas.map(r => r?.requirementCode)
     .map((code) => code.trim());
 
killedBy: geAreaSearchFormUtils tests deduplicateAreaCodes trims, filters, and de-duplicates codes
statusReason: Cannot read properties of null (reading 'trim')

[Killed] ArrowFunction
main/components/GEAreas/geAreaSearchFormUtils.js:7:10
   }
 
   const normalizedAreaCodes = areas
-    .map((r) => r?.requirementCode)
+    .map(() => undefined)
     .filter((code) => typeof code === "string" && code.trim() !== "")
     .map((code) => code.trim());
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expected '' to be 'A1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] OptionalChaining
main/components/GEAreas/geAreaSearchFormUtils.js:7:17
   }
 
   const normalizedAreaCodes = areas
-    .map((r) => r?.requirementCode)
+    .map((r) => r.requirementCode)
     .filter((code) => typeof code === "string" && code.trim() !== "")
     .map((code) => code.trim());
killedBy: geAreaSearchFormUtils tests deduplicateAreaCodes trims, filters, and de-duplicates codes
statusReason: Cannot read properties of undefined (reading 'requirementCode')

[Killed] LogicalOperator
main/components/GEAreas/geAreaSearchFormUtils.js:8:23
 
   const normalizedAreaCodes = areas
     .map((r) => r?.requirementCode)
-    .filter((code) => typeof code === "string" && code.trim() !== "")
+    .filter((code) => typeof code === "string" || code.trim() !== "")
     .map((code) => code.trim());
 
killedBy: geAreaSearchFormUtils tests deduplicateAreaCodes trims, filters, and de-duplicates codes
statusReason: Cannot read properties of null (reading 'trim')

[Killed] ConditionalExpression
main/components/GEAreas/geAreaSearchFormUtils.js:8:23
 
   const normalizedAreaCodes = areas
     .map((r) => r?.requirementCode)
-    .filter((code) => typeof code === "string" && code.trim() !== "")
+    .filter((code) => false)
     .map((code) => code.trim());
 
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expected '' to be 'A1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] MethodExpression
main/components/GEAreas/geAreaSearchFormUtils.js:9:20
   const normalizedAreaCodes = areas
     .map((r) => r?.requirementCode)
     .filter((code) => typeof code === "string" && code.trim() !== "")
-    .map((code) => code.trim());
+    .map((code) => code);
 
   return Array.from(new Set(normalizedAreaCodes));
killedBy: geAreaSearchFormUtils tests deduplicateAreaCodes trims, filters, and de-duplicates codes
statusReason: expected [ ' A1 ', 'A1', 'B' ] to deeply equal [ 'A1', 'B' ]

[Killed] ArrowFunction
main/components/GEAreas/geAreaSearchFormUtils.js:9:10
   const normalizedAreaCodes = areas
     .map((r) => r?.requirementCode)
     .filter((code) => typeof code === "string" && code.trim() !== "")
-    .map((code) => code.trim());
+    .map(() => undefined);
 
   return Array.from(new Set(normalizedAreaCodes));
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, we get first area code
statusReason: expected '' to be 'A1' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form
