[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:53:15
           <Form>
             {
               /* istanbul ignore next */
-              filteringSchedules.length > 0 ? (
+              true ? (
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: SectionsTable tests AddToScheduleModal interactions when there are no schedules When there are no schedules, the message about there being no schedules shows up
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.2-col-action-no-schedules"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] EqualityOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:53:15
           <Form>
             {
               /* istanbul ignore next */
-              filteringSchedules.length > 0 ? (
+              filteringSchedules.length >= 0 ? (
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: SectionsTable tests AddToScheduleModal interactions when there are no schedules When there are no schedules, the message about there being no schedules shows up
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.2-col-action-no-schedules"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
