[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeDescriptionIndexPage.jsx:10:31
 export default function CourseOverTimeDescriptionIndexPage() {
   const [courseJSON, setCourseJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/description/search",
-    params: {
-      startQtr: query.startQuarter,
-      endQtr: query.endQuarter,
-      searchTerms: query.searchTerms,
-      lectureOnly: query.lectureOnly,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {
killedBy: CourseOverTimeDescriptionIndexPage tests calls UCSB Course description search api correctly with 3 section response
statusReason: expected undefined to deeply equal { startQtr: '20222', …(3) }

[Killed] ObjectLiteral
main/pages/CourseOverTime/CourseOverTimeDescriptionIndexPage.jsx:24:60
     setCourseJSON(courses);
   };
 
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
+  const mutation = useBackendMutation(objectToAxiosParams, {}, []);
 
   async function fetchCourseOverTimeJSON(_event, query) {
killedBy: CourseOverTimeDescriptionIndexPage tests calls UCSB Course description search api correctly with 3 section response
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received:

  1st useBackendMutation call:

  [
-   Any<Function>,
