[Killed] BooleanLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:9:50
 
 export default function GeneralEducationSearchPage() {
   const [courses, setCourses] = useState([]);
-  const [hasSearched, setHasSearched] = useState(false);
+  const [hasSearched, setHasSearched] = useState(true);
 
   const objectToAxiosParams = (query) => ({
killedBy: GeneralEducationSearchPage tests does not show results or no-results before the first search
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No GE courses were found with the specified criteria.
</p> instead

[Killed] ArrowFunction
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:11:31
   const [courses, setCourses] = useState([]);
   const [hasSearched, setHasSearched] = useState(false);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/primariesge",
-    params: {
-      qtr: query.quarter,
-      area: query.area === "ALL" ? "" : query.area,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courseResults) => {
killedBy: GeneralEducationSearchPage tests objectToAxiosParams converts ALL area to empty string and keeps other values
statusReason: expected undefined to deeply equal { Object (url, params) }

[Killed] ObjectLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:13:13
 
   const objectToAxiosParams = (query) => ({
     url: "/api/public/primariesge",
-    params: {
-      qtr: query.quarter,
-      area: query.area === "ALL" ? "" : query.area,
-    },
+    params: {},
   });
 
killedBy: GeneralEducationSearchPage tests objectToAxiosParams converts ALL area to empty string and keeps other values
statusReason: expected { Object (url, params) } to deeply equal { Object (url, params) }

[Killed] ConditionalExpression
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:15:13
     url: "/api/public/primariesge",
     params: {
       qtr: query.quarter,
-      area: query.area === "ALL" ? "" : query.area,
+      area: true ? "" : query.area,
     },
   });
killedBy: GeneralEducationSearchPage tests objectToAxiosParams converts ALL area to empty string and keeps other values
statusReason: expected { Object (url, params) } to deeply equal { Object (url, params) }

[Killed] EqualityOperator
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:15:13
     url: "/api/public/primariesge",
     params: {
       qtr: query.quarter,
-      area: query.area === "ALL" ? "" : query.area,
+      area: query.area !== "ALL" ? "" : query.area,
     },
   });
killedBy: GeneralEducationSearchPage tests objectToAxiosParams converts ALL area to empty string and keeps other values
statusReason: expected { Object (url, params) } to deeply equal { Object (url, params) }

[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:19:40
     },
   });
 
-  const onSuccess = (courseResults) => {
-    setCourses(courseResults);
-    setHasSearched(true);
-  };
+  const onSuccess = (courseResults) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
killedBy: GeneralEducationSearchPage tests displays no results message when search returns empty course list
statusReason: Unable to find an element with the text: /No GE courses were found with the specified criteria/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:21:20
 
   const onSuccess = (courseResults) => {
     setCourses(courseResults);
-    setHasSearched(true);
+    setHasSearched(false);
   };
 
killedBy: GeneralEducationSearchPage tests displays no results message when search returns empty course list
statusReason: Unable to find an element with the text: /No GE courses were found with the specified criteria/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrayDeclaration
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:24:75
     setHasSearched(true);
   };
 
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
+  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, ["Stryker was here"]);
 
   const fetchGEAreaJSON = (_event, query) => {
killedBy: GeneralEducationSearchPage tests initializes useBackendMutation with correct options
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received:

  1st useBackendMutation call:

  [
-   Any<Function>,

[Killed] BlockStatement
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:26:46
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
 
-  const fetchGEAreaJSON = (_event, query) => {
-    mutation.mutate(query);
-  };
+  const fetchGEAreaJSON = (_event, query) => {};
 
   return (
killedBy: GeneralEducationSearchPage tests displays no results message when search returns empty course list
statusReason: Unable to find an element with the text: /No GE courses were found with the specified criteria/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:36:10
         <h5>UCSB General Education Search</h5>
         <GEAreaSearchForm fetchJSON={fetchGEAreaJSON} />
 
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {false}
 
         {!mutation.isLoading && hasSearched && courses.length === 0 && (
killedBy: GeneralEducationSearchPage tests shows loading indicator when backend mutation is loading
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:36:10
         <h5>UCSB General Education Search</h5>
         <GEAreaSearchForm fetchJSON={fetchGEAreaJSON} />
 
-        {mutation.isLoading && (
-          <div className="text-center">Loading courses...</div>
-        )}
+        {true}
 
         {!mutation.isLoading && hasSearched && courses.length === 0 && (
killedBy: GeneralEducationSearchPage tests shows loading indicator when backend mutation is loading
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:40:48
           <div className="text-center">Loading courses...</div>
         )}
 
-        {!mutation.isLoading && hasSearched && courses.length === 0 && (
+        {!mutation.isLoading && hasSearched && true && (
           <div className="text-center mt-3">
             <p>No GE courses were found with the specified criteria.</p>
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No GE courses were found with the specified criteria.
</p> instead

[Killed] ConditionalExpression
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:40:10
           <div className="text-center">Loading courses...</div>
         )}
 
-        {!mutation.isLoading && hasSearched && courses.length === 0 && (
-          <div className="text-center mt-3">
-            <p>No GE courses were found with the specified criteria.</p>
-          </div>
-        )}
+        {false}
 
         {!mutation.isLoading && courses.length > 0 && (
killedBy: GeneralEducationSearchPage tests displays no results message when search returns empty course list
statusReason: Unable to find an element with the text: /No GE courses were found with the specified criteria/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:46:33
           </div>
         )}
 
-        {!mutation.isLoading && courses.length > 0 && (
+        {!mutation.isLoading && true && (
           <GEAreaCoursesTable courses={courses} />
         )}
killedBy: GeneralEducationSearchPage tests does not show results or no-results before the first search
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <table
  class="table table-striped table-bordered"
  data-testid="GEAreaCoursesTable"
>
  <thead>
    <tr

[Killed] BooleanLiteral
pages/GeneralEducation/Search/GeneralEducationSearchPage.jsx:46:10
           </div>
         )}
 
-        {!mutation.isLoading && courses.length > 0 && (
+        {mutation.isLoading && courses.length > 0 && (
           <GEAreaCoursesTable courses={courses} />
         )}
killedBy: GeneralEducationSearchPage tests displays course results when search returns courses
statusReason: Unable to find an element by: [data-testid="GEAreaCoursesTable"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
