[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:6:25
 import { faInfoCircle } from "@fortawesome/free-solid-svg-icons";
 
 export const convertToFraction = (en1, en2) => {
-  return en1 != null && en2 != null ? `${en1}/${en2}` : "";
+  return en1 != null && en2 == null ? `${en1}/${en2}` : "";
 };
 
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  172/175
Received:

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:56:11
         hhmmTohhmma(timeLocationArray[index].beginTime),
         hhmmTohhmma(timeLocationArray[index].endTime),
       );
-      if (index + 1 < timeLocationArray.length) {
+      if (true) {
         res += `, `;
       }
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:89:12
 // returns the course status based on cancel, closed, or full
 export const formatStatus = (section) => {
   if (section.courseCancelled) {
-    return "Cancelled";
+    return "";
   } else if (section.classClosed === "Y") {
     return "Closed";
killedBy: section utils tests formatStatus tests formatStatus cancelled test
statusReason: expected '' to be 'Cancelled' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:99:52
   }
 };
 
-export const formatSession = (quarter, session) => {
-  const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse || !session || session.length <= 5) {
-    return "";
-  }
-  return session[5];
-};
+export const formatSession = (quarter, session) => {};
 
 export const getQuarter = (row) =>
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] MethodExpression
src/main/utils/sectionUtils.jsx:100:26
 };
 
 export const formatSession = (quarter, session) => {
-  const isSummerCourse = quarter?.toString().endsWith("3");
+  const isSummerCourse = quarter?.toString().startsWith("3");
   if (!isSummerCourse || !session || session.length <= 5) {
     return "";
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] OptionalChaining
src/main/utils/sectionUtils.jsx:100:26
 };
 
 export const formatSession = (quarter, session) => {
-  const isSummerCourse = quarter?.toString().endsWith("3");
+  const isSummerCourse = quarter.toString().endsWith("3");
   if (!isSummerCourse || !session || session.length <= 5) {
     return "";
killedBy: ConvertedSectionTable tests renders blank session when courseInfo is missing or null
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:101:38
 
 export const formatSession = (quarter, session) => {
   const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse || !session || session.length <= 5) {
+  if (!isSummerCourse || !session || false) {
     return "";
   }
killedBy: section utils tests formatSession tests formatSession blanks,length 1 to 5 session test
statusReason: expected undefined to be '' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:101:38
 
 export const formatSession = (quarter, session) => {
   const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse || !session || session.length <= 5) {
+  if (!isSummerCourse || !session || session.length > 5) {
     return "";
   }
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:127:37
   </p>
 );
 
-export const renderDetailPageLink = (row, testid) => (
-  <p className="text-center">
-    <a
-      href={formatInfoLink(row)}
-      data-testid={`${testid}-row-${row.id}-col-detail-link`}
-      target={"_blank"}
-      rel="noopener noreferrer"
-    >
-      {row.original.courseId}
-    </a>
-  </p>
-);
+export const renderDetailPageLink = () => undefined;
 
 export function enrollmentFraction(row) {
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  MATH 2A
Received:

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:132:15
     <a
       href={formatInfoLink(row)}
       data-testid={`${testid}-row-${row.id}-col-detail-link`}
-      target={"_blank"}
+      target={""}
       rel="noopener noreferrer"
     >
killedBy: section utils tests renderDetailPageLink tests renderDetailPageLink test
statusReason: expected '' to be '_blank' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:140:41
   </p>
 );
 
-export function enrollmentFraction(row) {
-  const num = getSectionField(row, "enrolledTotal");
-  const denom = getSectionField(row, "maxEnroll");
-  const result = convertToFraction(num, denom);
-  return result;
-}
+export function enrollmentFraction(row) {}
 
 export const isPrimary = (row) => "primary" in row.original;
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  172/175
Received:

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:142:38
 
 export function enrollmentFraction(row) {
   const num = getSectionField(row, "enrolledTotal");
-  const denom = getSectionField(row, "maxEnroll");
+  const denom = getSectionField(row, "");
   const result = convertToFraction(num, denom);
   return result;
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  172/175
Received:

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:147:35
   return result;
 }
 
-export const isPrimary = (row) => "primary" in row.original;
+export const isPrimary = (row) => "" in row.original;
 
 export const isLectureWithNoSections = (row) =>
killedBy: SectionsTable tests Section Table tests Course ID link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-9-no-action"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:150:21
 export const isPrimary = (row) => "primary" in row.original;
 
 export const isLectureWithNoSections = (row) =>
-  isPrimary(row) && row.original.subRows.length === 0;
+  isPrimary(row) && row.original.subRows.length !== 0;
 
 export const shouldShowAddToScheduleLink = (row) =>
killedBy: section utils tests tests that depend on what kind of row it is isLectureWithNoSections true test
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:150:3
 export const isPrimary = (row) => "primary" in row.original;
 
 export const isLectureWithNoSections = (row) =>
-  isPrimary(row) && row.original.subRows.length === 0;
+  false;
 
 export const shouldShowAddToScheduleLink = (row) =>
killedBy: section utils tests tests that depend on what kind of row it is isLectureWithNoSections true test
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:153:22
   isPrimary(row) && row.original.subRows.length === 0;
 
 export const shouldShowAddToScheduleLink = (row) =>
-  !isPrimary(row) || row.original.subRows.length === 0;
+  !isPrimary(row) || row.original.subRows.length !== 0;
 
 export function getSection(row) {
killedBy: SectionsTable tests Section Table tests Course ID link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-9-no-action"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:153:3
   isPrimary(row) && row.original.subRows.length === 0;
 
 export const shouldShowAddToScheduleLink = (row) =>
-  !isPrimary(row) || row.original.subRows.length === 0;
+  false;
 
 export function getSection(row) {
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-add-to-schedule-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"
