[Killed] ArithmeticOperator
src/main/utils/systemInfo.jsx:4:37
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export const TWENTY_FOUR_HOURS_MS = 1000 * 60 * 60 * 24;
+export const TWENTY_FOUR_HOURS_MS = 1000 * 60 / 60 * 24;
 
 export function useSystemInfo() {
killedBy: utils/systemInfo tests TWENTY_FOUR_HOURS_MS equals 86400000
statusReason: expected 24000 to be 86400000 // Object.is equality
