[Killed] ArrowFunction
main/components/GEAreas/GEAreaSearchForm.jsx:36:43
     [],
   );
 
-  const areaCodes = [...new Set(areas.map((r) => r.requirementCode))];
+  const areaCodes = [...new Set(areas.map(() => undefined))];
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[0]?.yyyyq || startQtr,
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="GEAreaSearch.Area-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrayDeclaration
main/components/GEAreas/GEAreaSearchForm.jsx:36:21
     [],
   );
 
-  const areaCodes = [...new Set(areas.map((r) => r.requirementCode))];
+  const areaCodes = [];
   const [quarter, setQuarter] = useState(
     localQuarter || quarters[0]?.yyyyq || startQtr,
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="GEAreaSearch.Area-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/GEAreas/GEAreaSearchForm.jsx:43:35
   const [area, setArea] = useState(localArea);
   const currentArea = areaCodes.includes(area) ? area : areaCodes[0];
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    localStorage.setItem(quarterKey, quarter);
-    localStorage.setItem(areaKey, currentArea);
-    fetchJSON(event, { quarter, area: currentArea });
-  };
+  const handleSubmit = (event) => {};
 
   return (
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ArrowFunction
main/components/GEAreas/GEAreaSearchForm.jsx:66:27
               <Form.Control
                 as="select"
                 value={currentArea}
-                onChange={(e) => setArea(e.target.value)}
+                onChange={() => undefined}
               >
                 {areaCodes.map((code) => {
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend submit button calls fetchJSON with correct args and sets local storage
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received:

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] StringLiteral
main/components/GEAreas/GEAreaSearchForm.jsx:69:34
                 onChange={(e) => setArea(e.target.value)}
               >
                 {areaCodes.map((code) => {
-                  const testid = `GEAreaSearch.Area-option-${code}`;
+                  const testid = ``;
                   return (
                     <option key={code} data-testid={testid} value={code}>
killedBy: GEAreaSearchForm tests GEAreaSearchForm tests with healthy backend when local state for area is empty, defaults to first GE area
statusReason: Unable to find an element by: [data-testid="GEAreaSearch.Area-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
