[Killed] StringLiteral
src/main/components/OurTable.jsx:114:11
 export function DateColumn(label, getDate) {
   const columnHelper = createColumnHelper();
   const options = {
-    year: "numeric",
+    year: "",
     month: "numeric",
     day: "numeric",
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Value  out of range for Intl.DateTimeFormat options property year
