[Killed] LogicalOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:97:5
   };
 
   const showSaveButton =
-    modalMode === "auto-create" || filteringSchedules.length > 0;
+    modalMode === "auto-create" && filteringSchedules.length > 0;
 
   return (
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal-save-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:97:36
   };
 
   const showSaveButton =
-    modalMode === "auto-create" || filteringSchedules.length > 0;
+    modalMode === "auto-create" || false;
 
   return (
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal-save-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] EqualityOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:120:15
           <Form>
             {
               /* istanbul ignore next */
-              filteringSchedules.length > 0 && modalMode === "normal" ? (
+              filteringSchedules.length >= 0 && modalMode === "normal" ? (
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: SectionsTable tests AddToScheduleModal interactions when there are no schedules When there are no schedules, the message about there being no schedules shows up
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.2-col-action-no-schedules"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:168:12
           >
             Cancel
           </Button>
-          {showSaveButton && (
-            <Button
-              variant="primary"
-              onClick={onSaveButtonClick}
-              data-testid={`${testid}-modal-save-button`}
-              disabled={mutation.isLoading}
-            >
-              {mutation.isLoading ? "Creating..." : "Save Changes"}
-            </Button>
-          )}
+          {false}
         </Modal.Footer>
       </Modal>
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal-save-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:168:12
           >
             Cancel
           </Button>
-          {showSaveButton && (
-            <Button
-              variant="primary"
-              onClick={onSaveButtonClick}
-              data-testid={`${testid}-modal-save-button`}
-              disabled={mutation.isLoading}
-            >
-              {mutation.isLoading ? "Creating..." : "Save Changes"}
-            </Button>
-          )}
+          {showSaveButton || <Button variant="primary" onClick={onSaveButtonClick} data-testid={`${testid}-modal-save-button`} disabled={mutation.isLoading}>
+              {mutation.isLoading ? "Creating..." : "Save Changes"}
+            </Button>}
         </Modal.Footer>
       </Modal>
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal-save-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
