[Killed] BooleanLiteral
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:10:50
 export default function CourseOverTimeIndexPage() {
   // Stryker disable next-line all : Can't test state because hook is internal
   const [courseJSON, setCourseJSON] = useState([]);
-  const [hasSearched, setHasSearched] = useState(false);
+  const [hasSearched, setHasSearched] = useState(true);
 
   const objectToAxiosParams = (query) => ({
killedBy: CourseOverTimeIndexPage tests does not display 'No courses found' message before search is performed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  No courses were found with the specified criteria.
</p> instead

[Killed] EqualityOperator
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:49:48
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
+        {!mutation.isLoading && hasSearched && courseJSON.length !== 0 && (
           <div className="text-center mt-3">
             <p>No courses were found with the specified criteria.</p>
killedBy: CourseOverTimeIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:49:10
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
-          <div className="text-center mt-3">
-            <p>No courses were found with the specified criteria.</p>
-          </div>
-        )}
+        {false}
 
         {/* Results table */}
killedBy: CourseOverTimeIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:56:10
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && courseJSON.length > 0 && (
+        {!mutation.isLoading || courseJSON.length > 0 && (
           <ConvertedSectionTable
             sections={courseJSON}
killedBy: CourseOverTimeIndexPage tests does not display table when search returns empty results
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th
  colspan="1"
>
  CourseId
</th> instead

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeIndexPage.jsx:56:10
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && courseJSON.length > 0 && (
-          <ConvertedSectionTable
-            sections={courseJSON}
-            groupSectionsUnderLectures
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
