[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:17:3
 const TESTID = "ConvertedSectionTable";
 
 const BASE_COLUMNS = [
-  {
-    header: "Quarter",
-    accessorKey: "quarter",
-    cell: ({ row }) => yyyyqToQyy(row.original.courseInfo.quarter),
-  },
+  {},
   {
     header: "CourseId",
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:23:13
     cell: ({ row }) => yyyyqToQyy(row.original.courseInfo.quarter),
   },
   {
-    header: "CourseId",
+    header: "",
     accessorKey: "courseId",
     cell: ({ row }) => row.original.courseInfo.courseId,
killedBy: CourseOverTimeIndexPage tests displays loading message while search is in progress
statusReason: Unable to find an element with the text: CourseId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:34:18
   },
   {
     header: "EnrollCd",
-    accessorKey: "enrollCode",
+    accessorKey: "",
     cell: ({ row }) => row.original.section.enrollCode,
   },
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:62:13
     cell: ({ row }) => formatTime(row.original.section.timeLocations),
   },
   {
-    header: "Location",
+    header: "",
     accessorKey: "location",
     cell: ({ row }) => formatLocation(row.original.section.timeLocations),
killedBy: ConvertedSectionTable tests flat table renders with expected headers
statusReason: Unable to find an element with the text: Location. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ConvertedSectionTable"

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:67:13
     cell: ({ row }) => formatLocation(row.original.section.timeLocations),
   },
   {
-    header: "Instructors",
+    header: "",
     accessorKey: "instructors",
     cell: ({ row }) => formatInstructors(row.original.section.instructors),
killedBy: ConvertedSectionTable tests flat table renders with expected headers
statusReason: Unable to find an element with the text: Instructors. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ConvertedSectionTable"

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:73:18
   },
   {
     header: "Section",
-    accessorKey: "section",
+    accessorKey: "",
     cell: ({ row }) => row.original.section.section,
   },
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:79:11
   {
     header: "Summer Session",
     accessorKey: "summer_session",
-    cell: ({ row }) => row.original.section.session?.replace(/^0+/, ""),
+    cell: () => undefined,
   },
 ];
killedBy: ConvertedSectionTable tests flat table renders with expected fields
statusReason: expected '' to be 'A' // Object.is equality

[Killed] OptionalChaining
main/components/Common/ConvertedSectionTable.jsx:79:24
   {
     header: "Summer Session",
     accessorKey: "summer_session",
-    cell: ({ row }) => row.original.section.session?.replace(/^0+/, ""),
+    cell: ({ row }) => row.original.section.session.replace(/^0+/, ""),
   },
 ];
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:83:25
   },
 ];
 
-const EXPANDER_COLUMN = {
-  id: "expander",
-  header: ({ table }) => (
-    <button
-      data-testid={`${TESTID}-expand-all-rows`}
-      type="button"
-      onClick={table.getToggleAllRowsExpandedHandler()}
-    >
-      {table.getIsAllRowsExpanded() ? "➖" : "➕"}
-    </button>
-  ),
-  cell: ({ row }) =>
-    row.getCanExpand() ? (
-      <button
-        data-testid={`${TESTID}-row-${row.index}-expand-button`}
-        type="button"
-        onClick={row.getToggleExpandedHandler()}
-        style={{ cursor: "pointer" }}
-      >
-        {row.getIsExpanded() ? "➖" : "➕"}
-      </button>
-    ) : (
-      <span data-testid={`${TESTID}-row-${row.index}-cannot-expand`} />
-    ),
-};
+const EXPANDER_COLUMN = {};
 
 const GROUPED_COLUMNS = [EXPANDER_COLUMN, ...BASE_COLUMNS];
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:84:7
 ];
 
 const EXPANDER_COLUMN = {
-  id: "expander",
+  id: "",
   header: ({ table }) => (
     <button
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:85:11
 
 const EXPANDER_COLUMN = {
   id: "expander",
-  header: ({ table }) => (
-    <button
-      data-testid={`${TESTID}-expand-all-rows`}
-      type="button"
-      onClick={table.getToggleAllRowsExpandedHandler()}
-    >
-      {table.getIsAllRowsExpanded() ? "➖" : "➕"}
-    </button>
-  ),
+  header: () => undefined,
   cell: ({ row }) =>
     row.getCanExpand() ? (
killedBy: ConvertedSectionTable tests grouped table expander column header toggles all expandable rows
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-expand-all-rows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:94:9
       {table.getIsAllRowsExpanded() ? "➖" : "➕"}
     </button>
   ),
-  cell: ({ row }) =>
-    row.getCanExpand() ? (
-      <button
-        data-testid={`${TESTID}-row-${row.index}-expand-button`}
-        type="button"
-        onClick={row.getToggleExpandedHandler()}
-        style={{ cursor: "pointer" }}
-      >
-        {row.getIsExpanded() ? "➖" : "➕"}
-      </button>
-    ) : (
-      <span data-testid={`${TESTID}-row-${row.index}-cannot-expand`} />
-    ),
+  cell: () => undefined,
 };
 
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:100:16
         data-testid={`${TESTID}-row-${row.index}-expand-button`}
         type="button"
         onClick={row.getToggleExpandedHandler()}
-        style={{ cursor: "pointer" }}
+        style={{}}
       >
         {row.getIsExpanded() ? "➖" : "➕"}
killedBy: ConvertedSectionTable tests grouped table expander column row buttons toggle individual lectures
statusReason: expect(element).toHaveAttribute("style", "cursor: pointer;") // element.getAttribute("style") === "cursor: pointer;"

Expected the element to have attribute:
  style="cursor: pointer;"
Received:
  null

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:111:44
 
 const GROUPED_COLUMNS = [EXPANDER_COLUMN, ...BASE_COLUMNS];
 
-function isLectureSectionCode(sectionCode) {
-  return sectionCode.endsWith("00");
-}
+function isLectureSectionCode(sectionCode) {}
 
 function getLectureSectionPrefix(sectionCode) {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/components/Common/ConvertedSectionTable.jsx:112:10
 const GROUPED_COLUMNS = [EXPANDER_COLUMN, ...BASE_COLUMNS];
 
 function isLectureSectionCode(sectionCode) {
-  return sectionCode.endsWith("00");
+  return sectionCode.startsWith("00");
 }
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:115:47
   return sectionCode.endsWith("00");
 }
 
-function getLectureSectionPrefix(sectionCode) {
-  return sectionCode.replace(/0+$/, "");
-}
+function getLectureSectionPrefix(sectionCode) {}
 
 function courseKey(quarter, courseId) {
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] StringLiteral
main/components/Common/ConvertedSectionTable.jsx:116:37
 }
 
 function getLectureSectionPrefix(sectionCode) {
-  return sectionCode.replace(/0+$/, "");
+  return sectionCode.replace(/0+$/, "Stryker was here!");
 }
 
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:119:39
   return sectionCode.replace(/0+$/, "");
 }
 
-function courseKey(quarter, courseId) {
-  return `${quarter}|${courseId}`;
-}
+function courseKey(quarter, courseId) {}
 
 // Function that groups sections with the right lecture from the original sections object
killedBy: ConvertedSectionTable tests grouped table expander column header toggles all expandable rows
statusReason: Found multiple elements with the text: 0101

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="ConvertedSectionTable-cell-row-0.0-col-section"
  style="background-color: inherit; font-weight: normal;"

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:127:49
 function buildGroupedSectionRows(flatSections) {
   const sectionsByCourse = new Map();
 
-  for (let j = 0; j < flatSections.length; j++) {
-    const entry = flatSections[j];
-    if (isLectureSectionCode(entry.section.section)) {
-      continue;
-    }
-
-    const key = courseKey(entry.courseInfo.quarter, entry.courseInfo.courseId);
-    if (!sectionsByCourse.has(key)) {
-      sectionsByCourse.set(key, []);
-    }
-    sectionsByCourse.get(key).push(entry);
-  }
+  for (let j = 0; j < flatSections.length; j++) {}
 
   const result = [];
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] EqualityOperator
main/components/Common/ConvertedSectionTable.jsx:127:19
 function buildGroupedSectionRows(flatSections) {
   const sectionsByCourse = new Map();
 
-  for (let j = 0; j < flatSections.length; j++) {
+  for (let j = 0; j >= flatSections.length; j++) {
     const entry = flatSections[j];
     if (isLectureSectionCode(entry.section.section)) {
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:129:9
 
   for (let j = 0; j < flatSections.length; j++) {
     const entry = flatSections[j];
-    if (isLectureSectionCode(entry.section.section)) {
+    if (false) {
       continue;
     }
killedBy: ConvertedSectionTable tests grouped table expander column row buttons toggle individual lectures
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-0-cannot-expand"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:129:9
 
   for (let j = 0; j < flatSections.length; j++) {
     const entry = flatSections[j];
-    if (isLectureSectionCode(entry.section.section)) {
+    if (true) {
       continue;
     }
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:134:9
     }
 
     const key = courseKey(entry.courseInfo.quarter, entry.courseInfo.courseId);
-    if (!sectionsByCourse.has(key)) {
+    if (false) {
       sectionsByCourse.set(key, []);
     }
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
main/components/Common/ConvertedSectionTable.jsx:134:9
     }
 
     const key = courseKey(entry.courseInfo.quarter, entry.courseInfo.courseId);
-    if (!sectionsByCourse.has(key)) {
+    if (sectionsByCourse.has(key)) {
       sectionsByCourse.set(key, []);
     }
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] UpdateOperator
main/components/Common/ConvertedSectionTable.jsx:142:44
 
   const result = [];
 
-  for (let i = 0; i < flatSections.length; i++) {
+  for (let i = 0; i < flatSections.length; i--) {
     const entry = flatSections[i];
     const sectionCode = entry.section.section;
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:142:19
 
   const result = [];
 
-  for (let i = 0; i < flatSections.length; i++) {
+  for (let i = 0; false; i++) {
     const entry = flatSections[i];
     const sectionCode = entry.section.section;
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/Common/ConvertedSectionTable.jsx:146:9
     const entry = flatSections[i];
     const sectionCode = entry.section.section;
 
-    if (!isLectureSectionCode(sectionCode)) {
+    if (isLectureSectionCode(sectionCode)) {
       continue;
     }
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:146:45
     const entry = flatSections[i];
     const sectionCode = entry.section.section;
 
-    if (!isLectureSectionCode(sectionCode)) {
-      continue;
-    }
+    if (!isLectureSectionCode(sectionCode)) {}
 
     const { quarter, courseId } = entry.courseInfo;
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="ConvertedSectionTable-cell-row-2-col-section"
  style="background-color: inherit; font-weight: bold;"
>
  0101
</td> instead

[Killed] MethodExpression
main/components/Common/ConvertedSectionTable.jsx:152:21
 
     const { quarter, courseId } = entry.courseInfo;
     const prefix = getLectureSectionPrefix(sectionCode);
-    const subRows = (
-      sectionsByCourse.get(courseKey(quarter, courseId)) || []
-    ).filter((section) => section.section.section.startsWith(prefix));
+    const subRows = sectionsByCourse.get(courseKey(quarter, courseId)) || [];
 
     result.push({
killedBy: ConvertedSectionTable tests grouped table nests sections under the correct lecture when a course has two lectures
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="ConvertedSectionTable-cell-row-0.1-col-section"
  style="background-color: inherit; font-weight: normal;"
>
  0201
</td> instead

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:153:7
     const { quarter, courseId } = entry.courseInfo;
     const prefix = getLectureSectionPrefix(sectionCode);
     const subRows = (
-      sectionsByCourse.get(courseKey(quarter, courseId)) || []
+      true
     ).filter((section) => section.section.section.startsWith(prefix));
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:153:7
     const { quarter, courseId } = entry.courseInfo;
     const prefix = getLectureSectionPrefix(sectionCode);
     const subRows = (
-      sectionsByCourse.get(courseKey(quarter, courseId)) || []
+      false
     ).filter((section) => section.section.section.startsWith(prefix));
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] MethodExpression
main/components/Common/ConvertedSectionTable.jsx:154:27
     const prefix = getLectureSectionPrefix(sectionCode);
     const subRows = (
       sectionsByCourse.get(courseKey(quarter, courseId)) || []
-    ).filter((section) => section.section.section.startsWith(prefix));
+    ).filter((section) => section.section.section.endsWith(prefix));
 
     result.push({
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: Unable to find an element with the text: 0102. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:154:14
     const prefix = getLectureSectionPrefix(sectionCode);
     const subRows = (
       sectionsByCourse.get(courseKey(quarter, courseId)) || []
-    ).filter((section) => section.section.section.startsWith(prefix));
+    ).filter(() => undefined);
 
     result.push({
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: Unable to find an element by: [data-testid="ConvertedSectionTable-row-1-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="ConvertedSectionTable"

[Killed] ObjectLiteral
main/components/Common/ConvertedSectionTable.jsx:156:17
       sectionsByCourse.get(courseKey(quarter, courseId)) || []
     ).filter((section) => section.section.section.startsWith(prefix));
 
-    result.push({
-      ...entry,
-      subRows,
-    });
+    result.push({});
   }
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:165:53
   return result;
 }
 
-function GroupedConvertedSectionTable({ sections }) {
-  const groupedData = useMemo(
-    () => buildGroupedSectionRows(sections),
-    [sections],
-  );
-
-  return (
-    <SectionsTableBase
-      data={groupedData}
-      columns={GROUPED_COLUMNS}
-      testid={TESTID}
-    />
-  );
-}
+function GroupedConvertedSectionTable({ sections }) {}
 
 function ConvertedSectionTable({
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Common/ConvertedSectionTable.jsx:167:5
 
 function GroupedConvertedSectionTable({ sections }) {
   const groupedData = useMemo(
-    () => buildGroupedSectionRows(sections),
+    () => undefined,
     [sections],
   );
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
main/components/Common/ConvertedSectionTable.jsx:182:32
 
 function ConvertedSectionTable({
   sections,
-  groupSectionsUnderLectures = false,
+  groupSectionsUnderLectures = true,
 }) {
   if (groupSectionsUnderLectures) {
killedBy: ConvertedSectionTable tests flat table renders OurTable when groupSectionsUnderLectures is disabled
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  data-testid="ConvertedSectionTable-expand-all-rows"
  type="button"
>
  ➕
</button> instead

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:183:4
 function ConvertedSectionTable({
   sections,
   groupSectionsUnderLectures = false,
-}) {
-  if (groupSectionsUnderLectures) {
-    return <GroupedConvertedSectionTable sections={sections} />;
-  }
-
-  return <OurTable data={sections} columns={BASE_COLUMNS} testid={TESTID} />;
-}
+}) {}
 
 export default ConvertedSectionTable;
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Common/ConvertedSectionTable.jsx:184:7
   sections,
   groupSectionsUnderLectures = false,
 }) {
-  if (groupSectionsUnderLectures) {
+  if (true) {
     return <GroupedConvertedSectionTable sections={sections} />;
   }
killedBy: ConvertedSectionTable tests flat table renders OurTable when groupSectionsUnderLectures is disabled
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  data-testid="ConvertedSectionTable-expand-all-rows"
  type="button"
>
  ➕
</button> instead

[Killed] BlockStatement
main/components/Common/ConvertedSectionTable.jsx:184:35
   sections,
   groupSectionsUnderLectures = false,
 }) {
-  if (groupSectionsUnderLectures) {
-    return <GroupedConvertedSectionTable sections={sections} />;
-  }
+  if (groupSectionsUnderLectures) {}
 
   return <OurTable data={sections} columns={BASE_COLUMNS} testid={TESTID} />;
killedBy: ConvertedSectionTable tests grouped table shows lectures and hides sections until expanded
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="ConvertedSectionTable-cell-row-2-col-section"
>
  0101
</td> instead
