[Killed] LogicalOperator
main/components/Nav/Footer.jsx:7:5
 
 export default function Footer(systemInfo) {
   const sourceRepo =
-    systemInfo?.systemInfo?.sourceRepo ||
-    "https://github.com/ucsb-cs156/proj-courses";
+    systemInfo?.systemInfo?.sourceRepo && "https://github.com/ucsb-cs156/proj-courses";
   return (
     <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5">
killedBy: Footer tests Links are correct
statusReason: expect(element).toHaveAttribute("href", "https://github.com/ucsb-cs156/proj-courses") // element.getAttribute("href") === "https://github.com/ucsb-cs156/proj-courses"

Expected the element to have attribute:
  href="https://github.com/ucsb-cs156/proj-courses"
Received:
  null

[Killed] OptionalChaining
main/components/Nav/Footer.jsx:7:5
 
 export default function Footer(systemInfo) {
   const sourceRepo =
-    systemInfo?.systemInfo?.sourceRepo ||
+    systemInfo?.systemInfo.sourceRepo ||
     "https://github.com/ucsb-cs156/proj-courses";
   return (
killedBy: CSVDownloadsPage tests uses fallback quarters when systemInfo is unavailable
statusReason: Cannot read properties of null (reading 'sourceRepo')

[Killed] StringLiteral
main/components/Nav/Footer.jsx:8:5
 export default function Footer(systemInfo) {
   const sourceRepo =
     systemInfo?.systemInfo?.sourceRepo ||
-    "https://github.com/ucsb-cs156/proj-courses";
+    "";
   return (
     <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5">
killedBy: Footer tests Links are correct
statusReason: expect(element).toHaveAttribute("href", "https://github.com/ucsb-cs156/proj-courses") // element.getAttribute("href") === "https://github.com/ucsb-cs156/proj-courses"

Expected the element to have attribute:
  href="https://github.com/ucsb-cs156/proj-courses"
Received:
  href=""
