[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:57:5
 
 const formatGeneralEducation = (row) => {
   const primaryRow =
-    row.depth === 0 ? row.original : row.getParentRow()?.original;
+    true ? row.original : row.getParentRow()?.original;
   const geList = primaryRow?.generalEducation;
 
killedBy: SectionsTable tests Section Table tests renders GE Areas column and formatted values when includeGeneralEducation is true
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  L&S, L&S
Received:

[Killed] MethodExpression
main/components/Sections/SectionsTable.jsx:66:23
 
   return geList
     .map((ge) => {
-      const college = ge?.geCollege?.trim?.();
+      const college = ge?.geCollege;
 
       return college;
killedBy: SectionsTable tests Section Table tests renders GE Areas column and formatted values when includeGeneralEducation is true
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  L&S, L&S
Received:
  L&S , L&S
