[Killed] BlockStatement
src/main/utils/currentUser.jsx:5:34
 import axios from "axios";
 import { useNavigate } from "react-router-dom";
 
-export function useCurrentUser() {
-  return useQuery(
-    "current user",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        const rolesList = response.data.roles.map((r) => r.authority);
-        response.data = { ...response.data, rolesList: rolesList };
-        const returnValue = { loggedIn: true, root: response.data };
-        return returnValue;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return { loggedIn: false, root: null, initialData: true };
-      }
-    },
-    {
-      initialData: { loggedIn: false, root: null, initialData: true },
-    },
-  );
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: Cannot destructure property 'data' of 'useCurrentUser(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/currentUser.jsx:8:17
 export function useCurrentUser() {
   return useQuery(
     "current user",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        const rolesList = response.data.roles.map((r) => r.authority);
-        response.data = { ...response.data, rolesList: rolesList };
-        const returnValue = { loggedIn: true, root: response.data };
-        return returnValue;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return { loggedIn: false, root: null, initialData: true };
-      }
-    },
+    async () => {},
     {
       initialData: { loggedIn: false, root: null, initialData: true },
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/main/utils/currentUser.jsx:9:11
   return useQuery(
     "current user",
     async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        const rolesList = response.data.roles.map((r) => r.authority);
-        response.data = { ...response.data, rolesList: rolesList };
-        const returnValue = { loggedIn: true, root: response.data };
-        return returnValue;
-      } catch (e) {
+      try {} catch (e) {
         console.error("Error invoking axios.get: ", e);
         return { loggedIn: false, root: null, initialData: true };
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/main/utils/currentUser.jsx:11:51
     async () => {
       try {
         const response = await axios.get("/api/currentUser");
-        const rolesList = response.data.roles.map((r) => r.authority);
+        const rolesList = response.data.roles.map(() => undefined);
         response.data = { ...response.data, rolesList: rolesList };
         const returnValue = { loggedIn: true, root: response.data };
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

  [
    [

[Killed] BooleanLiteral
src/main/utils/currentUser.jsx:13:41
         const response = await axios.get("/api/currentUser");
         const rolesList = response.data.roles.map((r) => r.authority);
         response.data = { ...response.data, rolesList: rolesList };
-        const returnValue = { loggedIn: true, root: response.data };
+        const returnValue = { loggedIn: false, root: response.data };
         return returnValue;
       } catch (e) {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Not logged in.
    </p>

[Killed] ObjectLiteral
src/main/utils/currentUser.jsx:13:29
         const response = await axios.get("/api/currentUser");
         const rolesList = response.data.roles.map((r) => r.authority);
         response.data = { ...response.data, rolesList: rolesList };
-        const returnValue = { loggedIn: true, root: response.data };
+        const returnValue = {};
         return returnValue;
       } catch (e) {
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

  [
    [

[Killed] BlockStatement
src/main/utils/currentUser.jsx:15:19
         response.data = { ...response.data, rolesList: rolesList };
         const returnValue = { loggedIn: true, root: response.data };
         return returnValue;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return { loggedIn: false, root: null, initialData: true };
-      }
+      } catch (e) {}
     },
     {
killedBy: GeneralEducationSearchPage tests logged out calls GE section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/main/utils/currentUser.jsx:17:28
         return returnValue;
       } catch (e) {
         console.error("Error invoking axios.get: ", e);
-        return { loggedIn: false, root: null, initialData: true };
+        return { loggedIn: true, root: null, initialData: true };
       }
     },
killedBy: GeneralEducationSearchPage tests logged out calls GE section search api correctly with 1 section response
statusReason: Cannot read properties of null (reading 'user')

[Timeout] BooleanLiteral
src/main/utils/currentUser.jsx:17:60
         return returnValue;
       } catch (e) {
         console.error("Error invoking axios.get: ", e);
-        return { loggedIn: false, root: null, initialData: true };
+        return { loggedIn: false, root: null, initialData: false };
       }
     },

[Killed] BlockStatement
src/main/utils/currentUser.jsx:37:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-  // The following hack is because there is some bug in terms of the
-  // shape of the data returned by useCurrentUser.  Is there a separate
-  // data level, or not?
-
-  // We will file an issue to track that down and then remove this hack
-
-  if (currentUser == null) return false;
-
-  if (
-    "data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root
-  ) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
-
-  return currentUser.root?.rolesList?.includes(role);
-}
+export function hasRole(currentUser, role) {}
 
killedBy: GeneralEducationSearchPage tests logged in calls GE section search api correctly with 1 section response
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

  [
    [

[Killed] LogicalOperator
src/main/utils/currentUser.jsx:47:5
   if (currentUser == null) return false;
 
   if (
-    "data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root
+    "data" in currentUser && "root" in currentUser.data && currentUser.data.root != null || "rolesList" in currentUser.data.root
   ) {
     return currentUser.data.root.rolesList.includes(role);
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'root')

[Killed] ConditionalExpression
src/main/utils/currentUser.jsx:47:5
   if (currentUser == null) return false;
 
   if (
-    "data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root
+    true
   ) {
     return currentUser.data.root.rolesList.includes(role);
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'root')

[Killed] BlockStatement
src/main/utils/currentUser.jsx:51:5
     "root" in currentUser.data &&
     currentUser.data.root != null &&
     "rolesList" in currentUser.data.root
-  ) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
+  ) {}
 
   return currentUser.root?.rolesList?.includes(role);
killedBy: utils/currentUser tests hasRole tests some code paths when data is in currentUser
statusReason: expected undefined to be truthy
