[Killed] ArithmeticOperator
src/main/utils/systemInfo.jsx:4:37
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export const TWENTY_FOUR_HOURS_MS = 1000 * 60 * 60 * 24;
+export const TWENTY_FOUR_HOURS_MS = 1000 / 60 * 60 * 24;
 
 export function useSystemInfo() {
killedBy: utils/systemInfo tests TWENTY_FOUR_HOURS_MS equals 86400000
statusReason: expected 24000.000000000004 to be 86400000 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/systemInfo.jsx:4:37
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export const TWENTY_FOUR_HOURS_MS = 1000 * 60 * 60 * 24;
+export const TWENTY_FOUR_HOURS_MS = 1000 * 60 * 60 / 24;
 
 export function useSystemInfo() {
killedBy: utils/systemInfo tests TWENTY_FOUR_HOURS_MS equals 86400000
statusReason: expected 150000 to be 86400000 // Object.is equality

[Killed] BlockStatement
src/main/utils/systemInfo.jsx:6:33
 
 export const TWENTY_FOUR_HOURS_MS = 1000 * 60 * 60 * 24;
 
-export function useSystemInfo() {
-  return useQuery(
-    "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
-    {
-      placeholderData: {
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-        startQtrYYYYQ: "20221",
-        endQtrYYYYQ: "20222",
-      },
-      staleTime: TWENTY_FOUR_HOURS_MS,
-      cacheTime: TWENTY_FOUR_HOURS_MS,
-    },
-  );
-}
+export function useSystemInfo() {}
 
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: Cannot destructure property 'data' of 'useSystemInfo(...)' as it is undefined.

[Killed] ObjectLiteral
src/main/utils/systemInfo.jsx:18:5
         return {};
       }
     },
-    {
-      placeholderData: {
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-        startQtrYYYYQ: "20221",
-        endQtrYYYYQ: "20222",
-      },
-      staleTime: TWENTY_FOUR_HOURS_MS,
-      cacheTime: TWENTY_FOUR_HOURS_MS,
-    },
+    {},
   );
 }
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^Searching for: ANTH for quarters W22 through W22$/
Received:
  Searching for: ANTH for quarters W21 through W21

[Killed] ObjectLiteral
src/main/utils/systemInfo.jsx:19:24
       }
     },
     {
-      placeholderData: {
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-        startQtrYYYYQ: "20221",
-        endQtrYYYYQ: "20222",
-      },
+      placeholderData: {},
       staleTime: TWENTY_FOUR_HOURS_MS,
       cacheTime: TWENTY_FOUR_HOURS_MS,
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^Searching for: ANTH for quarters W22 through W22$/
Received:
  Searching for: ANTH for quarters W21 through W21

[Killed] StringLiteral
src/main/utils/systemInfo.jsx:22:24
       placeholderData: {
         springH2ConsoleEnabled: false,
         showSwaggerUILink: false,
-        startQtrYYYYQ: "20221",
+        startQtrYYYYQ: "",
         endQtrYYYYQ: "20222",
       },
killedBy: CourseOverTimeBuildingsIndexPage tests renders without crashing
statusReason: param should be five digits
