[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:15:19
   // *currently selectted* start and end quarters for the search!
 
   const firstQtr = systemInfo.startQtrYYYYQ || "20211";
-  const lastQtr = systemInfo.endQtrYYYYQ || "20214";
+  const lastQtr = false;
 
   const quarters = quarterRange(firstQtr, lastQtr);
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm basic tests when I select a start quarter, the state for start quarter changes
statusReason: param should be a string

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:20:5
   const quarters = quarterRange(firstQtr, lastQtr);
 
   const localStartQuarter = localStorage.getItem(
-    "CourseOverTimeInstructorSearch.StartQuarter",
+    "",
   );
 
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected '20084' to be '20211' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:30:5
     "CourseOverTimeInstructorSearch.Instructor",
   );
   const localStorageCheckbox =
-    localStorage.getItem("CourseOverTimeInstructorSearch.Checkbox") === "true";
+    true;
 
   const [startQuarter, setStartQuarter] = useState(
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:30:5
     "CourseOverTimeInstructorSearch.Instructor",
   );
   const localStorageCheckbox =
-    localStorage.getItem("CourseOverTimeInstructorSearch.Checkbox") === "true";
+    false;
 
   const [startQuarter, setStartQuarter] = useState(
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected "getItem" to be called with arguments: [ Array(1) ]

Received:

  1st getItem call:

  [
-   "CourseOverTimeInstructorSearch.Checkbox",

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:39:48
   // Stryker disable next-line all : TODO: write a good test for this or refactor
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
-  const [instructor, setInstructor] = useState(localInstructor || "");
+  const [instructor, setInstructor] = useState(localInstructor && "");
   const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
 
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected '' to be 'Conrad' // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:39:48
   // Stryker disable next-line all : TODO: write a good test for this or refactor
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
-  const [instructor, setInstructor] = useState(localInstructor || "");
+  const [instructor, setInstructor] = useState(false);
   const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
 
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm basic tests when I select an instructor name, the state for instructor name changes
statusReason: expected 'falseconrad' to be 'conrad' // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:40:44
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
   const [instructor, setInstructor] = useState(localInstructor || "");
-  const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
+  const [checkbox, setCheckbox] = useState(true);
 
   const handleSubmit = (event) => {
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm basic tests when I select the checkbox, the state for checkbox changes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:40:44
   const [endQuarter, setEndQuarter] = useState(localEndQuarter || lastQtr);
 
   const [instructor, setInstructor] = useState(localInstructor || "");
-  const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
+  const [checkbox, setCheckbox] = useState(false);
 
   const handleSubmit = (event) => {
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm interactions with local storage checks the expected values in local storage
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:79:26
               quarters={quarters}
               quarter={endQuarter}
               setQuarter={setEndQuarter}
-              controlId={"CourseOverTimeInstructorSearch.EndQuarter"}
+              controlId={""}
               label={"End Quarter"}
             />
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm basic tests when I select an end quarter, the state for end quarter changes
statusReason: Found a label with the text of: End Quarter, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeInstructorSearchForm.jsx:101:18
         </Form.Group>
         <Row
           data-testid={`${testid}-bottom-row`}
-          style={{ paddingTop: 10, paddingBottom: 10 }}
+          style={{}}
         >
           <Col md="auto">
killedBy: CourseOverTimeInstructorSearchForm tests CourseOverTimeInstructorSearchForm basic tests Button padding is correct
statusReason: expect(element).toHaveAttribute("style", "padding-top: 10px; padding-bottom: 10px;") // element.getAttribute("style") === "padding-top: 10px; padding-bottom: 10px;"

Expected the element to have attribute:
  style="padding-top: 10px; padding-bottom: 10px;"
Received:
  null
