[Killed] BlockStatement
main/components/Buildings/SingleBuildingDropdown.jsx:17:45
     localSearchBuilding || "U",
   );
 
-  const handleBuildingtoChange = (event) => {
-    localStorage.setItem(controlId, event.target.value);
-    setBuildingState(event.target.value);
-    setBuilding(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleBuildingtoChange = (event) => {};
 
   return (
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: expected { startQtr: '20222', …(2) } to deeply equal { startQtr: '20222', …(2) }

[Killed] EqualityOperator
main/components/Buildings/SingleBuildingDropdown.jsx:21:9
     localStorage.setItem(controlId, event.target.value);
     setBuildingState(event.target.value);
     setBuilding(event.target.value);
-    if (onChange != null) {
+    if (onChange == null) {
       onChange(event);
     }
killedBy: SingleBuildingDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
main/components/Buildings/SingleBuildingDropdown.jsx:21:27
     localStorage.setItem(controlId, event.target.value);
     setBuildingState(event.target.value);
     setBuilding(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
+    if (onChange != null) {}
   };
 
killedBy: SingleBuildingDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
main/components/Buildings/SingleBuildingDropdown.jsx:34:45
         value={buildingState}
         onChange={handleBuildingtoChange}
       >
-        {buildings.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
-          return (
-            <option key={key} data-testid={key} value={object[0]}>
-              {object[1]}
-            </option>
-          );
-        })}
+        {buildings.map(function (object, i) {})}
       </Form.Control>
     </Form.Group>
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element by: [data-testid="CourseOverTimeBuildingsSearch.BuildingCode-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Buildings/SingleBuildingDropdown.jsx:35:23
         onChange={handleBuildingtoChange}
       >
         {buildings.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={object[0]}>
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element by: [data-testid="CourseOverTimeBuildingsSearch.BuildingCode-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
