[Killed] ObjectLiteral
main/components/Finals/FinalExamCard.jsx:4:24
 import Card from "react-bootstrap/Card";
 
 // Stryker disable StringLiteral : otherwise we would have to test for every possible day and month value, which is not practical
-const dayToStringMap = {
-  M: "Monday",
-  T: "Tuesday",
-  W: "Wednesday",
-  R: "Thursday",
-  F: "Friday",
-  S: "Saturday",
-  U: "Sunday",
-};
+const dayToStringMap = {};
 
 const monthToStringMap = {
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] BlockStatement
main/components/Finals/FinalExamCard.jsx:33:30
 
 // Stryker restore StringLiteral
 
-const dayToString = (day) => {
-  return dayToStringMap[day] || day;
-};
+const dayToString = (day) => {};
 
 const monthToString = (month) => {
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] ConditionalExpression
main/components/Finals/FinalExamCard.jsx:34:10
 // Stryker restore StringLiteral
 
 const dayToString = (day) => {
-  return dayToStringMap[day] || day;
+  return false;
 };
 
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] ConditionalExpression
main/components/Finals/FinalExamCard.jsx:34:10
 // Stryker restore StringLiteral
 
 const dayToString = (day) => {
-  return dayToStringMap[day] || day;
+  return true;
 };
 
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] BlockStatement
main/components/Finals/FinalExamCard.jsx:37:34
   return dayToStringMap[day] || day;
 };
 
-const monthToString = (month) => {
-  return monthToStringMap[month] || month;
-};
+const monthToString = (month) => {};
 
 const formatDate = (date) => {
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] ConditionalExpression
main/components/Finals/FinalExamCard.jsx:38:10
 };
 
 const monthToString = (month) => {
-  return monthToStringMap[month] || month;
+  return false;
 };
 
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] LogicalOperator
main/components/Finals/FinalExamCard.jsx:38:10
 };
 
 const monthToString = (month) => {
-  return monthToStringMap[month] || month;
+  return monthToStringMap[month] && month;
 };
 
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] BlockStatement
main/components/Finals/FinalExamCard.jsx:41:30
   return monthToStringMap[month] || month;
 };
 
-const formatDate = (date) => {
-  return `${monthToString(date.substring(4, 6))} ${parseInt(date.substring(6, 8))}, ${date.substring(0, 4)}`;
-};
+const formatDate = (date) => {};
 
 // cardProps can be used to pass additional props to the Card component, such as styling or className
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] MethodExpression
main/components/Finals/FinalExamCard.jsx:42:61
 };
 
 const formatDate = (date) => {
-  return `${monthToString(date.substring(4, 6))} ${parseInt(date.substring(6, 8))}, ${date.substring(0, 4)}`;
+  return `${monthToString(date.substring(4, 6))} ${parseInt(date)}, ${date.substring(0, 4)}`;
 };
 
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] MethodExpression
main/components/Finals/FinalExamCard.jsx:42:27
 };
 
 const formatDate = (date) => {
-  return `${monthToString(date.substring(4, 6))} ${parseInt(date.substring(6, 8))}, ${date.substring(0, 4)}`;
+  return `${monthToString(date)} ${parseInt(date.substring(6, 8))}, ${date.substring(0, 4)}`;
 };
 
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] BlockStatement
main/components/Finals/FinalExamCard.jsx:47:20
 
 // cardProps can be used to pass additional props to the Card component, such as styling or className
 function FinalExamCard({ finalsInfo, cardProps = {} }) {
-  if (!finalsInfo) {
-    return null;
-  }
+  if (!finalsInfo) {}
 
   if (finalsInfo.hasFinals === false) {
killedBy: CourseDetailsIndexPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'hasFinals')

[Killed] ConditionalExpression
main/components/Finals/FinalExamCard.jsx:47:7
 
 // cardProps can be used to pass additional props to the Card component, such as styling or className
 function FinalExamCard({ finalsInfo, cardProps = {} }) {
-  if (!finalsInfo) {
+  if (true) {
     return null;
   }
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Final Exam:. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
main/components/Finals/FinalExamCard.jsx:51:7
     return null;
   }
 
-  if (finalsInfo.hasFinals === false) {
+  if (finalsInfo.hasFinals !== false) {
     return (
       <Card {...cardProps}>
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >

[Killed] ConditionalExpression
main/components/Finals/FinalExamCard.jsx:51:7
     return null;
   }
 
-  if (finalsInfo.hasFinals === false) {
+  if (true) {
     return (
       <Card {...cardProps}>
killedBy: FinalExamCard tests FinalExamCard happy path tests renders correctly for CS24 S26
statusReason: Unable to find an element with the text: Tuesday, June 9, 2026 12:00—15:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
    >
