[Killed] ObjectLiteral
main/components/GEAreas/SingleAreaDropdown.jsx:24:5
   const { data: areas, error: _error } = useBackend(
     // Stryker disable next-line all : can't test api calls
     ["/api/public/generalEducationInfo"],
-    { method: "GET", url: "/api/public/generalEducationInfo" },
+    {},
     [],
   );
killedBy: SingleAreaDropdown tests renders without crashing and loads dropdown options from backend
statusReason: Unable to find an element by: [data-testid="SampleGEControlId-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] ArrayDeclaration
main/components/GEAreas/SingleAreaDropdown.jsx:25:5
     // Stryker disable next-line all : can't test api calls
     ["/api/public/generalEducationInfo"],
     { method: "GET", url: "/api/public/generalEducationInfo" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: SingleAreaDropdown tests SingleAreaDropdown tests makes GET request to /api/public/generalEducationInfo
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

@@ -4,7 +4,9 @@
    ],

[Killed] LogicalOperator
main/components/GEAreas/SingleAreaDropdown.jsx:46:10
             ALL
           </option>
         }
-        {areas &&
-          areas.map((areaCode) => {
-            const key = `${controlId}-option-${areaCode}`;
-            return (
-              <option key={key} data-testid={key} value={areaCode}>
-                {areaCode}
-              </option>
-            );
-          })}
+        {areas || areas.map(areaCode => {
+  const key = `${controlId}-option-${areaCode}`;
+  return <option key={key} data-testid={key} value={areaCode}>
+                {areaCode}
+              </option>;
+})}
       </Form.Control>
     </Form.Group>
killedBy: SingleAreaDropdown tests renders without crashing and loads dropdown options from backend
statusReason: Unable to find an element by: [data-testid="SampleGEControlId-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] ConditionalExpression
main/components/GEAreas/SingleAreaDropdown.jsx:46:10
             ALL
           </option>
         }
-        {areas &&
-          areas.map((areaCode) => {
-            const key = `${controlId}-option-${areaCode}`;
-            return (
-              <option key={key} data-testid={key} value={areaCode}>
-                {areaCode}
-              </option>
-            );
-          })}
+        {true}
       </Form.Control>
     </Form.Group>
killedBy: SingleAreaDropdown tests renders without crashing and loads dropdown options from backend
statusReason: Unable to find an element by: [data-testid="SampleGEControlId-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] BlockStatement
main/components/GEAreas/SingleAreaDropdown.jsx:47:35
           </option>
         }
         {areas &&
-          areas.map((areaCode) => {
-            const key = `${controlId}-option-${areaCode}`;
-            return (
-              <option key={key} data-testid={key} value={areaCode}>
-                {areaCode}
-              </option>
-            );
-          })}
+          areas.map((areaCode) => {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleAreaDropdown tests renders without crashing and loads dropdown options from backend
statusReason: Unable to find an element by: [data-testid="SampleGEControlId-option-A1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
