[Killed] StringLiteral
main/components/Jobs/UpdateCoursesByQuarterJobForm.jsx:44:26
               quarters={quarters}
               quarter={quarter}
               setQuarter={setQuarter}
-              controlId={"UpdateCoursesByQuarterJobForm.Quarter"}
+              controlId={""}
             />
           </Col>
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Unable to find an element by: [data-testid="UpdateCoursesByQuarterJobForm.Quarter"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
