[Killed] StringLiteral
main/components/Jobs/UpdateCoursesByQuarterRangeJobForm.jsx:11:18
 import IfStaleCheckBox from "main/components/Jobs/IfStaleCheckBox";
 
 const UpdateCoursesByQuarterRangeJobForm = ({ callback }) => {
-  const formId = "UpdateCoursesByQuarterRangeJobForm";
+  const formId = "";
   const { data: systemInfo } = useSystemInfo();
 
killedBy: UpdateCoursesByQuarterRangeJobForm tests renders correctly
statusReason: Unable to find an element by: [data-testid="/UpdateCoursesByQuarterRangeJobForm.IfStale/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Jobs/UpdateCoursesByQuarterRangeJobForm.jsx:51:26
               quarters={quarters}
               quarter={startQuarter}
               setQuarter={setStartQuarter}
-              controlId={`${formId}.StartQuarter`}
+              controlId={``}
               label={"Start Quarter"}
             />
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Found a label with the text of: Start Quarter, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
