[Killed] EqualityOperator
main/components/Levels/SingleLevelDropdown.jsx:21:9
     localStorage.setItem(controlId, event.target.value);
     setLevelState(event.target.value);
     setLevel(event.target.value);
-    if (onChange != null) {
+    if (onChange == null) {
       onChange(event);
     }
killedBy: SingleLevelDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>
