[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleDropdown.jsx:39:23
         onChange={handleScheduleOnChange}
       >
         {schedules.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={object.id}>
killedBy: SingleSubjectDropdown tests keys / testids are set correctly on options
statusReason: Unable to find an element by: [data-testid="psd1-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
