[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:15:18
   // Stryker disable next-line all : Initial value is immediately overwritten in useEffect
   const [titleClass, setTitleClass] = useState("");
 
-  const testId = "SchedulerEvent";
+  const testId = "";
 
   const convertTimeToMinutes = (time) => {
killedBy: PersonalScheduleEvent tests renders without crashing for a standard event
statusReason: Unable to find an element by: [data-testid="SchedulerEvent-test-event-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-event card"
      data-testid="-test-event-1"

[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:21:9
     const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
     let [hours, minutes] = timePart.split(":").map(Number);
 
-    if (modifier === "PM" && hours !== 12) {
+    if (modifier === "PM" || hours !== 12) {
       hours += 12;
     } else if (modifier === "AM" && hours === 12) {
killedBy: PersonalScheduleEvent tests handles different AM/PM time formats for style calculation
statusReason: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-event card"
      data-testid="SchedulerEvent-event-midday"

[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:23:16
 
     if (modifier === "PM" && hours !== 12) {
       hours += 12;
-    } else if (modifier === "AM" && hours === 12) {
+    } else if (modifier === "AM" || hours === 12) {
       hours = 0;
     }
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-01:00PM (H:60, FS:16px)
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- height: 60px;
+ height: 780px;

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:31:38
   };
 
   const TOP_POSITION_OFFSET = 94;
-  const DISPLAY_START_HOUR_MINUTES = 8 * 60; // 8 AM in minutes
+  const DISPLAY_START_HOUR_MINUTES = 8 / 60; // 8 AM in minutes
 
   useEffect(() => {
killedBy: PersonalScheduleEvent tests renders event with correct position and height
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- top: 154px;
+ top: 633.8666666666667px;

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:36:20
   useEffect(() => {
     const startMinutes = convertTimeToMinutes(event.startTime);
     const endMinutes = convertTimeToMinutes(event.endTime);
-    const height = endMinutes - startMinutes;
+    const height = endMinutes + startMinutes;
     const topPosition =
       startMinutes + TOP_POSITION_OFFSET - DISPLAY_START_HOUR_MINUTES;
killedBy: PersonalScheduleEvent tests does not render time on card if event duration is too short (e.g., < 40min)
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  class="PersonalScheduleCard card-text"
  data-testid="SchedulerEvent-time"
>
  2:00 PM
   -

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:38:7
     const endMinutes = convertTimeToMinutes(event.endTime);
     const height = endMinutes - startMinutes;
     const topPosition =
-      startMinutes + TOP_POSITION_OFFSET - DISPLAY_START_HOUR_MINUTES;
+      startMinutes + TOP_POSITION_OFFSET + DISPLAY_START_HOUR_MINUTES;
 
     // Determine font size class based on height
killedBy: PersonalScheduleEvent tests renders event with correct position and height
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- top: 154px;
+ top: 1114px;

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:38:7
     const endMinutes = convertTimeToMinutes(event.endTime);
     const height = endMinutes - startMinutes;
     const topPosition =
-      startMinutes + TOP_POSITION_OFFSET - DISPLAY_START_HOUR_MINUTES;
+      startMinutes - TOP_POSITION_OFFSET - DISPLAY_START_HOUR_MINUTES;
 
     // Determine font size class based on height
killedBy: PersonalScheduleEvent tests renders event with correct position and height
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- top: 154px;
+ top: -34px;

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:42:9
 
     // Determine font size class based on height
     let fontSizeClass = "event-title-xs";
-    if (height >= 60) {
+    if (height > 60) {
       fontSizeClass = "event-title-lg";
     } else if (height >= 40) {
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-01:00PM (H:60, FS:16px)
statusReason: expect(element).toHaveClass("event-title-lg")

Expected the element to have class:
  event-title-lg
Received:
  scheduler-event-title event-title-md card-text

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:42:9
 
     // Determine font size class based on height
     let fontSizeClass = "event-title-xs";
-    if (height >= 60) {
+    if (height < 60) {
       fontSizeClass = "event-title-lg";
     } else if (height >= 40) {
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-12:20PM (H:20, FS:10px)
statusReason: expect(element).toHaveClass("event-title-xs")

Expected the element to have class:
  event-title-xs
Received:
  scheduler-event-title event-title-lg card-text

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:44:16
     let fontSizeClass = "event-title-xs";
     if (height >= 60) {
       fontSizeClass = "event-title-lg";
-    } else if (height >= 40) {
+    } else if (height < 40) {
       fontSizeClass = "event-title-md";
     } else if (height >= 25) {
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-12:20PM (H:20, FS:10px)
statusReason: expect(element).toHaveClass("event-title-xs")

Expected the element to have class:
  event-title-xs
Received:
  scheduler-event-title event-title-md card-text

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:44:16
     let fontSizeClass = "event-title-xs";
     if (height >= 60) {
       fontSizeClass = "event-title-lg";
-    } else if (height >= 40) {
+    } else if (true) {
       fontSizeClass = "event-title-md";
     } else if (height >= 25) {
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-12:20PM (H:20, FS:10px)
statusReason: expect(element).toHaveClass("event-title-xs")

Expected the element to have class:
  event-title-xs
Received:
  scheduler-event-title event-title-md card-text

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:46:16
       fontSizeClass = "event-title-lg";
     } else if (height >= 40) {
       fontSizeClass = "event-title-md";
-    } else if (height >= 25) {
+    } else if (height < 25) {
       fontSizeClass = "event-title-sm";
     }
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-12:20PM (H:20, FS:10px)
statusReason: expect(element).toHaveClass("event-title-xs")

Expected the element to have class:
  event-title-xs
Received:
  scheduler-event-title event-title-sm card-text

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:46:16
       fontSizeClass = "event-title-lg";
     } else if (height >= 40) {
       fontSizeClass = "event-title-md";
-    } else if (height >= 25) {
+    } else if (true) {
       fontSizeClass = "event-title-sm";
     }
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-12:20PM (H:20, FS:10px)
statusReason: expect(element).toHaveClass("event-title-xs")

Expected the element to have class:
  event-title-xs
Received:
  scheduler-event-title event-title-sm card-text

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:47:23
     } else if (height >= 40) {
       fontSizeClass = "event-title-md";
     } else if (height >= 25) {
-      fontSizeClass = "event-title-sm";
+      fontSizeClass = "";
     }
     setTitleClass(fontSizeClass);
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-12:30PM (H:30, FS:12px)
statusReason: expect(element).toHaveClass("event-title-sm")

Expected the element to have class:
  event-title-sm
Received:
  scheduler-event-title card-text

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:56:17
         top: `${topPosition}px`,
         height: `${height}px`,
         backgroundColor: eventColor,
-        border: `2px solid ${borderColor}`,
+        border: ``,
       },
       height: height,
killedBy: PersonalScheduleEvent tests renders without crashing for a standard event
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- border: 2px solid rgb(100, 100, 200);

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:83:14
               <br />
               {event.description}
             </p>
-            {event.actions &&
-              event.actions.map((action, index) => (
-                <ButtonGroup key={index}>
-                  <Button variant={action.variant} onClick={action.callback}>
-                    {action.text}
-                  </Button>
-                </ButtonGroup>
-              ))}
+            {true}
           </Popover.Body>
         </Popover>
killedBy: PersonalScheduleEvent tests renders action buttons in popover and calls callback on click
statusReason: Unable to find an accessible element with the role "button" and name "Test Action"

Here are the accessible roles:

  heading:

  Name "CS 156":
  <h3

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:102:12
         data-testid={`${testId}-${event.id}`}
       >
         <Card.Body className="scheduler-event-body">
-          {style.height >= 20 && (
-            <Card.Text
-              data-testid={`${testId}-title`}
-              className={`scheduler-event-title ${titleClass}`}
-            >
-              {event.title}
-            </Card.Text>
-          )}
+          {false}
           {style.height >= 40 && (
             <Card.Text
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:102:12
         data-testid={`${testId}-${event.id}`}
       >
         <Card.Body className="scheduler-event-body">
-          {style.height >= 20 && (
+          {style.height > 20 && (
             <Card.Text
               data-testid={`${testId}-title`}
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-12:20PM (H:20, FS:10px)
statusReason: Unable to find an element by: [data-testid="SchedulerEvent-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-event card"
      data-testid="SchedulerEvent-event-1200PM-1220PM"

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:110:12
               {event.title}
             </Card.Text>
           )}
-          {style.height >= 40 && (
+          {style.height < 40 && (
             <Card.Text
               data-testid={`${testId}-time`}
killedBy: PersonalScheduleEvent tests renders title and time on card if event duration is sufficient
statusReason: Unable to find an element by: [data-testid="SchedulerEvent-time"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-event card"
      data-testid="SchedulerEvent-test-event-1"

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleEvent.jsx:110:12
               {event.title}
             </Card.Text>
           )}
-          {style.height >= 40 && (
+          {style.height > 40 && (
             <Card.Text
               data-testid={`${testId}-time`}
killedBy: PersonalScheduleEvent tests renders event from 12:00PM-12:40PM (H:40, FS:14px)
statusReason: Unable to find an element by: [data-testid="SchedulerEvent-time"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-event card"
      data-testid="SchedulerEvent-event-1200PM-1240PM"
