[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalScheduleForm.jsx:35:22
   // Stryker disable next-line all : TODO: Fix the state handling for quarters
   const [quarter, setQuarter] = useState(quarters[quarters.length - 1]);
 
-  const quarterMap = {
-    1: "W",
-    2: "S",
-    3: "M",
-    4: "F",
-  };
+  const quarterMap = {};
 
   return (
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(W22)

Expected the element to have value:
  W22
Received:
  undefined22

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleForm.jsx:36:8
   const [quarter, setQuarter] = useState(quarters[quarters.length - 1]);
 
   const quarterMap = {
-    1: "W",
+    1: "",
     2: "S",
     3: "M",
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(W22)

Expected the element to have value:
  W22
Received:
  22
