[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:37:32
               <Card.Body>
                 <Card.Title
                   className="scheduler-day-title"
-                  data-testid={`${testId}-${day}-title`}
+                  data-testid={``}
                 >
                   {day}
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-Monday-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:42:30
                   {day}
                 </Card.Title>
               </Card.Body>
-              {Events.filter((event) => event.day === day).map((event) => (
+              {Events.filter(() => undefined).map((event) => (
                 <SchedulerEvents
                   key={event.id}
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element with the text: ECE 1A (0100). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:62:22
               data-testid={`${testId}-timeslot-header`}
             ></div>
           }
-          {hours.map((hour, index) => (
-            <div
-              key={index}
-              className="time-slot-no-border"
-              data-testid={`${testId}-${hour.replace(" ", "-")}-title`}
-            >
-              <span
-                className="scheduler-hour-label"
-                data-testid={`${testId}-${hour.replace(" ", "-")}-label`}
-              >
-                {hour}
-              </span>
-            </div>
-          ))}
+          {hours.map(() => undefined)}
         </Col>
 
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:66:59
             <div
               key={index}
               className="time-slot-no-border"
-              data-testid={`${testId}-${hour.replace(" ", "-")}-title`}
+              data-testid={`${testId}-${hour.replace(" ", "")}-title`}
             >
               <span
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-panel container-fluid"
    >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:66:54
             <div
               key={index}
               className="time-slot-no-border"
-              data-testid={`${testId}-${hour.replace(" ", "-")}-title`}
+              data-testid={`${testId}-${hour.replace("", "-")}-title`}
             >
               <span
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:70:56
             >
               <span
                 className="scheduler-hour-label"
-                data-testid={`${testId}-${hour.replace(" ", "-")}-label`}
+                data-testid={`${testId}-${hour.replace("", "-")}-label`}
               >
                 {hour}
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-panel container-fluid"
    >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:70:30
             >
               <span
                 className="scheduler-hour-label"
-                data-testid={`${testId}-${hour.replace(" ", "-")}-label`}
+                data-testid={``}
               >
                 {hour}
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-panel container-fluid"
    >

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:78:25
           ))}
         </Col>
 
-        {daysOfWeek.map((day) => (
-          <Col key={day} className="scheduler-day-column">
-            {
-              <div
-                className="scheduler-time-slot-short"
-                data-testid={`${testId}-day-slot-header`}
-              ></div>
-            }
-            {hours.slice(0, hours.length - 1).map((hour) => (
-              <div
-                key={hour}
-                className="scheduler-time-slot"
-                data-testid={`${testId}-base-slot`}
-              >
-                <Card className="scheduler-event-card" />
-              </div>
-            ))}
-          </Col>
-        ))}
+        {daysOfWeek.map(() => undefined)}
       </Row>
     </Container>
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-day-slot-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-panel container-fluid"
    >

[Killed] ArithmeticOperator
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:86:29
                 data-testid={`${testId}-day-slot-header`}
               ></div>
             }
-            {hours.slice(0, hours.length - 1).map((hour) => (
+            {hours.slice(0, hours.length + 1).map((hour) => (
               <div
                 key={hour}
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: expected 105 to be 98 // Object.is equality

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:86:51
                 data-testid={`${testId}-day-slot-header`}
               ></div>
             }
-            {hours.slice(0, hours.length - 1).map((hour) => (
-              <div
-                key={hour}
-                className="scheduler-time-slot"
-                data-testid={`${testId}-base-slot`}
-              >
-                <Card className="scheduler-event-card" />
-              </div>
-            ))}
+            {hours.slice(0, hours.length - 1).map(() => undefined)}
           </Col>
         ))}
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-base-slot"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-panel container-fluid"
    >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulePanel.jsx:90:30
               <div
                 key={hour}
                 className="scheduler-time-slot"
-                data-testid={`${testId}-base-slot`}
+                data-testid={``}
               >
                 <Card className="scheduler-event-card" />
killedBy: PersonalSchedulePanel tests renders without crashing and displays day and time headers
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-base-slot"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="scheduler-panel container-fluid"
    >
