[Killed] BlockStatement
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:17:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/personalschedules/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   const detailsCallback = (cell) => {
killedBy: PersonalSchedulesTable tests Edit button navigates to the edit page for Ordinary user
statusReason: expected "vi.fn()" to be called with arguments: [ '/personalschedules/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:21:37
     navigate(`/personalschedules/edit/${cell.row.original.id}`);
   };
 
-  const detailsCallback = (cell) => {
-    navigate(`/personalschedules/details/${cell.row.original.id}`);
-  };
+  const detailsCallback = (cell) => {};
   // Stryker disable all : hard to test for query caching
   const deleteMutation = useBackendMutation(
killedBy: PersonalSchedulesTable tests Edit button navigates to the details page for Ordinary user
statusReason: expected "vi.fn()" to be called with arguments: [ '/personalschedules/details/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:52:5
       header: "Name",
       accessorKey: "name",
     },
-    {
-      header: "Description",
-      accessorKey: "description",
-    },
+    {},
     {
       header: "Quarter",
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:56:5
       header: "Description",
       accessorKey: "description",
     },
-    {
-      header: "Quarter",
-      cell: ({ cell }) => yyyyqToQyy(cell.row.original.quarter),
-      id: "quarter",
-    },
+    {},
   ];
 
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:58:13
     },
     {
       header: "Quarter",
-      cell: ({ cell }) => yyyyqToQyy(cell.row.original.quarter),
+      cell: () => undefined,
       id: "quarter",
     },
killedBy: PersonalSchedulesTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  W22
Received:

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:59:11
     {
       header: "Quarter",
       cell: ({ cell }) => yyyyqToQyy(cell.row.original.quarter),
-      id: "quarter",
+      id: "",
     },
   ];
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrayDeclaration
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:63:25
     },
   ];
 
-  const buttonColumns = [
-    ...columns,
-    ButtonColumn(
-      "Details",
-      "primary",
-      detailsCallback,
-      "PersonalSchedulesTable",
-    ),
-    ButtonColumn("Edit", "primary", editCallback, "PersonalSchedulesTable"),
-    ButtonColumn("Delete", "danger", deleteCallback, "PersonalSchedulesTable"),
-  ];
+  const buttonColumns = [];
 
   const columnsToDisplay = showButtons ? buttonColumns : columns;
killedBy: PersonalSchedulesIndexPage tests renders three PersonalSchedules without crashing for regular user
statusReason: Unable to find an element by: [data-testid="PersonalSchedulesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:71:26
       detailsCallback,
       "PersonalSchedulesTable",
     ),
-    ButtonColumn("Edit", "primary", editCallback, "PersonalSchedulesTable"),
+    ButtonColumn("Edit", "", editCallback, "PersonalSchedulesTable"),
     ButtonColumn("Delete", "danger", deleteCallback, "PersonalSchedulesTable"),
   ];
killedBy: PersonalSchedulesTable tests Has the expected colum headers and content for Ordinary User
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalSchedulesTable.jsx:72:54
       "PersonalSchedulesTable",
     ),
     ButtonColumn("Edit", "primary", editCallback, "PersonalSchedulesTable"),
-    ButtonColumn("Delete", "danger", deleteCallback, "PersonalSchedulesTable"),
+    ButtonColumn("Delete", "danger", deleteCallback, ""),
   ];
 
killedBy: PersonalSchedulesIndexPage tests what happens when you click delete, admin
statusReason: Unable to find an element by: [data-testid="PersonalSchedulesTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
