[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:53:17
     },
     {
       header: "Title",
-      accessor: "title",
+      accessor: "",
     },
     {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:64:5
         ),
       id: "enrolled",
     },
-    {
-      header: "Location",
-      cell: ({ cell }) =>
-        formatLocation(cell.row.original.classSections[0].timeLocations),
-      id: "location",
-    },
+    {},
     {
       header: "Days",
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:70:5
         formatLocation(cell.row.original.classSections[0].timeLocations),
       id: "location",
     },
-    {
-      header: "Days",
-      cell: ({ cell }) =>
-        formatDays(cell.row.original.classSections[0].timeLocations),
-      id: "days",
-    },
+    {},
     {
       header: "Time",
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/PersonalSections/PersonalSectionsTable.jsx:72:13
     },
     {
       header: "Days",
-      cell: ({ cell }) =>
-        formatDays(cell.row.original.classSections[0].timeLocations),
+      cell: () => undefined,
       id: "days",
     },
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  M
Received:

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.jsx:80:11
       header: "Time",
       cell: ({ cell }) =>
         formatTime(cell.row.original.classSections[0].timeLocations),
-      id: "time",
+      id: "",
     },
     {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
