[Killed] StringLiteral
main/components/RateLimitedIPs/RateLimitedIPsSearchForm.jsx:38:24
           <GenericDropdown
             values={pageSizes}
             setValue={updatePageSize}
-            controlId={"RateLimitedIPsSearch.PageSize"}
+            controlId={""}
             label="Page Size"
           />
killedBy: RateLimitedIPsSearchForm tests renders form correctly
statusReason: Found a label with the text of: Page Size, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >
