[Killed] BooleanLiteral
main/components/Subjects/SingleSubjectDropdown.jsx:15:13
   controlId,
   onChange = null,
   label = "Subject Area",
-  showAll = false,
+  showAll = true,
 }) => {
   const localSearchSubject = localStorage.getItem(controlId);
killedBy: SingleSubjectDropdown tests "ALL" option is not available by default when showAll is not passed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <option
  data-testid="ssd15-option-all"
  value="ALL"
>
  ALL
</option> instead

[Killed] BlockStatement
main/components/Subjects/SingleSubjectDropdown.jsx:24:44
     localSearchSubject || subject,
   );
 
-  const handleSubjectOnChange = (event) => {
-    localStorage.setItem(controlId, event.target.value);
-    setSubjectState(event.target.value);
-    setSubject(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleSubjectOnChange = (event) => {};
 
   subjects.sort(compareValues("subjectCode"));
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests when I select a subject, the state for subject changes
statusReason: expected 'ANTH' to be 'MATH' // Object.is equality

[Killed] EqualityOperator
main/components/Subjects/SingleSubjectDropdown.jsx:28:9
     localStorage.setItem(controlId, event.target.value);
     setSubjectState(event.target.value);
     setSubject(event.target.value);
-    if (onChange != null) {
+    if (onChange == null) {
       onChange(event);
     }
killedBy: SingleSubjectDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] ConditionalExpression
main/components/Subjects/SingleSubjectDropdown.jsx:28:9
     localStorage.setItem(controlId, event.target.value);
     setSubjectState(event.target.value);
     setSubject(event.target.value);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: SingleSubjectDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] MethodExpression
main/components/Subjects/SingleSubjectDropdown.jsx:33:3
     }
   };
 
-  subjects.sort(compareValues("subjectCode"));
+  subjects;
 
   return (
killedBy: SingleSubjectDropdown tests renders without crashing on three subjects
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
main/components/Subjects/SingleSubjectDropdown.jsx:33:31
     }
   };
 
-  subjects.sort(compareValues("subjectCode"));
+  subjects.sort(compareValues(""));
 
   return (
killedBy: SingleSubjectDropdown tests renders without crashing on three subjects
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
main/components/Subjects/SingleSubjectDropdown.jsx:48:41
             ALL
           </option>
         )}
-        {subjects.map(function (object) {
-          const subjectCode = object.subjectCode.replace(/ /g, "-");
-          const key = `${controlId}-option-${subjectCode}`;
-          return (
-            <option key={key} data-testid={key} value={object.subjectCode}>
-              {object.subjectCode} - {object.subjectTranslation}
-            </option>
-          );
-        })}
+        {subjects.map(function (object) {})}
       </Form.Control>
     </Form.Group>
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element by: [data-testid="CourseOverTimeSearch.Subject-option-ANTH"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Subjects/SingleSubjectDropdown.jsx:50:23
         )}
         {subjects.map(function (object) {
           const subjectCode = object.subjectCode.replace(/ /g, "-");
-          const key = `${controlId}-option-${subjectCode}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={object.subjectCode}>
killedBy: CourseDescriptionIndexPage tests calls UCSB Curriculum api correctly with 1 course response
statusReason: Unable to find an element by: [data-testid="BasicSearch.Subject-option-ANTH"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
