[Killed] BlockStatement
main/components/UCSBSubjects/UCSBSubjectsTable.jsx:14:34
 export default function UCSBSubjectsTable({ subjects, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/UCSBSubjects/edit/${cell.row.original.subjectCode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBSubjectsTable tests Edit button navigates to the edit page for admin user
statusReason: expected "vi.fn()" to be called with arguments: [ '/UCSBSubjects/edit/GEOG' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.jsx:34:17
   const columns = [
     {
       Header: "SubjectCode",
-      accessor: "subjectCode",
+      accessor: "",
     },
     {
killedBy: AdminLoadSubjectsPage tests renders three earthquakes without crashing for regular user
statusReason: Unable to find an element by: [data-testid="UCSBSubjectsTable-cell-row-0-col-subjectCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.jsx:37:15
       accessor: "subjectCode",
     },
     {
-      Header: "SubjectTranslation",
+      Header: "",
       accessor: "subjectTranslation",
     },
killedBy: UCSBSubjectsTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element with the text: SubjectTranslation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBSubjectsTable"

[Killed] ObjectLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.jsx:40:5
       Header: "SubjectTranslation",
       accessor: "subjectTranslation",
     },
-    {
-      Header: "DeptCode",
-      accessor: "deptCode",
-    },
+    {},
     {
       Header: "CollegeCode",
killedBy: AdminLoadSubjectsPage tests renders without crashing for admin user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.jsx:46:17
     },
     {
       Header: "CollegeCode",
-      accessor: "collegeCode",
+      accessor: "",
     },
     {
killedBy: UCSBSubjectsTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="UCSBSubjectsTable-cell-row-0-col-collegeCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBSubjectsTable"

[Killed] ArrowFunction
main/components/UCSBSubjects/UCSBSubjectsTable.jsx:54:13
     },
     {
       header: "Inactive",
-      cell: ({ row }) => String(row.original.inactive),
+      cell: () => undefined,
       id: "inactive",
     },
killedBy: UCSBSubjectsTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.jsx:55:11
     {
       header: "Inactive",
       cell: ({ row }) => String(row.original.inactive),
-      id: "inactive",
+      id: "",
     },
   ];
killedBy: UCSBSubjectsTable tests renders without crashing for empty table with user not logged in
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBSubjects/UCSBSubjectsTable.jsx:61:26
 
   const columnsIfAdmin = [
     ...columns,
-    ButtonColumn("Edit", "primary", editCallback, "UCSBSubjectsTable"),
+    ButtonColumn("Edit", "", editCallback, "UCSBSubjectsTable"),
     ButtonColumn("Delete", "danger", deleteCallback, "UCSBSubjectsTable"),
   ];
killedBy: UCSBSubjectsTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
