[Killed] ObjectLiteral
main/components/Updates/UpdatesSearchForm.jsx:34:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/UCSBSubjects/all"],
     // Stryker disable next-line StringLiteral : equivalent mutation, GET is equivalent to "" (default)
-    { method: "GET", url: "/api/UCSBSubjects/all" },
+    {},
     [],
   );
killedBy: AdminUpdatesPage tests When localstorage is empty, fallback values are used
statusReason: expected [ '/api/systemInfo', undefined, …(2) ] to include '/api/UCSBSubjects/all'

[Killed] StringLiteral
main/components/Updates/UpdatesSearchForm.jsx:46:5
 
   const [quarter, setQuarter] = useLocalStorage(
     "UpdatesSearch.SubjectArea",
-    "ALL",
+    "",
   );
   const [subjectArea, setSubjectArea] = useLocalStorage(
killedBy: UpdatesSearchForm tests renders correctly when fallback values are used
statusReason: expected [ [ …(2) ], …(6) ] to deep equally contain [ 'UpdatesSearch.SubjectArea', 'ALL' ]

[Killed] BlockStatement
main/components/Updates/UpdatesSearchForm.jsx:53:34
     "ALL",
   );
 
-  const doUpdateQuarter = (q) => {
-    setQuarter(q);
-    updateQuarter(q);
-  };
+  const doUpdateQuarter = (q) => {};
 
   const doUpdateSubjectArea = (s) => {
killedBy: UpdatesSearchForm tests when I select a quarter, the state for quarter changes and local storage is updated
statusReason: expected "vi.fn()" to be called with arguments: [ '20212' ]

Number of calls: 0

[Killed] BlockStatement
main/components/Updates/UpdatesSearchForm.jsx:58:38
     updateQuarter(q);
   };
 
-  const doUpdateSubjectArea = (s) => {
-    setSubjectArea(s);
-    updateSubjectArea(s);
-  };
+  const doUpdateSubjectArea = (s) => {};
 
   return (
killedBy: UpdatesSearchForm tests when I select a subject, the state for subject changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'MATH' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Updates/UpdatesSearchForm.jsx:71:24
             quarters={quarters}
             quarter={quarter}
             setQuarter={doUpdateQuarter}
-            controlId={"UpdatesSearch.Quarter"}
+            controlId={""}
             showAll={true}
           />
killedBy: UpdatesSearchForm tests renders correctly, with ALL values in quarter and subject area dropdowns
statusReason: Unable to find an element by: [data-testid="UpdatesSearch.Quarter-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] BooleanLiteral
main/components/Updates/UpdatesSearchForm.jsx:72:22
             quarter={quarter}
             setQuarter={doUpdateQuarter}
             controlId={"UpdatesSearch.Quarter"}
-            showAll={true}
+            showAll={false}
           />
         </Col>
killedBy: UpdatesSearchForm tests renders correctly, with ALL values in quarter and subject area dropdowns
statusReason: Unable to find an element by: [data-testid="UpdatesSearch.Quarter-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] StringLiteral
main/components/Updates/UpdatesSearchForm.jsx:80:24
             subjects={subjects}
             subject={subjectArea}
             setSubject={doUpdateSubjectArea}
-            controlId={"UpdatesSearch.SubjectArea"}
+            controlId={""}
             showAll={true}
           />
killedBy: UpdatesSearchForm tests renders correctly, with ALL values in quarter and subject area dropdowns
statusReason: Unable to find an element by: [data-testid="UpdatesSearch.SubjectArea-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] BooleanLiteral
main/components/Updates/UpdatesSearchForm.jsx:81:22
             subject={subjectArea}
             setSubject={doUpdateSubjectArea}
             controlId={"UpdatesSearch.SubjectArea"}
-            showAll={true}
+            showAll={false}
           />
         </Col>
killedBy: UpdatesSearchForm tests renders correctly, with ALL values in quarter and subject area dropdowns
statusReason: Unable to find an element by: [data-testid="UpdatesSearch.SubjectArea-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >
