[Killed] ArrowFunction
main/pages/CourseDescriptions/CourseDescriptionIndexPage.jsx:13:31
   // Stryker disable next-line all : Can't test state because hook is internal
   const [hasSearched, setHasSearched] = useState(false);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/basicsearch",
-    params: {
-      qtr: query.quarter,
-      dept: query.subject,
-      level: query.level,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {
killedBy: CourseDescriptionIndexPage tests calls UCSB Curriculum api correctly with 1 course response
statusReason: expected undefined to deeply equal { qtr: '20211', dept: 'ANTH', …(1) }

[Killed] BlockStatement
main/pages/CourseDescriptions/CourseDescriptionIndexPage.jsx:22:34
     },
   });
 
-  const onSuccess = (courses) => {
-    setCourseJSON(courses.classes);
-    setHasSearched(true);
-  };
+  const onSuccess = (courses) => {};
 
   const mutation = useBackendMutation(
killedBy: CourseDescriptionIndexPage tests calls UCSB Curriculum api correctly with 1 course response
statusReason: Unable to find an element with the text: CMPSC. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/CourseDescriptions/CourseDescriptionIndexPage.jsx:24:20
 
   const onSuccess = (courses) => {
     setCourseJSON(courses.classes);
-    setHasSearched(true);
+    setHasSearched(false);
   };
 
killedBy: CourseDescriptionIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /No courses were found with the specified criteria./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/CourseDescriptions/CourseDescriptionIndexPage.jsx:34:54
     [],
   );
 
-  async function fetchBasicCourseJSON(_event, query) {
-    mutation.mutate(query);
-  }
+  async function fetchBasicCourseJSON(_event, query) {}
 
   return (
killedBy: CourseDescriptionIndexPage tests calls UCSB Curriculum api correctly with 1 course response
statusReason: expected 0 to be greater than or equal to 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] LogicalOperator
main/pages/CourseDescriptions/CourseDescriptionIndexPage.jsx:49:10
         )}
 
         {/* No results message */}
-        {!mutation.isLoading && hasSearched && courseJSON.length === 0 && (
-          <div className="text-center mt-3">
-            <p>No courses were found with the specified criteria.</p>
-          </div>
-        )}
+        {!mutation.isLoading && hasSearched && courseJSON.length === 0 || <div className="text-center mt-3">
+            <p>No courses were found with the specified criteria.</p>
+          </div>}
 
         {/* Results table */}
killedBy: CourseDescriptionIndexPage tests displays 'No courses found' message when search returns empty results
statusReason: Unable to find an element with the text: /Loading courses.../i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseDescriptions/CourseDescriptionIndexPage.jsx:56:10
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && courseJSON.length > 0 && (
-          <BasicCourseTable courses={courseJSON} />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: CourseDescriptionIndexPage tests calls UCSB Curriculum api correctly with 1 course response
statusReason: Unable to find an element with the text: CMPSC. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/CourseDescriptions/CourseDescriptionIndexPage.jsx:56:33
         )}
 
         {/* Results table */}
-        {!mutation.isLoading && courseJSON.length > 0 && (
+        {!mutation.isLoading && courseJSON.length <= 0 && (
           <BasicCourseTable courses={courseJSON} />
         )}
killedBy: CourseDescriptionIndexPage tests calls UCSB Curriculum api correctly with 1 course response
statusReason: Unable to find an element with the text: CMPSC. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
