[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.jsx:33:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    const quarter = {
-      quarter: localStorage["PersonalScheduleForm-quarter"],
-    };
-    const dataFinal = Object.assign(data, quarter);
-    mutation.mutate(dataFinal);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess) {
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesCreatePage.jsx:35:29
 
   const onSubmit = async (data) => {
     const quarter = {
-      quarter: localStorage["PersonalScheduleForm-quarter"],
+      quarter: localStorage[""],
     };
     const dataFinal = Object.assign(data, quarter);
killedBy: PersonalSchedulesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected { name: 'SampName', …(2) } to deeply equal { name: 'SampName', …(2) }
