[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.jsx:74:12
               <h2>Sections in Personal Schedule</h2>
             </Col>
           </Row>
-          {personalSection && (
-            <PersonalSectionsTable
-              personalSections={personalSection}
-              psId={id}
-              currentUser={currentUser}
-            />
-          )}
+          {false}
           {personalSection && (
             <>
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.jsx:81:12
               currentUser={currentUser}
             />
           )}
-          {personalSection && (
-            <>
-              <h2 className="mt-4">Weekly Schedule</h2>
-              <PersonalSchedulePanel
-                Events={transformToEvents(personalSection)}
-              />
-            </>
-          )}
+          {personalSection || <>
+              <h2 className="mt-4">Weekly Schedule</h2>
+              <PersonalSchedulePanel Events={transformToEvents(personalSection)} />
+            </>}
         </div>
         {backButton()}
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element with the text: Sections in Personal Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
