[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.jsx:37:54
     },
   );
 
-  const objectToAxiosParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      ...(personalSchedule.description && {
-        description: personalSchedule.description,
-      }),
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosParams = (personalSchedule) => ({});
 
   const onSuccess = () => {};
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/personalschedules/list' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesEditPage.jsx:46:11
     data: {
       user: personalSchedule.user,
       name: personalSchedule.name,
-      ...(personalSchedule.description && {
-        description: personalSchedule.description,
-      }),
+      ...(true),
       quarter: personalSchedule.quarter,
     },
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{"user":{"id":1,"email":"phtcon@ucsb.…' to be '{"user":{"id":1,"email":"phtcon@ucsb.…' // Object.is equality
