[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.jsx:48:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Weekly Schedule View</h1>
-        {personalSchedule && <h2>{personalSchedule.name}</h2>}
+        {true}
         <Row className="mb-3">
           <Col className="text-end">
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element with the text: CS156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.jsx:48:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Weekly Schedule View</h1>
-        {personalSchedule && <h2>{personalSchedule.name}</h2>}
+        {false}
         <Row className="mb-3">
           <Col className="text-end">
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element with the text: CS156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.jsx:53:24
           <Col className="text-end">
             <Button
               variant="primary"
-              onClick={() => navigate(`/personalschedules/details/${id}`)}
+              onClick={() => undefined}
             >
               Back to Details
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: expected "vi.fn()" to be called with arguments: [ '/personalschedules/details/17' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.jsx:59:10
             </Button>
           </Col>
         </Row>
-        {personalSection && (
-          <div className="mt-4">
-            <PersonalSchedulePanel
-              Events={transformToEvents(personalSection)}
-            />
-          </div>
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-Monday-column"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesWeeklyViewPage.jsx:59:10
             </Button>
           </Col>
         </Row>
-        {personalSection && (
-          <div className="mt-4">
-            <PersonalSchedulePanel
-              Events={transformToEvents(personalSection)}
-            />
-          </div>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-Monday-column"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
