[Killed] StringLiteral
src/main/utils/dateUtils.jsx:7:3
 export const daysOfWeek = [
   "Monday",
   "Tuesday",
-  "Wednesday",
+  "",
   "Thursday",
   "Friday",
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-Wednesday-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrayDeclaration
src/main/utils/dateUtils.jsx:14:22
   "Sunday",
 ];
 
-export const hours = [
-  // Stryker disable all : no test needed
-  "8 AM",
-  "9 AM",
-  "10 AM",
-  "11 AM",
-  "12 PM",
-  "1 PM",
-  "2 PM",
-  "3 PM",
-  "4 PM",
-  "5 PM",
-  "6 PM",
-  "7 PM",
-  "8 PM",
-  "9 PM",
-  "10 PM",
-  // Stryker restore all
-];
+export const hours = [];
 
 // Helper functions
killedBy: PersonalSchedulesWeeklyViewPage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="SchedulerPanel-8-AM-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
