[Killed] BlockStatement
src/main/utils/sortHelper.jsx:27:35
 
 // Stryker disable next-line StringLiteral: The "" mutant results in equivalent mutant due to it defaulting to ascending sort if order is not "desc"
 export function compareValues(key, order = "asc") {
-  return function innerSort(a, b) {
-    // Logical Operator: Requiring only one object to have the property causes comparisons to undefined to be equivalent (> or < to undefined evaluates to false which will return 0)
-    // Conditional Expression: Changing to false could have both properties be undefined but < > comparisons to undefeind are equivalent to false, returning 0 anyway
-    // BlockStatement: Removing "Return 0" reults in equivalent mutant since one or both elements will be undefined and < > comparisons will evaluate to false
-    // Stryker disable next-line LogicalOperator, ConditionalExpression, BlockStatement: Each mutant results in equivalent code (reasons in above code comment)
-    if (!Object.hasOwn(a, key) || !Object.hasOwn(b, key)) {
-      // property doesn't exist on either object
-      return 0;
-    }
-
-    const varA = typeof a[key] === "string" ? a[key].toUpperCase() : a[key];
-    const varB = typeof b[key] === "string" ? b[key].toUpperCase() : b[key];
-
-    let comparison = 0;
-    // Stryker disable next-line EqualityOperator: the >= mutant results in an equivalent mutant (if two elems are equal switching them is the same)
-    if (varA > varB) {
-      comparison = 1;
-    } else if (varA < varB) {
-      comparison = -1;
-    }
-    return (
-      // Stryker disable next-line ArithmeticOperator: The / mutant results in an equivalent mutant
-      order === "desc" ? comparison * -1 : comparison
-    );
-  };
+  return function innerSort(a, b) {};
 }
 
killedBy: SingleSubjectDropdown tests renders without crashing on three subjects
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/main/utils/sortHelper.jsx:32:9
     // Conditional Expression: Changing to false could have both properties be undefined but < > comparisons to undefeind are equivalent to false, returning 0 anyway
     // BlockStatement: Removing "Return 0" reults in equivalent mutant since one or both elements will be undefined and < > comparisons will evaluate to false
     // Stryker disable next-line LogicalOperator, ConditionalExpression, BlockStatement: Each mutant results in equivalent code (reasons in above code comment)
-    if (!Object.hasOwn(a, key) || !Object.hasOwn(b, key)) {
+    if (Object.hasOwn(a, key) || !Object.hasOwn(b, key)) {
       // property doesn't exist on either object
       return 0;
killedBy: SingleSubjectDropdown tests renders without crashing on three subjects
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/main/utils/sortHelper.jsx:32:35
     // Conditional Expression: Changing to false could have both properties be undefined but < > comparisons to undefeind are equivalent to false, returning 0 anyway
     // BlockStatement: Removing "Return 0" reults in equivalent mutant since one or both elements will be undefined and < > comparisons will evaluate to false
     // Stryker disable next-line LogicalOperator, ConditionalExpression, BlockStatement: Each mutant results in equivalent code (reasons in above code comment)
-    if (!Object.hasOwn(a, key) || !Object.hasOwn(b, key)) {
+    if (!Object.hasOwn(a, key) || Object.hasOwn(b, key)) {
       // property doesn't exist on either object
       return 0;
killedBy: SingleSubjectDropdown tests renders without crashing on three subjects
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/main/utils/sortHelper.jsx:37:47
       return 0;
     }
 
-    const varA = typeof a[key] === "string" ? a[key].toUpperCase() : a[key];
+    const varA = typeof a[key] === "string" ? a[key].toLowerCase() : a[key];
     const varB = typeof b[key] === "string" ? b[key].toUpperCase() : b[key];
 
killedBy: SingleSubjectDropdown tests renders without crashing on three subjects
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/main/utils/sortHelper.jsx:38:47
     }
 
     const varA = typeof a[key] === "string" ? a[key].toUpperCase() : a[key];
-    const varB = typeof b[key] === "string" ? b[key].toUpperCase() : b[key];
+    const varB = typeof b[key] === "string" ? b[key].toLowerCase() : b[key];
 
     let comparison = 0;
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders with correct default subject area
statusReason: expect(element).toHaveValue(ANTH)

Expected the element to have value:
  ANTH
Received:
  FAMSTW

[Killed] ConditionalExpression
src/main/utils/sortHelper.jsx:42:9
 
     let comparison = 0;
     // Stryker disable next-line EqualityOperator: the >= mutant results in an equivalent mutant (if two elems are equal switching them is the same)
-    if (varA > varB) {
+    if (true) {
       comparison = 1;
     } else if (varA < varB) {
killedBy: SingleSubjectDropdown tests renders without crashing on three subjects
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/main/utils/sortHelper.jsx:44:29
     // Stryker disable next-line EqualityOperator: the >= mutant results in an equivalent mutant (if two elems are equal switching them is the same)
     if (varA > varB) {
       comparison = 1;
-    } else if (varA < varB) {
-      comparison = -1;
-    }
+    } else if (varA < varB) {}
     return (
       // Stryker disable next-line ArithmeticOperator: The / mutant results in an equivalent mutant
killedBy: SingleSubjectDropdown tests renders without crashing on three subjects
statusReason: expected false to be true // Object.is equality

[Killed] UnaryOperator
src/main/utils/sortHelper.jsx:49:39
     }
     return (
       // Stryker disable next-line ArithmeticOperator: The / mutant results in an equivalent mutant
-      order === "desc" ? comparison * -1 : comparison
+      order === "desc" ? comparison * +1 : comparison
     );
   };
killedBy: sortHelper tests should sort by band, descending
statusReason: expected [ Array(4) ] to deeply equal [ …(4) ]
