[Killed] ObjectLiteral
src/main/utils/useBackend.jsx:65:78
 ) {
   const queryClient = useQueryClient();
 
-  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (error) => {
-      const errorMessage = `useBackendMutation: Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-      toast(errorMessage, { type: "error" });
-    },
-    // Stryker disable all : Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) queryClient.invalidateQueries(queryKey);
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
+  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {});
 }
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/utils/useBackend.jsx:68:35
   return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
     onError: (error) => {
       const errorMessage = `useBackendMutation: Error communicating with backend via ${error.response.config.method} on ${error.response.config.url}`;
-      toast(errorMessage, { type: "error" });
+      toast(errorMessage, { type: "" });
     },
     // Stryker disable all : Not sure how to set up the complex behavior needed to test this
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "useBackendMutation: Error communicating with backend via post on /api/ucsbdates/post",
