[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:40:19
     fetchJSON(event, { Quarter, buildingCode, classroom });
   };
 
-  useEffect(() => {
-    async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data;
-
-          setAvailableClassrooms(classrooms);
-          //not setting classroom to ALL because redundent when default value is ALL
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
-      }
-    }
-    fetchClassrooms();
-  }, [Quarter, buildingCode]);
+  useEffect(() => {}, [Quarter, buildingCode]);
 
   return (
killedBy: CourseOverTimeBuildingsIndexPage tests filters sections by classroom when classroom is selected
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <select
  class="form-select"
  data-testid="CourseOverTimeBuildingsSearch.ClassroomSelect"
  disabled=""
  id="CourseOverTimeBuildingsSearch.Classroom"

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:41:38
   };
 
   useEffect(() => {
-    async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data;
-
-          setAvailableClassrooms(classrooms);
-          //not setting classroom to ALL because redundent when default value is ALL
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
-      }
-    }
+    async function fetchClassrooms() {}
     fetchClassrooms();
   }, [Quarter, buildingCode]);
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: expected [] to deeply equal [ '1004', '1106', '1108', …(17) ]

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:43:13
   useEffect(() => {
     async function fetchClassrooms() {
       if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data;
-
-          setAvailableClassrooms(classrooms);
-          //not setting classroom to ALL because redundent when default value is ALL
-        } catch (error) {
+        try {} catch (error) {
           console.error("Error fetching classrooms", error);
           setAvailableClassrooms([]);
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: expected [] to deeply equal [ '1004', '1106', '1108', …(17) ]

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:56:25
 
           setAvailableClassrooms(classrooms);
           //not setting classroom to ALL because redundent when default value is ALL
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
+        } catch (error) {}
       }
     }
killedBy: CourseOverTimeBuildingsSearchForm tests displays no classrooms and logs error when fetch fails
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ArrayDeclaration
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:58:34
           //not setting classroom to ALL because redundent when default value is ALL
         } catch (error) {
           console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
+          setAvailableClassrooms(["Stryker was here"]);
         }
       }
killedBy: CourseOverTimeBuildingsSearchForm tests displays no classrooms and logs error when fetch fails
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <select
  class="form-select"
  data-testid="CourseOverTimeBuildingsSearch.ClassroomSelect"
  id="CourseOverTimeBuildingsSearch.Classroom"
/>

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:89:21
           </Col>
         </Row>
 
-        <Row style={{ paddingTop: 10 }}>
+        <Row style={{}}>
           <Col md="auto">
             <Form.Group controlId="CourseOverTimeBuildingsSearch.Classroom">
killedBy: CourseOverTimeBuildingsSearchForm tests Classroom row has correct top padding
statusReason: expect(element).toHaveAttribute("style", "padding-top: 10px;") // element.getAttribute("style") === "padding-top: 10px;"

Expected the element to have attribute:
  style="padding-top: 10px;"
Received:
  null

[Killed] ArrowFunction
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:95:27
               <Form.Label>Classroom</Form.Label>
               <Form.Select
                 value={classroom}
-                onChange={(e) => setClassroom(e.target.value)}
+                onChange={() => undefined}
                 disabled={availableClassrooms.length === 0}
                 data-testid="CourseOverTimeBuildingsSearch.ClassroomSelect"
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:96:27
               <Form.Select
                 value={classroom}
                 onChange={(e) => setClassroom(e.target.value)}
-                disabled={availableClassrooms.length === 0}
+                disabled={false}
                 data-testid="CourseOverTimeBuildingsSearch.ClassroomSelect"
               >
killedBy: CourseOverTimeBuildingsSearchForm tests renders nothing when classrooms is empty
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <select
  class="form-select"
  data-testid="CourseOverTimeBuildingsSearch.ClassroomSelect"
  id="CourseOverTimeBuildingsSearch.Classroom"
/>

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:96:27
               <Form.Select
                 value={classroom}
                 onChange={(e) => setClassroom(e.target.value)}
-                disabled={availableClassrooms.length === 0}
+                disabled={true}
                 data-testid="CourseOverTimeBuildingsSearch.ClassroomSelect"
               >
killedBy: CourseOverTimeBuildingsSearchForm tests when I select a specific classroom, it is sent to fetchJSON on submit
statusReason: expected 'ALL' to be '1106' // Object.is equality

[Killed] ArrowFunction
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:101:42
               >
                 {/* ALL at the top */}
                 <option value="ALL">ALL</option>
-                {availableClassrooms.map((room) => (
-                  <option key={room} value={room}>
-                    {room}
-                  </option>
-                ))}
+                {availableClassrooms.map(() => undefined)}
               </Form.Select>
             </Form.Group>
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: expected [] to deeply equal [ '1004', '1106', '1108', …(17) ]

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:111:21
           </Col>
         </Row>
 
-        <Row style={{ paddingTop: 10, paddingBottom: 10 }}>
+        <Row style={{}}>
           <Col md="auto">
             <Button variant="primary" type="submit">
killedBy: CourseOverTimeBuildingsSearchForm tests Button padding is correct
statusReason: expect(element).toHaveAttribute("style", "padding-top: 10px; padding-bottom: 10px;") // element.getAttribute("style") === "padding-top: 10px; padding-bottom: 10px;"

Expected the element to have attribute:
  style="padding-top: 10px; padding-bottom: 10px;"
Received:
  null
