[Killed] ObjectLiteral
main/components/CourseDetails/CourseDetailsTable.jsx:12:5
 
 export default function CourseDetailsTable({ details }) {
   const columns = [
-    {
-      header: "Course ID",
-      accessorKey: "courseId",
-    },
+    {},
     {
       header: "Enroll Code",
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: Course Details for CHEM 184 W22. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.jsx:19:13
     {
       header: "Enroll Code",
       id: "enrollCode",
-      cell: ({ cell }) => cell.row.original.classSections[0].enrollCode,
+      cell: () => undefined,
     },
     {
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: 06619. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/CourseDetails/CourseDetailsTable.jsx:23:11
     },
     {
       header: "Section",
-      id: "section",
+      id: "",
       cell: ({ cell }) => cell.row.original.classSections[0].section,
     },
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: Course Details for CHEM 184 W22. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.jsx:24:13
     {
       header: "Section",
       id: "section",
-      cell: ({ cell }) => cell.row.original.classSections[0].section,
+      cell: () => undefined,
     },
     {
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: 0100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/CourseDetails/CourseDetailsTable.jsx:30:5
       header: "Title",
       accessorKey: "title",
     },
-    {
-      header: "Enrolled",
-      cell: ({ cell }) =>
-        convertToFraction(
-          cell.row.original.classSections[0].enrolledTotal,
-          cell.row.original.classSections[0].maxEnroll,
-        ),
-      id: "enrolled",
-    },
+    {},
     {
       header: "Location",
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: Course Details for CHEM 184 W22. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/CourseDetails/CourseDetailsTable.jsx:45:5
         formatLocation(cell.row.original.classSections[0].timeLocations),
       id: "location",
     },
-    {
-      header: "Days",
-      cell: ({ cell }) => {
-        try {
-          const result =
-            cell.row.original.classSections[0].timeLocations[0].days;
-          return result;
-        } catch {
-          // Stryker disable next-line BlockStatement : equivalent mutation of "do nothing" and return ""
-          return "";
-        }
-      },
-      id: "days",
-    },
+    {},
     {
       header: "Time",
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: Course Details for CHEM 184 W22. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/CourseDetails/CourseDetailsTable.jsx:47:27
     },
     {
       header: "Days",
-      cell: ({ cell }) => {
-        try {
-          const result =
-            cell.row.original.classSections[0].timeLocations[0].days;
-          return result;
-        } catch {
-          // Stryker disable next-line BlockStatement : equivalent mutation of "do nothing" and return ""
-          return "";
-        }
-      },
+      cell: ({ cell }) => {},
       id: "days",
     },
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: T R. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/CourseDetails/CourseDetailsTable.jsx:48:13
     {
       header: "Days",
       cell: ({ cell }) => {
-        try {
-          const result =
-            cell.row.original.classSections[0].timeLocations[0].days;
-          return result;
-        } catch {
+        try {} catch {
           // Stryker disable next-line BlockStatement : equivalent mutation of "do nothing" and return ""
           return "";
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: T R. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] BlockStatement
main/components/CourseDetails/CourseDetailsTable.jsx:52:17
           const result =
             cell.row.original.classSections[0].timeLocations[0].days;
           return result;
-        } catch {
-          // Stryker disable next-line BlockStatement : equivalent mutation of "do nothing" and return ""
-          return "";
-        }
+        } catch {}
       },
       id: "days",

[Killed] StringLiteral
main/components/CourseDetails/CourseDetailsTable.jsx:54:18
           return result;
         } catch {
           // Stryker disable next-line BlockStatement : equivalent mutation of "do nothing" and return ""
-          return "";
+          return "Stryker was here!";
         }
       },
killedBy: CourseDetailsTable tests Has the expected content when days is empty
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  Stryker was here!
