[Killed] StringLiteral
main/components/Courses/BasicCourseTable.jsx:26:15
       accessor: "description",
     },
     {
-      Header: "Level Code",
+      Header: "",
       accessor: "objLevelCode",
     },
killedBy: BasicCourseTable tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Level Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="BasicCourseTable"

[Killed] StringLiteral
main/components/Courses/BasicCourseTable.jsx:40:56
   ];
 
   return (
-    <OurTable data={courses} columns={columns} testid={"BasicCourseTable"} />
+    <OurTable data={courses} columns={columns} testid={""} />
   );
 }
killedBy: BasicCourseTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="BasicCourseTable-cell-row-0-col-quarter"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
