[Killed] BlockStatement
main/components/Courses/CourseDescriptionTable.jsx:3:64
 import React from "react";
 
-export default function CourseDescriptionComponent({ course }) {
-  return (
-    <div>
-      <h5>Course Description</h5>
-      <p>{course.description}</p>
-    </div>
-  );
-}
+export default function CourseDescriptionComponent({ course }) {}
 
killedBy: CourseDetailsIndexPage tests renders enrollment history graph between course description and grade history
statusReason: Unable to find an element with the text: Course Description. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <span
    aria-hidden="true"
    id="recharts_measurement_span"
    style="position: absolute; top: -20000px; left: 0px; padd
