[Killed] ArrayDeclaration
main/components/GradeHistory/GradeHistoryHelper.jsx:1:19
-const allGrades = [
-  "A+",
-  "A",
-  "A-",
-  "B+",
-  "B",
-  "B-",
-  "C+",
-  "C",
-  "C-",
-  "D+",
-  "D",
-  "D-",
-  "F",
-  "P",
-  "NP",
-  "S",
-  "U",
-];
+const allGrades = [];
 
 export const formatTooltip = (value, _, props) => {
killedBy: Grade history tests Correctly outputs data for one quarter
statusReason: expected +0 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:8:3
   "B+",
   "B",
   "B-",
-  "C+",
+  "",
   "C",
   "C-",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(17) ] to deeply equal [ …(17) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:16:3
   "D-",
   "F",
   "P",
-  "NP",
+  "",
   "S",
   "U",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(17) ] to deeply equal [ …(17) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:17:3
   "F",
   "P",
   "NP",
-  "S",
+  "",
   "U",
 ];
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(17) ] to deeply equal [ …(17) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:22:11
 ];
 
 export const formatTooltip = (value, _, props) => {
-  return [`Percentage: ${value.toFixed(1)}%, Count: ${props.payload.count}`];
+  return [``];
 };
 
killedBy: formatTooltip tooltip displays correct formatted text
statusReason: expected [ '' ] to deeply equal [ 'Percentage: 50.1%, Count: 10' ]

[Killed] ArrayDeclaration
main/components/GradeHistory/GradeHistoryHelper.jsx:53:27
   // Added sort function to be able to display data by most recent quarter
   data.sort((a, b) => {
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
+    const [yearB, qtrB] = [];
 
     if (yearA !== yearB) {
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [ '20094-GONZALEZ T F', …(41) ] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]
