[Killed] BlockStatement
main/components/Jobs/IfStaleCheckBox.jsx:10:7
   controlId,
   onChange = null,
   label = "Update only if stale",
-}) => {
-  const handleOnChange = (event) => {
-    setIfStale(event.target.checked);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
-
-  return (
-    <Form.Group controlId={controlId}>
-      <Form.Label>{label}</Form.Label>
-      <Form.Check
-        type="checkbox"
-        id={controlId}
-        data-testid={controlId}
-        defaultChecked={ifStale}
-        onChange={handleOnChange}
-      ></Form.Check>
-    </Form.Group>
-  );
-};
+}) => {};
 
 export default IfStaleCheckBox;
killedBy: IfStaleCheckbox tests Has the expected content
statusReason: Unable to find an accessible element with the role "checkbox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
main/components/Jobs/IfStaleCheckBox.jsx:11:37
   onChange = null,
   label = "Update only if stale",
 }) => {
-  const handleOnChange = (event) => {
-    setIfStale(event.target.checked);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleOnChange = (event) => {};
 
   return (
killedBy: IfStaleCheckbox tests Toggles Correctly
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
main/components/Jobs/IfStaleCheckBox.jsx:13:9
 }) => {
   const handleOnChange = (event) => {
     setIfStale(event.target.checked);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: IfStaleCheckbox tests Toggles Correctly
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] EqualityOperator
main/components/Jobs/IfStaleCheckBox.jsx:13:9
 }) => {
   const handleOnChange = (event) => {
     setIfStale(event.target.checked);
-    if (onChange != null) {
+    if (onChange == null) {
       onChange(event);
     }
killedBy: IfStaleCheckbox tests Toggles Correctly
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times
