[Killed] ArrayDeclaration
main/components/Jobs/JobsTable.jsx:55:14
   ];
 
   const sortByIdDescending = {
-    sorting: [
-      {
-        id: "id",
-        desc: true, // sort by name in descending order by default
-      },
-    ],
+    sorting: [],
   };
 
killedBy: JobsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  6
Received:
  111/13/2022, 19:49:5811/13/2022, 19:49:59completeHello World! from test job! Goodbye from test job!

[Killed] BooleanLiteral
main/components/Jobs/JobsTable.jsx:58:15
     sorting: [
       {
         id: "id",
-        desc: true, // sort by name in descending order by default
+        desc: false, // sort by name in descending order by default
       },
     ],
killedBy: JobsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  6
Received:
  111/13/2022, 19:49:5811/13/2022, 19:49:59completeHello World! from test job! Goodbye from test job!
