[Killed] ConditionalExpression
main/components/Nav/Footer.jsx:35:15
           <a
             data-testid="footer-source-code-link"
             href={
-              systemInfo?.systemInfo?.sourceRepo ||
-              "https://github.com/ucsb-cs156/proj-courses"
+              false
             }
             target="_blank"
killedBy: Footer tests Links are correct
statusReason: expect(element).toHaveAttribute("href", "https://github.com/ucsb-cs156/proj-courses") // element.getAttribute("href") === "https://github.com/ucsb-cs156/proj-courses"

Expected the element to have attribute:
  href="https://github.com/ucsb-cs156/proj-courses"
Received:
  null

[Killed] ConditionalExpression
main/components/Nav/Footer.jsx:35:15
           <a
             data-testid="footer-source-code-link"
             href={
-              systemInfo?.systemInfo?.sourceRepo ||
-              "https://github.com/ucsb-cs156/proj-courses"
+              true
             }
             target="_blank"
killedBy: Footer tests Links are correct
statusReason: expect(element).toHaveAttribute("href", "https://github.com/ucsb-cs156/proj-courses") // element.getAttribute("href") === "https://github.com/ucsb-cs156/proj-courses"

Expected the element to have attribute:
  href="https://github.com/ucsb-cs156/proj-courses"
Received:
  null
