[Killed] BlockStatement
src/main/components/OurTableUtils.js:1:67
-export function convertOldStyleColumnsToNewStyle(oldStyleColumns) {
-  const result = [];
-  for (const col of oldStyleColumns) {
-    const newCol = {
-      id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
-      header: col.Header || col.header, // Use Header or header for the column title
-      accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
-      ...col,
-    };
-    result.push({ ...newCol });
-  }
-  return result;
-}
+export function convertOldStyleColumnsToNewStyle(oldStyleColumns) {}
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/main/components/OurTableUtils.js:3:38
 export function convertOldStyleColumnsToNewStyle(oldStyleColumns) {
   const result = [];
-  for (const col of oldStyleColumns) {
-    const newCol = {
-      id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
-      header: col.Header || col.header, // Use Header or header for the column title
-      accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
-      ...col,
-    };
-    result.push({ ...newCol });
-  }
+  for (const col of oldStyleColumns) {}
   return result;
 }
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/components/OurTableUtils.js:5:11
   const result = [];
   for (const col of oldStyleColumns) {
     const newCol = {
-      id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
+      id: col.accessor && col.accessorKey, // Use accessor or accessorKey as id
       header: col.Header || col.header, // Use Header or header for the column title
       accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [ { id: undefined, …(4) } ] to deeply equal [ { id: 'col1', …(4) } ]

[Killed] ObjectLiteral
src/main/components/OurTableUtils.js:10:17
       accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
       ...col,
     };
-    result.push({ ...newCol });
+    result.push({});
   }
   return result;
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: Unable to find an element with the text: ECE 1A -1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
