[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleSelector.jsx:16:62
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteringSchedules && filteringSchedules.length > 0) {
-      setSchedule(filteringSchedules[0].id);
-    }
+    if (filteringSchedules && filteringSchedules.length > 0) {}
   }, [filteringSchedules, setSchedule]);
 
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected "vi.fn()" to be called with arguments: [ { enrollCd: '30262', psId: 1 } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.jsx:16:9
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteringSchedules && filteringSchedules.length > 0) {
+    if (true) {
       setSchedule(filteringSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: Cannot read properties of undefined (reading 'id')
