[Killed] BlockStatement
main/components/RateLimitedIPs/RateLimitedIPsTable.jsx:3:65
 import OurTable, { DateColumn } from "main/components/OurTable";
 
-export default function RateLimitedIPsTable({ rateLimitedIPs }) {
-  const testid = "RateLimitedIPsTable";
-
-  const columns = [
-    {
-      header: "IP Address",
-      accessorKey: "ipAddress",
-      cell: ({ cell }) => (
-        <a href={`https://tools.keycdn.com/geo?host=${cell.getValue()}`}>
-          {cell.getValue()}
-        </a>
-      ),
-    },
-    {
-      header: "Request Count",
-      accessorKey: "requestCount",
-    },
-    DateColumn("Last Request At", (cell) => cell.row.original.lastRequestAt),
-  ];
-
-  return <OurTable data={rateLimitedIPs} columns={columns} testid={testid} />;
-}
+export default function RateLimitedIPsTable({ rateLimitedIPs }) {}
 
killedBy: AdminRateLimitingPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="RateLimitedIPsTable-cell-row-0-col-ipAddress"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrayDeclaration
main/components/RateLimitedIPs/RateLimitedIPsTable.jsx:6:19
 export default function RateLimitedIPsTable({ rateLimitedIPs }) {
   const testid = "RateLimitedIPsTable";
 
-  const columns = [
-    {
-      header: "IP Address",
-      accessorKey: "ipAddress",
-      cell: ({ cell }) => (
-        <a href={`https://tools.keycdn.com/geo?host=${cell.getValue()}`}>
-          {cell.getValue()}
-        </a>
-      ),
-    },
-    {
-      header: "Request Count",
-      accessorKey: "requestCount",
-    },
-    DateColumn("Last Request At", (cell) => cell.row.original.lastRequestAt),
-  ];
+  const columns = [];
 
   return <OurTable data={rateLimitedIPs} columns={columns} testid={testid} />;
killedBy: AdminRateLimitingPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="RateLimitedIPsTable-cell-row-0-col-ipAddress"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/RateLimitedIPs/RateLimitedIPsTable.jsx:10:13
     {
       header: "IP Address",
       accessorKey: "ipAddress",
-      cell: ({ cell }) => (
-        <a href={`https://tools.keycdn.com/geo?host=${cell.getValue()}`}>
-          {cell.getValue()}
-        </a>
-      ),
+      cell: () => undefined,
     },
     {
killedBy: AdminRateLimitingPage tests renders without crashing
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  192.168.1.1
Received:

[Killed] StringLiteral
main/components/RateLimitedIPs/RateLimitedIPsTable.jsx:18:20
     },
     {
       header: "Request Count",
-      accessorKey: "requestCount",
+      accessorKey: "",
     },
     DateColumn("Last Request At", (cell) => cell.row.original.lastRequestAt),
killedBy: AdminRateLimitingPage tests renders without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/RateLimitedIPs/RateLimitedIPsTable.jsx:20:35
       header: "Request Count",
       accessorKey: "requestCount",
     },
-    DateColumn("Last Request At", (cell) => cell.row.original.lastRequestAt),
+    DateColumn("Last Request At", () => undefined),
   ];
 
killedBy: RateLimitedIPsTable tests renders correctly for three rate-limited IPs
statusReason: Invalid time value
