[Killed] ArrowFunction
src/main/components/SectionsTableBase.jsx:23:17
       expanded,
     },
     onExpandedChange: setExpanded,
-    getSubRows: (row) => row.subRows, // This tells TanStack Table how to find sub-rows
+    getSubRows: () => undefined, // This tells TanStack Table how to find sub-rows
     getCoreRowModel: getCoreRowModel(),
     getExpandedRowModel: getExpandedRowModel(), // Required for expansion
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: Unable to find an element by: [data-testid="testid-cell-row-0.1-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="testid"

[Killed] ArrowFunction
src/main/components/SectionsTableBase.jsx:30:38
   return (
     <Table data-testid={testid} bordered hover className="table-hover">
       <thead>
-        {table.getHeaderGroups().map((headerGroup) => (
-          <tr key={headerGroup.id}>
-            {headerGroup.headers.map((header) => (
-              <th key={header.id} colSpan={header.colSpan}>
-                {header.isPlaceholder
-                  ? null
-                  : flexRender(
-                      header.column.columnDef.header,
-                      header.getContext(),
-                    )}
-              </th>
-            ))}
-          </tr>
-        ))}
+        {table.getHeaderGroups().map(() => undefined)}
       </thead>
       <tbody>
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element with the text: Quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] BlockStatement
src/main/components/SectionsTableBase.jsx:46:48
         ))}
       </thead>
       <tbody>
-        {table.getRowModel().rows.map((row) => {
-          const rowStyle = {
-            backgroundColor: row.index % 2 === 0 ? altColor : whiteColor,
-          };
-          const rowId = `row-${row.id}`;
-          return (
-            <tr key={rowId} style={rowStyle} data-testid={`${testid}-${rowId}`}>
-              {row.getVisibleCells().map((cell) => (
-                <td
-                  key={cell.id}
-                  data-testid={`${testid}-cell-row-${cell.row.id}-col-${cell.column.id}`}
-                  style={{
-                    backgroundColor: "inherit",
-                    fontWeight: row.depth === 0 ? "bold" : "normal",
-                  }}
-                >
-                  {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                </td>
-              ))}
-            </tr>
-          );
-        })}
+        {table.getRowModel().rows.map((row) => {})}
       </tbody>
       <tfoot>
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-quarter"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ConditionalExpression
src/main/components/SectionsTableBase.jsx:48:30
       <tbody>
         {table.getRowModel().rows.map((row) => {
           const rowStyle = {
-            backgroundColor: row.index % 2 === 0 ? altColor : whiteColor,
+            backgroundColor: true ? altColor : whiteColor,
           };
           const rowId = `row-${row.id}`;
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders rows with alternating background colors correctly
statusReason: expected 'rgb(227, 235, 252)' to be 'rgb(255, 255, 255)' // Object.is equality

[Killed] StringLiteral
src/main/components/SectionsTableBase.jsx:52:59
           };
           const rowId = `row-${row.id}`;
           return (
-            <tr key={rowId} style={rowStyle} data-testid={`${testid}-${rowId}`}>
+            <tr key={rowId} style={rowStyle} data-testid={``}>
               {row.getVisibleCells().map((cell) => (
                 <td
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: Unable to find an element by: [data-testid="testid-row-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="testid"

[Killed] ArrowFunction
src/main/components/SectionsTableBase.jsx:53:42
           const rowId = `row-${row.id}`;
           return (
             <tr key={rowId} style={rowStyle} data-testid={`${testid}-${rowId}`}>
-              {row.getVisibleCells().map((cell) => (
-                <td
-                  key={cell.id}
-                  data-testid={`${testid}-cell-row-${cell.row.id}-col-${cell.column.id}`}
-                  style={{
-                    backgroundColor: "inherit",
-                    fontWeight: row.depth === 0 ? "bold" : "normal",
-                  }}
-                >
-                  {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                </td>
-              ))}
+              {row.getVisibleCells().map(() => undefined)}
             </tr>
           );
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-quarter"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ConditionalExpression
src/main/components/SectionsTableBase.jsx:59:33
                   data-testid={`${testid}-cell-row-${cell.row.id}-col-${cell.column.id}`}
                   style={{
                     backgroundColor: "inherit",
-                    fontWeight: row.depth === 0 ? "bold" : "normal",
+                    fontWeight: true ? "bold" : "normal",
                   }}
                 >
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: expect(element).toHaveAttribute("style", "background-color: inherit; font-weight: normal;") // element.getAttribute("style") === "background-color: inherit; font-weight: normal;"

Expected the element to have attribute:
  style="background-color: inherit; font-weight: normal;"
Received:
  style="background-color: inherit; font-weight: bold;"

[Killed] ArrowFunction
src/main/components/SectionsTableBase.jsx:70:38
         })}
       </tbody>
       <tfoot>
-        {table.getFooterGroups().map((footerGroup) => (
-          <tr key={footerGroup.id}>
-            {footerGroup.headers.map((header) => (
-              <th key={header.id} colSpan={header.colSpan}>
-                {header.isPlaceholder
-                  ? null
-                  : flexRender(
-                      header.column.columnDef.footer,
-                      header.getContext(),
-                    )}
-              </th>
-            ))}
-          </tr>
-        ))}
+        {table.getFooterGroups().map(() => undefined)}
       </tfoot>
     </Table>
killedBy: SectionsTableBase tests SectionsTableBase tests for corner cases renders header with placeholder (null) when header.isPlaceholder is true
statusReason: Unable to find an element with the text: Real Footer. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="testid"
