[Killed] StringLiteral
main/components/Updates/UpdatesTable.jsx:7:18
 
 export default function UpdatesTable({
   updates,
-  testIdPrefix = "UpdatesTable",
+  testIdPrefix = "",
 }) {
   const columns = [
killedBy: UpdatesTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="UpdatesTable-cell-row-0-col-subjectArea"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""

[Killed] ObjectLiteral
main/components/Updates/UpdatesTable.jsx:14:5
       Header: "Subject Area",
       accessor: "subjectArea",
     },
-    {
-      header: "Quarter", // formatted in QXX
-      accessorKey: "quarter",
-      cell: ({ cell }) => {
-        return yyyyqToQyy(cell.row.original.quarter);
-      },
-    },
+    {},
     {
       Header: "Saved",
killedBy: AdminUpdatesPage tests Renders expected content
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Updates/UpdatesTable.jsx:17:27
     {
       header: "Quarter", // formatted in QXX
       accessorKey: "quarter",
-      cell: ({ cell }) => {
-        return yyyyqToQyy(cell.row.original.quarter);
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: UpdatesTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  F24
Received:

[Killed] StringLiteral
main/components/Updates/UpdatesTable.jsx:22:15
       },
     },
     {
-      Header: "Saved",
+      Header: "",
       accessor: "saved",
     },
killedBy: UpdatesTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Saved. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UpdatesTable"

[Killed] StringLiteral
main/components/Updates/UpdatesTable.jsx:23:17
     },
     {
       Header: "Saved",
-      accessor: "saved",
+      accessor: "",
     },
     {
killedBy: UpdatesTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="UpdatesTable-cell-row-0-col-saved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UpdatesTable"

[Killed] ObjectLiteral
main/components/Updates/UpdatesTable.jsx:25:5
       Header: "Saved",
       accessor: "saved",
     },
-    {
-      Header: "Updated",
-      accessor: "updated",
-    },
+    {},
     {
       Header: "Errors",
killedBy: AdminUpdatesPage tests Renders expected content
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Updates/UpdatesTable.jsx:29:5
       Header: "Updated",
       accessor: "updated",
     },
-    {
-      Header: "Errors",
-      accessor: "errors",
-    },
+    {},
     {
       Header: "Last Update",
killedBy: AdminUpdatesPage tests Renders expected content
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Updates/UpdatesTable.jsx:31:17
     },
     {
       Header: "Errors",
-      accessor: "errors",
+      accessor: "",
     },
     {
killedBy: UpdatesTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="UpdatesTable-cell-row-0-col-errors"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UpdatesTable"

[Killed] StringLiteral
main/components/Updates/UpdatesTable.jsx:35:17
     },
     {
       Header: "Last Update",
-      accessor: "lastUpdate",
+      accessor: "",
     },
   ];
killedBy: UpdatesTable tests Has the expected column headers and content
statusReason: Unable to find an element by: [data-testid="UpdatesTable-cell-row-0-col-lastUpdate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UpdatesTable"
