[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:21:3
     header: "Email",
     accessorKey: "email",
   },
-  {
-    header: "Admin",
-    id: "admin",
-    cell: ({ cell }) => String(cell.row.original.admin), // hack needed for boolean values to show up
-  },
+  {},
 ];
 
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:24:11
   {
     header: "Admin",
     id: "admin",
-    cell: ({ cell }) => String(cell.row.original.admin), // hack needed for boolean values to show up
+    cell: () => undefined, // hack needed for boolean values to show up
   },
 ];
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
