[Killed] BlockStatement
main/components/Utils/GenericDropdown.jsx:7:46
 const GenericDropdown = ({ values, setValue, controlId, label }) => {
   const [valueState, setValueState] = useLocalStorage(controlId, values[0]);
 
-  const handleUpdateFieldChange = (event) => {
-    localStorage.setItem(controlId, event.target.value);
-    setValueState(event.target.value);
-    setValue(event.target.value);
-  };
+  const handleUpdateFieldChange = (event) => {};
 
   return (
killedBy: UpdatesSearchForm tests when I select a sortField, the state for sortField changes
statusReason: expected 'subjectArea' to be 'quarter' // Object.is equality

[Killed] BlockStatement
main/components/Utils/GenericDropdown.jsx:21:37
         value={valueState}
         onChange={handleUpdateFieldChange}
       >
-        {values.map(function (v, i) {
-          const key = `${controlId}-option-${i}`;
-          return (
-            <option key={key} data-testid={key} value={v}>
-              {v}
-            </option>
-          );
-        })}
+        {values.map(function (v, i) {})}
       </Form.Control>
     </Form.Group>
killedBy: UpdatesSearchForm tests when I select a sortField, the state for sortField changes
statusReason: Value "quarter" not found in options

Ignored nodes: comments, script, style
<select
  class="form-control"
  id="UpdatesSearch.SortField"
/>
