[Killed] ArrowFunction
main/components/Utils/OurPagination.jsx:5:27
 import { Pagination } from "react-bootstrap";
 
 // eslint-disable-next-line react-refresh/only-export-components
-export const emptyArray = () => []; // factored out for Stryker testing
+export const emptyArray = () => undefined; // factored out for Stryker testing
 
 const OurPagination = ({
killedBy: AdminJobsPage tests renders without crashing
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ArrayDeclaration
main/components/Utils/OurPagination.jsx:5:33
 import { Pagination } from "react-bootstrap";
 
 // eslint-disable-next-line react-refresh/only-export-components
-export const emptyArray = () => []; // factored out for Stryker testing
+export const emptyArray = () => ["Stryker was here"]; // factored out for Stryker testing
 
 const OurPagination = ({
killedBy: OurPagination tests emptyArray returns empty array
statusReason: expected [ 'Stryker was here' ] to strictly equal []

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:54:25
     paginationItems.push(pageButton(1));
 
     // Case 1: activePage is near the beginning (1, 2, 3, 4)
-    if (activePage < 5) {
-      paginationItems.push(pageButton(2));
-      paginationItems.push(pageButton(3));
-      paginationItems.push(pageButton(4));
-      paginationItems.push(pageButton(5));
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="right-ellipsis"
-          data-testid={`${testId}-right-ellipsis`}
-        />,
-      );
-    }
+    if (activePage < 5) {}
     // Case 2: activePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
     else if (activePage > totalPages - 4) {
killedBy: OurPagination tests renders correctly for default values
statusReason: expected 4 to be 9 // Object.is equality

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:67:14
       );
     }
     // Case 2: activePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (activePage > totalPages - 4) {
+    else if (true) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >
