[Killed] BlockStatement
main/layouts/BasicLayout/BasicLayout.jsx:7:51
 import { useCurrentUser, useLogout } from "main/utils/currentUser";
 import { useSystemInfo } from "main/utils/systemInfo";
 
-export default function BasicLayout({ children }) {
-  const { data: currentUser } = useCurrentUser();
-  const { data: systemInfo } = useSystemInfo();
-
-  const doLogout = useLogout().mutate;
-
-  return (
-    <div className="d-flex flex-column min-vh-100">
-      <AppNavbar
-        currentUser={currentUser}
-        systemInfo={systemInfo}
-        doLogout={doLogout}
-      />
-      <Container expand="xl" className="pt-4 flex-grow-1">
-        {children}
-      </Container>
-      <Footer systemInfo={systemInfo} />
-    </div>
-  );
-}
+export default function BasicLayout({ children }) {}
 
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find a label with the text of: Quarter

Ignored nodes: comments, script, style
<body>
  <div />
</body>
