[Killed] BlockStatement
main/components/Utils/PlaintextLine.jsx:3:49
 // based in part on this SO answer: https://codereview.stackexchange.com/a/211511
 
-export default function PlaintextLine({ text }) {
-  return (
-    <>
-      <br />
-      <span>{text}</span>
-    </>
-  );
-}
+export default function PlaintextLine({ text }) {}
 
killedBy: Plaintext tests renders the correct text
statusReason: Unable to find an element with the text: bar. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <pre
      data-testid="plaintext"
    >
