[Killed] BlockStatement
src/main/utils/CoursesUtils.jsx:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/courses/user",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected undefined to deeply equal { url: '/api/courses/user', …(2) }

[Killed] ObjectLiteral
src/main/utils/CoursesUtils.jsx:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/courses/user",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
+  return {};
 }
 
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected {} to deeply equal { url: '/api/courses/user', …(2) }
