[Killed] BlockStatement
src/main/utils/PersonalScheduleUtils.jsx:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/personalschedules",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 export function schedulesFilter(schedules, quarter) {
killedBy: PersonalSchedulesIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "PersonalSchedule with id 1 was deleted",

[Killed] ObjectLiteral
src/main/utils/PersonalScheduleUtils.jsx:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/personalschedules",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
+  return {};
 }
 
killedBy: PersonalSchedulesIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "PersonalSchedule with id 1 was deleted",

[Killed] EqualityOperator
src/main/utils/PersonalScheduleUtils.jsx:19:41
 }
 
 export function schedulesFilter(schedules, quarter) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
+  return schedules.filter((schedule) => schedule.quarter !== quarter);
 }
 
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  data-testid="SectionsTable-cell-row-0.1-col-action-no-schedules"
>
  There are no personal schedules for 
  F24
  .
