[Killed] BlockStatement
src/main/utils/PersonalSectionsUtils.jsx:8:57
   toast(message);
 }
 
-export function cellToAxiosParamsDelete({ cell, psId }) {
-  return {
-    url: "/api/courses/user/psid",
-    method: "DELETE",
-    params: {
-      enrollCd: cell.row.original["classSections[0].enrollCode"],
-      psId: psId,
-    },
-  };
-}
+export function cellToAxiosParamsDelete({ cell, psId }) {}
 
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected undefined to deeply equal { url: '/api/courses/user/psid', …(2) }

[Killed] StringLiteral
src/main/utils/PersonalSectionsUtils.jsx:11:13
 export function cellToAxiosParamsDelete({ cell, psId }) {
   return {
     url: "/api/courses/user/psid",
-    method: "DELETE",
+    method: "",
     params: {
       enrollCd: cell.row.original["classSections[0].enrollCode"],
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected { url: '/api/courses/user/psid', …(2) } to deeply equal { url: '/api/courses/user/psid', …(2) }
