[Killed] BlockStatement
src/main/utils/UCSBSubjectUtils.jsx:2:42
 import { toast } from "react-toastify";
-export function onDeleteSuccess(message) {
-  console.log(message);
-  toast(message);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: UCSBSubjectUtils onDeleteSuccess It puts the message on console.log and in a toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'abc' ]

Number of calls: 0

[Killed] BlockStatement
src/main/utils/UCSBSubjectUtils.jsx:7:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/UCSBSubjects",
-    method: "DELETE",
-    params: {
-      subjectCode: cell.row.original.subjectCode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBSubjectUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected undefined to deeply equal { url: '/api/UCSBSubjects', …(2) }

[Killed] StringLiteral
src/main/utils/UCSBSubjectUtils.jsx:9:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/UCSBSubjects",
+    url: "",
     method: "DELETE",
     params: {
killedBy: UCSBSubjectUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected { url: '', method: 'DELETE', …(1) } to deeply equal { url: '/api/UCSBSubjects', …(2) }

[Killed] StringLiteral
src/main/utils/UCSBSubjectUtils.jsx:10:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/UCSBSubjects",
-    method: "DELETE",
+    method: "",
     params: {
       subjectCode: cell.row.original.subjectCode,
killedBy: UCSBSubjectUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected { url: '/api/UCSBSubjects', …(2) } to deeply equal { url: '/api/UCSBSubjects', …(2) }

[Killed] ObjectLiteral
src/main/utils/UCSBSubjectUtils.jsx:11:13
   return {
     url: "/api/UCSBSubjects",
     method: "DELETE",
-    params: {
-      subjectCode: cell.row.original.subjectCode,
-    },
+    params: {},
   };
 }
killedBy: UCSBSubjectUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected { url: '/api/UCSBSubjects', …(2) } to deeply equal { url: '/api/UCSBSubjects', …(2) }
