[Killed] Regex
src/main/utils/courseNumberUtilities.jsx:1:24
-const courseNumRegex = /^(\d{1,3})([a-zA-Z]{0,2})$/;
+const courseNumRegex = /^(\D{1,3})([a-zA-Z]{0,2})$/;
 
 const getCourseNumber = (rawCourseNumber) => {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected 0 to be greater than or equal to 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] Regex
src/main/utils/courseNumberUtilities.jsx:1:24
-const courseNumRegex = /^(\d{1,3})([a-zA-Z]{0,2})$/;
+const courseNumRegex = /^(\d{1,3})([a-zA-Z]{0,2})/;
 
 const getCourseNumber = (rawCourseNumber) => {
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course Number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="CourseOverTimeSearchForm"

[Killed] BlockStatement
src/main/utils/courseNumberUtilities.jsx:3:46
 const courseNumRegex = /^(\d{1,3})([a-zA-Z]{0,2})$/;
 
-const getCourseNumber = (rawCourseNumber) => {
-  return rawCourseNumber.match(courseNumRegex)
-    ? rawCourseNumber.match(courseNumRegex)[1]
-    : "";
-};
+const getCourseNumber = (rawCourseNumber) => {};
 const getSuffix = (rawCourseNumber) => {
   return rawCourseNumber.match(courseNumRegex)
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected { startQtr: '20222', …(3) } to deeply equal { startQtr: '20222', …(3) }

[Killed] StringLiteral
src/main/utils/courseNumberUtilities.jsx:6:7
 const getCourseNumber = (rawCourseNumber) => {
   return rawCourseNumber.match(courseNumRegex)
     ? rawCourseNumber.match(courseNumRegex)[1]
-    : "";
+    : "Stryker was here!";
 };
 const getSuffix = (rawCourseNumber) => {
killedBy: courseNumberUtilities tests getCourseNumber returns empty string for invalid input
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] BlockStatement
src/main/utils/courseNumberUtilities.jsx:8:40
     ? rawCourseNumber.match(courseNumRegex)[1]
     : "";
 };
-const getSuffix = (rawCourseNumber) => {
-  return rawCourseNumber.match(courseNumRegex)
-    ? rawCourseNumber.match(courseNumRegex)[2].toUpperCase()
-    : "";
-};
+const getSuffix = (rawCourseNumber) => {};
 export { getSuffix, getCourseNumber, courseNumRegex };
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected { startQtr: '20222', …(3) } to deeply equal { startQtr: '20222', …(3) }

[Killed] MethodExpression
src/main/utils/courseNumberUtilities.jsx:10:7
 };
 const getSuffix = (rawCourseNumber) => {
   return rawCourseNumber.match(courseNumRegex)
-    ? rawCourseNumber.match(courseNumRegex)[2].toUpperCase()
+    ? rawCourseNumber.match(courseNumRegex)[2].toLowerCase()
     : "";
 };
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expected { startQtr: '20222', …(3) } to deeply equal { startQtr: '20222', …(3) }
