[Killed] BlockStatement
src/main/utils/removeKey.jsx:1:35
-export const removeKey = (obj) => {
-  delete obj.key;
-  return obj;
-};
+export const removeKey = (obj) => {};
 
killedBy: removeKey tests it returns the object with key property removed
statusReason: expected undefined to deeply equal { foo: 'f', bar: 'b' }
