[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:106:52
 Otherwise, we return the session character.
 */
 
-export const formatSession = (quarter, session) => {
-  const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse) return "";
-  if (session === undefined || session === null) return "";
-  return session.length > 5 ? session[5] : "";
-};
+export const formatSession = (quarter, session) => {};
 
 export const getQuarter = (row) =>
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:108:7
 
 export const formatSession = (quarter, session) => {
   const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse) return "";
+  if (true) return "";
   if (session === undefined || session === null) return "";
   return session.length > 5 ? session[5] : "";
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:108:7
 
 export const formatSession = (quarter, session) => {
   const isSummerCourse = quarter?.toString().endsWith("3");
-  if (!isSummerCourse) return "";
+  if (false) return "";
   if (session === undefined || session === null) return "";
   return session.length > 5 ? session[5] : "";
killedBy: ConvertedSectionTable tests renders blank session for non-summer or missing session
statusReason: expected 'A' to be '' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:109:7
 export const formatSession = (quarter, session) => {
   const isSummerCourse = quarter?.toString().endsWith("3");
   if (!isSummerCourse) return "";
-  if (session === undefined || session === null) return "";
+  if (session !== undefined || session === null) return "";
   return session.length > 5 ? session[5] : "";
 };
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:109:32
 export const formatSession = (quarter, session) => {
   const isSummerCourse = quarter?.toString().endsWith("3");
   if (!isSummerCourse) return "";
-  if (session === undefined || session === null) return "";
+  if (session === undefined || false) return "";
   return session.length > 5 ? session[5] : "";
 };
killedBy: ConvertedSectionTable tests renders blank session when section is missing or null
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:110:10
   const isSummerCourse = quarter?.toString().endsWith("3");
   if (!isSummerCourse) return "";
   if (session === undefined || session === null) return "";
-  return session.length > 5 ? session[5] : "";
+  return session.length <= 5 ? session[5] : "";
 };
 
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:110:10
   const isSummerCourse = quarter?.toString().endsWith("3");
   if (!isSummerCourse) return "";
   if (session === undefined || session === null) return "";
-  return session.length > 5 ? session[5] : "";
+  return false ? session[5] : "";
 };
 
killedBy: ConvertedSectionTable tests renders summer session A and B from sixth character
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A
Received:

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:126:23
       data-testid={`${testid}-row-${row.id}-col-info-link`}
       target={"_blank"}
       rel="noopener noreferrer"
-      style={{ color: "black", backgroundColor: "inherit" }}
+      style={{ color: "", backgroundColor: "inherit" }}
     >
       <FontAwesomeIcon icon={faInfoCircle} />
killedBy: SectionsTable tests Section Table tests Info link is correct
statusReason: expect(element).toHaveAttribute("style", "color: black; background-color: inherit;") // element.getAttribute("style") === "color: black; background-color: inherit;"

Expected the element to have attribute:
  style="color: black; background-color: inherit;"
Received:
  style="background-color: inherit;"

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:137:20
   <p className="text-center">
     <a
       href={formatInfoLink(row)}
-      data-testid={`${testid}-row-${row.id}-col-detail-link`}
+      data-testid={``}
       target={"_blank"}
       rel="noopener noreferrer"
killedBy: SectionsTable tests Section Table tests Course ID link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-1-col-detail-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"
