[Survived] ArithmeticOperator
src/main/utils/systemInfo.jsx:4:30
 import { useQuery } from "react-query";
 import axios from "axios";
 
-const TWENTY_FOUR_HOURS_MS = 1000 * 60 * 60 * 24;
+const TWENTY_FOUR_HOURS_MS = 1000 * 60 * 60 / 24;
 
 export function useSystemInfo() {

[Survived] ArithmeticOperator
src/main/utils/systemInfo.jsx:4:30
 import { useQuery } from "react-query";
 import axios from "axios";
 
-const TWENTY_FOUR_HOURS_MS = 1000 * 60 * 60 * 24;
+const TWENTY_FOUR_HOURS_MS = 1000 * 60 / 60 * 24;
 
 export function useSystemInfo() {
