[Killed] ConditionalExpression
src/main/utils/timeUtils.jsx:2:7
 export const hhmmTohhmma = (HHMM) => {
-  if (HHMM === null) {
+  if (true) {
     return "";
   }
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  8:00 AM - 8:50 AM
Received:

[Killed] EqualityOperator
src/main/utils/timeUtils.jsx:2:7
 export const hhmmTohhmma = (HHMM) => {
-  if (HHMM === null) {
+  if (HHMM !== null) {
     return "";
   }
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/utils/timeUtils.jsx:10:7
   var minutes = Number(time[1]);
   var timeValue;
 
-  if (minutes > 59 || minutes < 0) {
+  if (minutes > 59 && minutes < 0) {
     return "";
   }
killedBy: time conversion tests hhmmTohhmma invalid minute test 1
statusReason: expected '11:0-1 PM' to be '' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/timeUtils.jsx:10:7
   var minutes = Number(time[1]);
   var timeValue;
 
-  if (minutes > 59 || minutes < 0) {
+  if (true) {
     return "";
   }
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/utils/timeUtils.jsx:14:21
     return "";
   }
 
-  if (hours > 12 && hours < 24) {
+  if (hours > 12 && hours <= 24) {
     timeValue = "" + (hours - 12);
   } else if (hours > 0 && hours <= 12) {
killedBy: time conversion tests hhmmTohhmma invalid hour test 2
statusReason: expected '12:00 PM' to be '' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/timeUtils.jsx:14:7
     return "";
   }
 
-  if (hours > 12 && hours < 24) {
+  if (false) {
     timeValue = "" + (hours - 12);
   } else if (hours > 0 && hours <= 12) {
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArithmeticOperator
src/main/utils/timeUtils.jsx:15:23
   }
 
   if (hours > 12 && hours < 24) {
-    timeValue = "" + (hours - 12);
+    timeValue = "" + (hours + 12);
   } else if (hours > 0 && hours <= 12) {
     timeValue = "" + hours;
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/utils/timeUtils.jsx:16:40
 
   if (hours > 12 && hours < 24) {
     timeValue = "" + (hours - 12);
-  } else if (hours > 0 && hours <= 12) {
-    timeValue = "" + hours;
-  } else if (hours === 0) {
+  } else if (hours > 0 && hours <= 12) {} else if (hours === 0) {
     timeValue = "12";
   } else {
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  8:00 AM - 8:50 AM
Received:
  undefined:00 AM - undefined:50 AM

[Killed] EqualityOperator
src/main/utils/timeUtils.jsx:16:14
 
   if (hours > 12 && hours < 24) {
     timeValue = "" + (hours - 12);
-  } else if (hours > 0 && hours <= 12) {
+  } else if (hours >= 0 && hours <= 12) {
     timeValue = "" + hours;
   } else if (hours === 0) {
killedBy: time conversion tests hhmmTohhmma midnight test
statusReason: expected '0:00 AM' to be '12:00 AM' // Object.is equality

[Killed] StringLiteral
src/main/utils/timeUtils.jsx:17:17
   if (hours > 12 && hours < 24) {
     timeValue = "" + (hours - 12);
   } else if (hours > 0 && hours <= 12) {
-    timeValue = "" + hours;
+    timeValue = "Stryker was here!" + hours;
   } else if (hours === 0) {
     timeValue = "12";
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  8:00 AM - 8:50 AM
Received:
  Stryker was here!8:00 AM - Stryker was here!8:50 AM

[Killed] BlockStatement
src/main/utils/timeUtils.jsx:18:27
     timeValue = "" + (hours - 12);
   } else if (hours > 0 && hours <= 12) {
     timeValue = "" + hours;
-  } else if (hours === 0) {
-    timeValue = "12";
-  } else {
+  } else if (hours === 0) {} else {
     return "";
   }
killedBy: time conversion tests hhmmTohhmma midnight test
statusReason: expected 'undefined:00 AM' to be '12:00 AM' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/timeUtils.jsx:18:14
     timeValue = "" + (hours - 12);
   } else if (hours > 0 && hours <= 12) {
     timeValue = "" + hours;
-  } else if (hours === 0) {
+  } else if (true) {
     timeValue = "12";
   } else {
killedBy: time conversion tests hhmmTohhmma invalid hour test 1
statusReason: expected '12:00 AM' to be '' // Object.is equality

[Killed] BlockStatement
src/main/utils/timeUtils.jsx:20:10
     timeValue = "" + hours;
   } else if (hours === 0) {
     timeValue = "12";
-  } else {
-    return "";
-  }
+  } else {}
 
   timeValue += minutes < 10 ? ":0" + minutes : ":" + minutes; // get minutes
killedBy: time conversion tests hhmmTohhmma invalid hour test 1
statusReason: expected 'undefined:00 AM' to be '' // Object.is equality

[Killed] StringLiteral
src/main/utils/timeUtils.jsx:21:12
   } else if (hours === 0) {
     timeValue = "12";
   } else {
-    return "";
+    return "Stryker was here!";
   }
 
killedBy: time conversion tests hhmmTohhmma invalid hour test 1
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/timeUtils.jsx:24:16
     return "";
   }
 
-  timeValue += minutes < 10 ? ":0" + minutes : ":" + minutes; // get minutes
+  timeValue += false ? ":0" + minutes : ":" + minutes; // get minutes
   timeValue += hours >= 12 ? " PM" : " AM"; // get AM/PM
 
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  8:00 AM - 8:50 AM
Received:
  8:0 AM - 8:50 AM

[Killed] EqualityOperator
src/main/utils/timeUtils.jsx:24:16
     return "";
   }
 
-  timeValue += minutes < 10 ? ":0" + minutes : ":" + minutes; // get minutes
+  timeValue += minutes >= 10 ? ":0" + minutes : ":" + minutes; // get minutes
   timeValue += hours >= 12 ? " PM" : " AM"; // get AM/PM
 
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  8:00 AM - 8:50 AM
Received:
  8:0 AM - 8:050 AM

[Killed] EqualityOperator
src/main/utils/timeUtils.jsx:25:16
   }
 
   timeValue += minutes < 10 ? ":0" + minutes : ":" + minutes; // get minutes
-  timeValue += hours >= 12 ? " PM" : " AM"; // get AM/PM
+  timeValue += hours < 12 ? " PM" : " AM"; // get AM/PM
 
   return timeValue;
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/utils/timeUtils.jsx:25:16
   }
 
   timeValue += minutes < 10 ? ":0" + minutes : ":" + minutes; // get minutes
-  timeValue += hours >= 12 ? " PM" : " AM"; // get AM/PM
+  timeValue += false ? " PM" : " AM"; // get AM/PM
 
   return timeValue;
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3:00 PM - 3:50 PM
Received:
  3:00 AM - 3:50 AM

[Killed] BlockStatement
src/main/utils/timeUtils.jsx:30:53
   return timeValue;
 };
 
-export const convertToTimeRange = (time1, time2) => {
-  return time1 !== "" && time2 !== "" ? `${time1} - ${time2}` : "";
-};
+export const convertToTimeRange = (time1, time2) => {};
 
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  8:00 AM - 8:50 AM
Received:
  undefined

[Killed] ConditionalExpression
src/main/utils/timeUtils.jsx:31:10
 };
 
 export const convertToTimeRange = (time1, time2) => {
-  return time1 !== "" && time2 !== "" ? `${time1} - ${time2}` : "";
+  return false ? `${time1} - ${time2}` : "";
 };
 
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  8:00 AM - 8:50 AM
Received:

[Killed] ConditionalExpression
src/main/utils/timeUtils.jsx:31:26
 };
 
 export const convertToTimeRange = (time1, time2) => {
-  return time1 !== "" && time2 !== "" ? `${time1} - ${time2}` : "";
+  return time1 !== "" && true ? `${time1} - ${time2}` : "";
 };
 
killedBy: time range conversion tests 12:59 - null
statusReason: expected '12:59 - ' to be '' // Object.is equality
