[Killed] BlockStatement
src/main/utils/useLocalStorage.jsx:12:56
 import { useState } from "react";
 
 const useLocalStorage = (key, initialValue) => {
-  const [storedValue, setStoredValue] = useState(() => {
-    try {
-      const item = localStorage.getItem(key);
-      if (item === null) {
-        localStorage.setItem(key, initialValue);
-        return initialValue;
-      }
-      return item;
-    } catch (error) {
-      console.error("Error: when useLocalStorage called useState", error);
-      return null;
-    }
-  });
+  const [storedValue, setStoredValue] = useState(() => {});
 
   const setValue = (value) => {
killedBy: UpdatesSearchForm tests renders correctly when fallback values are used
statusReason: expected [ …(2) ] to deep equally contain [ 'UpdatesSearch.SubjectArea', 'ALL' ]

[Killed] BlockStatement
src/main/utils/useLocalStorage.jsx:13:9
 
 const useLocalStorage = (key, initialValue) => {
   const [storedValue, setStoredValue] = useState(() => {
-    try {
-      const item = localStorage.getItem(key);
-      if (item === null) {
-        localStorage.setItem(key, initialValue);
-        return initialValue;
-      }
-      return item;
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error: when useLocalStorage called useState", error);
       return null;
killedBy: UpdatesSearchForm tests renders correctly when fallback values are used
statusReason: expected [ …(2) ] to deep equally contain [ 'UpdatesSearch.SubjectArea', 'ALL' ]

[Killed] EqualityOperator
src/main/utils/useLocalStorage.jsx:15:11
   const [storedValue, setStoredValue] = useState(() => {
     try {
       const item = localStorage.getItem(key);
-      if (item === null) {
+      if (item !== null) {
         localStorage.setItem(key, initialValue);
         return initialValue;
killedBy: UpdatesSearchForm tests renders correctly when fallback values are used
statusReason: expected [ …(2) ] to deep equally contain [ 'UpdatesSearch.SubjectArea', 'ALL' ]

[Killed] BlockStatement
src/main/utils/useLocalStorage.jsx:15:26
   const [storedValue, setStoredValue] = useState(() => {
     try {
       const item = localStorage.getItem(key);
-      if (item === null) {
-        localStorage.setItem(key, initialValue);
-        return initialValue;
-      }
+      if (item === null) {}
       return item;
     } catch (error) {
killedBy: UpdatesSearchForm tests renders correctly when fallback values are used
statusReason: expected [ …(2) ] to deep equally contain [ 'UpdatesSearch.SubjectArea', 'ALL' ]

[Killed] BlockStatement
src/main/utils/useLocalStorage.jsx:20:21
         return initialValue;
       }
       return item;
-    } catch (error) {
-      console.error("Error: when useLocalStorage called useState", error);
-      return null;
-    }
+    } catch (error) {}
   });
 
killedBy: useLocalStorage tests error handler in useState call works as expected
statusReason: expected undefined to be null // Object.is equality

[Killed] BlockStatement
src/main/utils/useLocalStorage.jsx:26:31
     }
   });
 
-  const setValue = (value) => {
-    try {
-      setStoredValue(value);
-      localStorage.setItem(key, value);
-    } catch (error) {
-      console.error("Error: in setter generated by useLocalStorage", error);
-    }
-  };
+  const setValue = (value) => {};
 
   return [storedValue, setValue];
killedBy: UpdatesSearchForm tests when I select a sortField, the state for sortField changes
statusReason: expected 'subjectArea' to be 'quarter' // Object.is equality

[Killed] BlockStatement
src/main/utils/useLocalStorage.jsx:27:9
   });
 
   const setValue = (value) => {
-    try {
-      setStoredValue(value);
-      localStorage.setItem(key, value);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error: in setter generated by useLocalStorage", error);
     }
killedBy: UpdatesSearchForm tests when I select a sortField, the state for sortField changes
statusReason: expected 'subjectArea' to be 'quarter' // Object.is equality

[Killed] BlockStatement
src/main/utils/useLocalStorage.jsx:30:21
     try {
       setStoredValue(value);
       localStorage.setItem(key, value);
-    } catch (error) {
-      console.error("Error: in setter generated by useLocalStorage", error);
-    }
+    } catch (error) {}
   };
 
killedBy: useLocalStorage tests error handler in setter works as expected
statusReason: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
src/main/utils/useLocalStorage.jsx:31:21
       setStoredValue(value);
       localStorage.setItem(key, value);
     } catch (error) {
-      console.error("Error: in setter generated by useLocalStorage", error);
+      console.error("", error);
     }
   };
killedBy: useLocalStorage tests error handler in setter works as expected
statusReason: expected '' to match 'Error: in setter generated by useLoca…'

[Killed] ArrayDeclaration
src/main/utils/useLocalStorage.jsx:35:10
     }
   };
 
-  return [storedValue, setValue];
+  return [];
 };
 
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: expected { page: +0, pageSize: undefined, …(2) } to deeply equal { page: +0, pageSize: '10', …(2) }
