[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:14:35
 export default function JobsTable({ jobs, onCancelled = () => {} }) {
   const testid = "JobsTable";
 
-  const cellToAxiosParamsCancel = (cell) => ({
-    url: `/api/jobs/${cell.row.original.id}/cancel`,
-    method: "POST",
-  });
+  const cellToAxiosParamsCancel = () => undefined;
 
   const cancelSuccess = () => {
killedBy: JobsTable tests clicking Cancel requests cancellation and calls onCancelled
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:54:26
             variant="danger"
             size="sm"
             onClick={() => cancelCallback(cell)}
-            data-testid={`JobsTable-cell-row-${cell.row.index}-col-cancel-button`}
+            data-testid={``}
           >
             Cancel
killedBy: JobsTable tests shows a Cancel button for a queued job
statusReason: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-cancel-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:75:29
         const logLines = log.split("\n");
         const truncatedLog = logLines.slice(0, 10).join("\n");
         return (
-          <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
+          <div data-testid={``}>
             {logLines.length > 10 ? (
               <>
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-Log"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/components/Jobs/JobsTable.jsx:76:14
         const truncatedLog = logLines.slice(0, 10).join("\n");
         return (
           <div data-testid={`JobsTable-cell-row-${cell.row.index}-col-Log`}>
-            {logLines.length > 10 ? (
+            {logLines.length <= 10 ? (
               <>
                 <Plaintext text={truncatedLog} />
killedBy: JobsTable tests renders long logs and handles truncation
statusReason: Unable to find an accessible element with the role "link" and name `/See entire log/i`

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.jsx:94:30
     },
   ];
 
-  const sortByIdDescending = {
-    sorting: [
-      {
-        id: "id",
-        desc: true, // sort by name in descending order by default
-      },
-    ],
-  };
+  const sortByIdDescending = {};
 
   return (
killedBy: JobsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  6
Received:
  111/13/2022, 19:49:5811/13/2022, 19:49:59completeHello World! from test job! Goodbye from test job!

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.jsx:96:7
 
   const sortByIdDescending = {
     sorting: [
-      {
-        id: "id",
-        desc: true, // sort by name in descending order by default
-      },
+      {},
     ],
   };
killedBy: JobsTable tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  6
Received:
  111/13/2022, 19:49:5811/13/2022, 19:49:59completeHello World! from test job! Goodbye from test job!
