[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:47:30
     handleModalClose();
   };
 
-  const onError = (error) => {
-    const message =
-      error?.response?.data?.message ?? error?.message ?? "Unknown error";
-    toast(`Error: ${message}`);
-  };
+  const onError = (error) => {};
 
   const mutation = useBackendMutation(
killedBy: AddToScheduleModal onSuccess and onError work as expected
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error: Stub Error' ]

Received:

  1st vi.fn() call:

  [
-   "Error: Stub Error",

[Killed] LogicalOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:49:7
 
   const onError = (error) => {
     const message =
-      error?.response?.data?.message ?? error?.message ?? "Unknown error";
+      error?.response?.data?.message && error?.message ?? "Unknown error";
     toast(`Error: ${message}`);
   };
killedBy: AddToScheduleModal onSuccess and onError work as expected
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error: Stub Error' ]

Received:

  1st vi.fn() call:

  [
-   "Error: Stub Error",

[Killed] LogicalOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:49:7
 
   const onError = (error) => {
     const message =
-      error?.response?.data?.message ?? error?.message ?? "Unknown error";
+      (error?.response?.data?.message ?? error?.message) && "Unknown error";
     toast(`Error: ${message}`);
   };
killedBy: AddToScheduleModal onSuccess and onError work as expected
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error: Stub Error' ]

Received:

  1st vi.fn() call:

  [
-   "Error: Stub Error",

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:50:11
   const onError = (error) => {
     const message =
       error?.response?.data?.message ?? error?.message ?? "Unknown error";
-    toast(`Error: ${message}`);
+    toast(``);
   };
 
killedBy: AddToScheduleModal onSuccess and onError work as expected
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error: Stub Error' ]

Received:

  1st vi.fn() call:

  [
-   "Error: Stub Error",

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:70:41
     handleModalClose();
   };
 
-  const handleModalSaveSchedule = () => {
-    mutation.mutate({ ...scheduleParams, quarter });
-  };
+  const handleModalSaveSchedule = () => {};
 
   const handleCreateClick = () => {
killedBy: AddToScheduleModal calls mutation.mutate with correct initial state when auto-creating
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.jsx:74:35
     mutation.mutate({ ...scheduleParams, quarter });
   };
 
-  const handleCreateClick = () => {
-    const safeName = `${yyyyqToQyy(quarter)} Schedule`;
-    setScheduleParams((prev) => ({
-      ...prev,
-      quarter,
-      name: safeName,
-      description: "Auto-generated schedule",
-    }));
-    setModalMode("auto-create");
-  };
+  const handleCreateClick = () => {};
 
   const onSaveButtonClick = () => {
killedBy: AddToScheduleModal uses a deterministic short schedule name in auto-create mode
statusReason: Unable to find an element with the text: /New Schedule:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:75:22
   };
 
   const handleCreateClick = () => {
-    const safeName = `${yyyyqToQyy(quarter)} Schedule`;
+    const safeName = ``;
     setScheduleParams((prev) => ({
       ...prev,
killedBy: AddToScheduleModal uses a deterministic short schedule name in auto-create mode
statusReason: expected 'New Schedule:  will be created.' to contain 'S24 Schedule'

[Killed] ArrowFunction
main/components/PersonalSchedules/AddToScheduleModal.jsx:76:23
 
   const handleCreateClick = () => {
     const safeName = `${yyyyqToQyy(quarter)} Schedule`;
-    setScheduleParams((prev) => ({
-      ...prev,
-      quarter,
-      name: safeName,
-      description: "Auto-generated schedule",
-    }));
+    setScheduleParams(() => undefined);
     setModalMode("auto-create");
   };
killedBy: AddToScheduleModal uses a deterministic short schedule name in auto-create mode
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:82:18
       name: safeName,
       description: "Auto-generated schedule",
     }));
-    setModalMode("auto-create");
+    setModalMode("");
   };
 
killedBy: AddToScheduleModal uses a deterministic short schedule name in auto-create mode
statusReason: Unable to find an element with the text: /New Schedule:/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] EqualityOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:94:36
   };
 
   const showSaveButton =
-    modalMode === "auto-create" || filteringSchedules.length > 0;
+    modalMode === "auto-create" || filteringSchedules.length <= 0;
 
   return (
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal-save-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:108:20
       <Modal
         show={showModal}
         onHide={handleModalClose}
-        animation={false}
+        animation={true}
         data-testid={`${testid}-modal`}
       >

[Killed] EqualityOperator
main/components/PersonalSchedules/AddToScheduleModal.jsx:118:48
           <Form>
             {
               /* istanbul ignore next */
-              filteringSchedules.length > 0 && modalMode === "normal" ? (
+              filteringSchedules.length > 0 && modalMode !== "normal" ? (
                 <Form.Group controlId="scheduleSelect">
                   <Form.Label>Select Schedule</Form.Label>
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="SectionsTable-cell-row-0.1-col-action-no-schedules"
>
  <p>
    There are no personal schedules for 
    F24

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:142:35
                         onClick={handleCreateClick}
                         style={{
                           backgroundColor: "transparent",
-                          border: "none",
+                          border: "",
                           color: "#007bff",
                           padding: 0,
killedBy: AddToScheduleModal has correct inline styles for create button
statusReason: expected '' to be 'none' // Object.is equality

[Killed] ConditionalExpression
main/components/PersonalSchedules/AddToScheduleModal.jsx:166:12
           >
             Cancel
           </Button>
-          {showSaveButton && (
-            <Button
-              variant="primary"
-              onClick={onSaveButtonClick}
-              data-testid={`${testid}-modal-save-button`}
-              disabled={mutation.isLoading}
-            >
-              {mutation.isLoading ? "Creating..." : "Save Changes"}
-            </Button>
-          )}
+          {true}
         </Modal.Footer>
       </Modal>
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal-save-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.jsx:170:28
             <Button
               variant="primary"
               onClick={onSaveButtonClick}
-              data-testid={`${testid}-modal-save-button`}
+              data-testid={``}
               disabled={mutation.isLoading}
             >
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-modal-save-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
