[Killed] OptionalChaining
main/components/Nav/Footer.jsx:7:23
 export const space = " ";
 
 export default function Footer(systemInfo) {
-  const feedbackUrl = systemInfo?.systemInfo?.appFeedbackUrl;
+  const feedbackUrl = systemInfo?.systemInfo.appFeedbackUrl;
   const [showFeedbackModal, setShowFeedbackModal] = useState(false);
 
killedBy: Footer tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'appFeedbackUrl')

[Survived] OptionalChaining
main/components/Nav/Footer.jsx:7:23
 export const space = " ";
 
 export default function Footer(systemInfo) {
-  const feedbackUrl = systemInfo?.systemInfo?.appFeedbackUrl;
+  const feedbackUrl = systemInfo.systemInfo?.appFeedbackUrl;
   const [showFeedbackModal, setShowFeedbackModal] = useState(false);
 

[Killed] BooleanLiteral
main/components/Nav/Footer.jsx:8:62
 
 export default function Footer(systemInfo) {
   const feedbackUrl = systemInfo?.systemInfo?.appFeedbackUrl;
-  const [showFeedbackModal, setShowFeedbackModal] = useState(false);
+  const [showFeedbackModal, setShowFeedbackModal] = useState(true);
 
   return (
killedBy: Footer tests Feedback button is shown when systemInfo.appFeedbackUrl is defined, and opens the feedback modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-primary"
  data-testid="footer-feedback-modal-link"
  href="https://example.com/feedback"
  rel="noopener noreferrer"
  role="button"

[Killed] LogicalOperator
main/components/Nav/Footer.jsx:39:15
           <a
             data-testid="footer-source-code-link"
             href={
-              systemInfo?.systemInfo?.sourceRepo ||
-              "https://github.com/ucsb-cs156/proj-courses"
+              systemInfo?.systemInfo?.sourceRepo && "https://github.com/ucsb-cs156/proj-courses"
             }
             target="_blank"
killedBy: Footer tests Links are correct
statusReason: expect(element).toHaveAttribute("href", "https://github.com/ucsb-cs156/proj-courses") // element.getAttribute("href") === "https://github.com/ucsb-cs156/proj-courses"

Expected the element to have attribute:
  href="https://github.com/ucsb-cs156/proj-courses"
Received:
  null

[Killed] StringLiteral
main/components/Nav/Footer.jsx:40:15
             data-testid="footer-source-code-link"
             href={
               systemInfo?.systemInfo?.sourceRepo ||
-              "https://github.com/ucsb-cs156/proj-courses"
+              ""
             }
             target="_blank"
killedBy: Footer tests Links are correct
statusReason: expect(element).toHaveAttribute("href", "https://github.com/ucsb-cs156/proj-courses") // element.getAttribute("href") === "https://github.com/ucsb-cs156/proj-courses"

Expected the element to have attribute:
  href="https://github.com/ucsb-cs156/proj-courses"
Received:
  href=""

[Survived] BooleanLiteral
main/components/Nav/Footer.jsx:87:50
             </Button>
             <Modal
               show={showFeedbackModal}
-              onHide={() => setShowFeedbackModal(false)}
+              onHide={() => setShowFeedbackModal(true)}
               animation={false}
               data-testid="footer-feedback-modal"

[Killed] BooleanLiteral
main/components/Nav/Footer.jsx:106:55
               <Modal.Footer>
                 <Button
                   variant="secondary"
-                  onClick={() => setShowFeedbackModal(false)}
+                  onClick={() => setShowFeedbackModal(true)}
                   data-testid="footer-feedback-modal-close-button"
                 >
killedBy: Footer tests Feedback modal closes when the Cancel button is clicked
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-primary"
  data-testid="footer-feedback-modal-link"
  href="https://example.com/feedback"
  rel="noopener noreferrer"
  role="button"

[Survived] BooleanLiteral
main/components/Nav/Footer.jsx:118:55
                   rel="noopener noreferrer"
                   target="_blank"
                   variant="primary"
-                  onClick={() => setShowFeedbackModal(false)}
+                  onClick={() => setShowFeedbackModal(true)}
                 >
                   Open Feedback Form
