[Killed] ConditionalExpression
src/main/pages/DeveloperPage.jsx:51:10
       </blockquote>
       <h2>Backend Endpoints</h2>
       <ul>
-        {systemInfo.showSwaggerUILink && (
-          <li>
-            <a
-              href="/swagger-ui/index.html"
-              data-testid="developer-swagger-link"
-            >
-              Swagger
-            </a>
-          </li>
-        )}
+        {false}
         {systemInfo.springH2ConsoleEnabled && (
           <li>
killedBy: DeveloperPage tests renders swagger and h2 console links when enabled
statusReason: Unable to find an element by: [data-testid="developer-swagger-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/DeveloperPage.jsx:51:10
       </blockquote>
       <h2>Backend Endpoints</h2>
       <ul>
-        {systemInfo.showSwaggerUILink && (
-          <li>
-            <a
-              href="/swagger-ui/index.html"
-              data-testid="developer-swagger-link"
-            >
-              Swagger
-            </a>
-          </li>
-        )}
+        {true}
         {systemInfo.springH2ConsoleEnabled && (
           <li>
killedBy: DeveloperPage tests renders swagger and h2 console links when enabled
statusReason: Unable to find an element by: [data-testid="developer-swagger-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/DeveloperPage.jsx:61:10
             </a>
           </li>
         )}
-        {systemInfo.springH2ConsoleEnabled && (
-          <li>
-            <a
-              href="/h2-console/index.html"
-              data-testid="developer-h2-console-link"
-            >
-              H2 Console
-            </a>
-          </li>
-        )}
+        {false}
       </ul>
       <h2>System Info</h2>
killedBy: DeveloperPage tests renders swagger and h2 console links when enabled
statusReason: Unable to find an element by: [data-testid="developer-h2-console-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/DeveloperPage.jsx:61:10
             </a>
           </li>
         )}
-        {systemInfo.springH2ConsoleEnabled && (
-          <li>
-            <a
-              href="/h2-console/index.html"
-              data-testid="developer-h2-console-link"
-            >
-              H2 Console
-            </a>
-          </li>
-        )}
+        {true}
       </ul>
       <h2>System Info</h2>
killedBy: DeveloperPage tests renders swagger and h2 console links when enabled
statusReason: Unable to find an element by: [data-testid="developer-h2-console-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
